--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/sameos/Documents/gits/mmnyt/supplementary_information_A.log
  log type:  text
 opened on:  11 May 2020, 13:02:30

. 
. /* 
> Need to have "esttab" and rwolf installed: 
> net install st0085_2.pkg        
> ssc install rwolf
> */ 
.         
. *Loading data:
. insheet using data/corona_status_March-28.csv, clear
(4 vars, 51 obs)

. tempfile coronastat

. save `coronastat'
file /tmp/St08156.000001 saved

. use data/processed/final_ipsos_cleaned.dta, clear

. merge m:1 state using `coronastat'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,419  (_merge==3)
    -----------------------------------------

. 
. *set scheme plainplot  xlab(,nogrid) ylab(,nogrid) 
. est clear

. 
. ******************
. *Extra variables
. ******************
. gen prior_soc_over_self=10-prior_self_over_soc
(3,303 missing values generated)

. gen prior_global_over_national=10-prior_national_over_global
(3,303 missing values generated)

. 
. *gen prior_national=.
. *replace prior_national=1 if prior_national_over_global>5 & prior_national_ove
> r_global!=.
. *replace prior_national=0 if prior_national_over_global<6
. 
. ******************
. *Interactions
. *****************
. gen republicanXcorona_prime=republican*corona_prime
(4,180 missing values generated)

. label variable republicanXcorona_prime "Republican $\times$"

. gen highincXcorona_prime=highinc*corona_prime
(3,303 missing values generated)

. label variable highincXcorona_prime "High inc. $\times$"

. gen higheducXcorona_prime=higheduc*corona_prime
(3,303 missing values generated)

. label variable higheducXcorona_prime "High educ. $\times$"

. gen femaleXcorona_prime=female*corona_prime
(3,303 missing values generated)

. label variable femaleXcorona_prime "Female $\times$"

. gen retirement_ageXcorona_prime=retirement_age*corona_prime
(3,303 missing values generated)

. label variable retirement_ageXcorona_prime "Retirement age $\times$"

. 
. ********************
. *Standardisations
. ********************
. sum luck_unfair_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT3. To what extent do you agree with the
               following statement:"It is unf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            2              1       Obs               8,116
25%            3              1       Sum of Wgt.  8,035.8357

50%            4                      Mean            3.65935
                        Largest       Std. Dev.      1.117576
75%            5              5
90%            5              5       Variance       1.248976
95%            5              5       Skewness      -.5172679
99%            5              5       Kurtosis       2.574561

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  3.659350339828534
                r(Var) =  1.248976195432858
                 r(sd) =  1.117576035638228
           r(skewness) =  -.517267890422173
           r(kurtosis) =  2.574560592286536
                r(sum) =  29405.93803292505
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  2
                r(p10) =  2
                r(p25) =  3
                r(p50) =  4
                r(p75) =  5
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen zluck_unfair_agree=(luck_unfair_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum luck_determ_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT4. To what extent do you agree with the
               following statement:"Luck is a
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            2              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.868432
                        Largest       Std. Dev.      1.193501
75%            4              5
90%            4              5       Variance       1.424444
95%            5              5       Skewness      -.0373368
99%            5              5       Kurtosis       2.030352

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.868431773921706
                r(Var) =  1.424444343189724
                 r(sd) =  1.193500876912005
           r(skewness) =  -.0373367939207468
           r(kurtosis) =  2.030352251060175
                r(sum) =  23050.24639962931
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  2
                r(p50) =  3
                r(p75) =  4
                r(p90) =  4
                r(p95) =  5
                r(p99) =  5

. gen zluck_determ_agree=(luck_determ_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum prior_soc_over_self [weight=Weightvar], detail
(analytic weights assumed)

                     prior_soc_over_self
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            2              0       Sum of Wgt.  8,035.8357

50%            4                      Mean           3.565212
                        Largest       Std. Dev.      2.322689
75%            5             10
90%            6             10       Variance       5.394886
95%            7             10       Skewness       .2848072
99%           10             10       Kurtosis       2.920235

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  3.565212042720057
                r(Var) =  5.394885880631241
                 r(sd) =  2.322689363783121
           r(skewness) =  .2848072472458315
           r(kurtosis) =  2.920234987032759
                r(sum) =  28649.45814599882
                r(min) =  0
                r(max) =  10
                 r(p1) =  0
                 r(p5) =  0
                r(p10) =  0
                r(p25) =  2
                r(p50) =  4
                r(p75) =  5
                r(p90) =  6
                r(p95) =  7
                r(p99) =  10

. gen zprior_soc_over_self=(prior_soc_over_self-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum compassion_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT6. To what extent do you agree with the
               following statement:"Compassio
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            3              1       Obs               8,116
25%            4              1       Sum of Wgt.  8,035.8357

50%            4                      Mean            4.03994
                        Largest       Std. Dev.      .8809639
75%            5              5
90%            5              5       Variance       .7760974
95%            5              5       Skewness      -.8567095
99%            5              5       Kurtosis       3.672765

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  4.039940188427707
                r(Var) =  .7760973717213281
                 r(sd) =  .8809638878644959
           r(skewness) =  -.8567095462010423
           r(kurtosis) =  3.67276544741716
                r(sum) =  32464.29551842124
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  2
                r(p10) =  3
                r(p25) =  4
                r(p50) =  4
                r(p75) =  5
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen zcompassion_agree=(compassion_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum prior_national_over_global [weight=Weightvar], detail
(analytic weights assumed)

       QTREATMENT7. Should your country's leaders give
              priority to solving global probl
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%            4              0       Obs               8,116
25%            5              0       Sum of Wgt.  8,035.8357

50%            7                      Mean           7.061913
                        Largest       Std. Dev.      2.383245
75%            9             10
90%           10             10       Variance       5.679856
95%           10             10       Skewness      -.6560286
99%           10             10       Kurtosis       3.148516

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  7.061912978091506
                r(Var) =  5.67985588568293
                 r(sd) =  2.383244822858728
           r(skewness) =  -.6560285519746337
           r(kurtosis) =  3.148515786195785
                r(sum) =  56748.37229096749
                r(min) =  0
                r(max) =  10
                 r(p1) =  0
                 r(p5) =  3
                r(p10) =  4
                r(p25) =  5
                r(p50) =  7
                r(p75) =  9
                r(p90) =  10
                r(p95) =  10
                r(p99) =  10

. gen zprior_national_over_global=(prior_national_over_global-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum noborders_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT8. To what extent do you agree with the
               following statement:"I wish th
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            1              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.697935
                        Largest       Std. Dev.      1.341706
75%            4              5
90%            5              5       Variance       1.800174
95%            5              5       Skewness       .2083494
99%            5              5       Kurtosis       1.857193

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.69793468998817
                r(Var) =  1.800174168875804
                 r(sd) =  1.341705693837439
           r(skewness) =  .2083494317119767
           r(kurtosis) =  1.857192804806354
                r(sum) =  21680.1598489169
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  1
                r(p50) =  3
                r(p75) =  4
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen znoborders_agree=(noborders_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum gov_reduce_inequality_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT9. To what extent do you agree with the
               following statement:"In the US
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            2              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.362846
                        Largest       Std. Dev.      .7762263
75%            3              3
90%            3              3       Variance       .6025273
95%            3              3       Skewness      -.7286359
99%            3              3       Kurtosis       2.026137

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.362845904246193
                r(Var) =  .6025273234795642
                 r(sd) =  .7762263352138757
           r(skewness) =  -.7286358840747065
           r(kurtosis) =  2.026137364766178
                r(sum) =  18987.44142788745
                r(min) =  1
                r(max) =  3
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  2
                r(p50) =  3
                r(p75) =  3
                r(p90) =  3
                r(p95) =  3
                r(p99) =  3

. gen zgov_reduce_inequality_agree=(gov_reduce_inequality_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum fed_univ_healthcare [weight=Weightvar], detail
(analytic weights assumed)

           QGDW5A. Is it the federal government's
          responsibility to make sure all Americans
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.  8,035.8357

50%            1                      Mean           .6270628
                        Largest       Std. Dev.      .4836154
75%            1              1
90%            1              1       Variance       .2338839
95%            1              1       Skewness      -.5255027
99%            1              1       Kurtosis       1.276153

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  .6270627681621332
                r(Var) =  .2338838705751888
                 r(sd) =  .4836154159817373
           r(skewness) =  -.5255026725971073
           r(kurtosis) =  1.276153058906696
                r(sum) =  5038.973367112522
                r(min) =  0
                r(max) =  1
                 r(p1) =  0
                 r(p5) =  0
                r(p10) =  0
                r(p25) =  0
                r(p50) =  1
                r(p75) =  1
                r(p90) =  1
                r(p95) =  1
                r(p99) =  1

. gen zfed_univ_healthcare=(fed_univ_healthcare-r(mean))/r(sd)
(3,303 missing values generated)

. 
. *****************
. *Confirmed Covid-19 infected state per person*100, March 28th
. *****************
. gen infected_march28=(confirmed/pop2019)*100

. label variable infected_march28 "Confirmed cases"

. 
. sum infected_march28 [weight=Weightvar], detail
(analytic weights assumed)

                       Confirmed cases
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0053567       .0049628
 5%     .0084667       .0049628
10%     .0084667       .0049628       Obs              11,419
25%     .0113568       .0049628       Sum of Wgt.      11,419

50%      .016458                      Mean           .0374526
                        Largest       Std. Dev.      .0633561
75%     .0225608       .2694108
90%     .0713088       .2694108       Variance        .004014
95%     .2694108       .2694108       Skewness       3.073208
99%     .2694108       .2694108       Kurtosis       11.25418

. return list

scalars:
                  r(N) =  11419
              r(sum_w) =  11419.00000000001
               r(mean) =  .037452550149249
                r(Var) =  .004013992967383
                 r(sd) =  .0633560807451268
           r(skewness) =  3.073207679523767
           r(kurtosis) =  11.25417663480748
                r(sum) =  427.6706701542744
                r(min) =  .0049627586267889
                r(max) =  .2694108188152313
                 r(p1) =  .0053567034192383
                 r(p5) =  .0084667196497321
                r(p10) =  .0084667196497321
                r(p25) =  .0113568007946014
                r(p50) =  .0164580326527357
                r(p75) =  .0225607696920633
                r(p90) =  .0713088139891624
                r(p95) =  .2694108188152313
                r(p99) =  .2694108188152313

. *Weighted median confirmed cases, 0.01645803
. gen high_confirmed=0

. replace high_confirmed=1 if infected_march28>0.01645803
(6,024 real changes made)

. 
. gen infected_march28Xcorona_prime=infected_march28*corona_prime
(3,303 missing values generated)

. label variable infected_march28Xcorona_prime "Confirmed cases $\times$"

. 
. label variable high_confirmed "High confirmed"

. gen high_confirmedXcorona_prime=high_confirmed*corona_prime
(3,303 missing values generated)

. label variable high_confirmedXcorona_prime "High confirmed $\times$"

. 
. *For descriptives table
. gen infected_march28_des=(confirmed/pop2019)*100000

. 
. 
. *************************************************************************
. *DESCRIPTIVES, Table S1
. *************************************************************************
. preserve

. drop if luck_determ_agree==.
(3,303 observations deleted)

. 
. table GDW6 if corona_prime==0

---------------------------------
GDW6. Which          |
political party      |
would you vote for   |
if there was an      |
election tomorrow    |      Freq.
---------------------+-----------
          Republican |      1,492
          Democratic |      1,738
               Other |        411
Prefer not to answer |        401
---------------------------------

. table GDW6 if corona_prime==1

---------------------------------
GDW6. Which          |
political party      |
would you vote for   |
if there was an      |
election tomorrow    |      Freq.
---------------------+-----------
          Republican |      1,511
          Democratic |      1,633
               Other |        454
Prefer not to answer |        476
---------------------------------

. table GDW6

---------------------------------
GDW6. Which          |
political party      |
would you vote for   |
if there was an      |
election tomorrow    |      Freq.
---------------------+-----------
          Republican |      3,003
          Democratic |      3,371
               Other |        865
Prefer not to answer |        877
---------------------------------

. 
. sum income if corona_prime==0, detail

                           income
-------------------------------------------------------------
      Percentiles      Smallest
 1%         5000           5000
 5%         7500           5000
10%        17500           5000       Obs               4,042
25%        32500           5000       Sum of Wgt.       4,042

50%        57500                      Mean           69075.95
                        Largest       Std. Dev.      50454.29
75%        95000         250000
90%       137500         250000       Variance       2.55e+09
95%       162500         250000       Skewness       1.275765
99%       250000         250000       Kurtosis        4.85427

. sum income if corona_prime==1, detail

                           income
-------------------------------------------------------------
      Percentiles      Smallest
 1%         5000           5000
 5%         7500           5000
10%        12500           5000       Obs               4,074
25%        32500           5000       Sum of Wgt.       4,074

50%        57500                      Mean           66775.28
                        Largest       Std. Dev.      50104.92
75%        95000         250000
90%       137500         250000       Variance       2.51e+09
95%       162500         250000       Skewness       1.347534
99%       250000         250000       Kurtosis        5.04232

. sum income, detail

                           income
-------------------------------------------------------------
      Percentiles      Smallest
 1%         5000           5000
 5%         7500           5000
10%        12500           5000       Obs               8,116
25%        32500           5000       Sum of Wgt.       8,116

50%        57500                      Mean           67921.08
                        Largest       Std. Dev.      50289.28
75%        95000         250000
90%       137500         250000       Variance       2.53e+09
95%       162500         250000       Skewness       1.310888
99%       250000         250000       Kurtosis       4.943528

. 
. gen income_imputed=income

. replace income_imputed=375000 if income_imputed==250000
(112 real changes made)

. sum income_imputed if corona_prime==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
income_imp~d |      4,042    70900.54    58573.24       5000     375000

. sum income_imputed if corona_prime==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
income_imp~d |      4,074    68401.45    57508.54       5000     375000

. sum income_imputed

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
income_imp~d |      8,116    69646.07    58051.11       5000     375000

. 
. sum highinc if corona_prime==0, detail

                          High inc.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .3975755
                        Largest       Std. Dev.      .4894573
75%            1              1
90%            1              1       Variance       .2395685
95%            1              1       Skewness       .4185746
99%            1              1       Kurtosis       1.175205

. sum highinc if corona_prime==1, detail

                          High inc.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .3782523
                        Largest       Std. Dev.      .4850106
75%            1              1
90%            1              1       Variance       .2352352
95%            1              1       Skewness       .5021029
99%            1              1       Kurtosis       1.252107

. sum highinc, detail

                          High inc.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .3878758
                        Largest       Std. Dev.       .487296
75%            1              1
90%            1              1       Variance       .2374574
95%            1              1       Skewness       .4602176
99%            1              1       Kurtosis         1.2118

. 
. sum higheduc if corona_prime==0, detail

                         High educ.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .4195943
                        Largest       Std. Dev.      .4935536
75%            1              1
90%            1              1       Variance       .2435952
95%            1              1       Skewness        .325864
99%            1              1       Kurtosis       1.106187

. sum higheduc if corona_prime==1, detail

                         High educ.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .4180167
                        Largest       Std. Dev.      .4932935
75%            1              1
90%            1              1       Variance       .2433385
95%            1              1       Skewness       .3324324
99%            1              1       Kurtosis       1.110511

. sum higheduc, detail

                         High educ.
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .4188024
                        Largest       Std. Dev.      .4933933
75%            1              1
90%            1              1       Variance       .2434369
95%            1              1       Skewness       .3291599
99%            1              1       Kurtosis       1.108346

. 
. sum female if corona_prime==0, detail

                           Female
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            1                      Mean           .5403266
                        Largest       Std. Dev.      .4984328
75%            1              1
90%            1              1       Variance       .2484352
95%            1              1       Skewness      -.1618335
99%            1              1       Kurtosis        1.02619

. sum female if corona_prime==1, detail

                           Female
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            1                      Mean           .5488463
                        Largest       Std. Dev.      .4976694
75%            1              1
90%            1              1       Variance       .2476748
95%            1              1       Skewness      -.1963245
99%            1              1       Kurtosis       1.038543

. sum female, detail

                           Female
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            1                      Mean           .5446033
                        Largest       Std. Dev.      .4980373
75%            1              1
90%            1              1       Variance       .2480411
95%            1              1       Skewness      -.1791272
99%            1              1       Kurtosis       1.032087

. 
. sum age if corona_prime==0, detail

                             Age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           18             18
 5%           21             18
10%           24             18       Obs               4,042
25%           33             18       Sum of Wgt.       4,042

50%           49                      Mean           48.02276
                        Largest       Std. Dev.      17.13102
75%           62             91
90%           70             91       Variance       293.4719
95%           74             92       Skewness       .0183817
99%           82             93       Kurtosis       1.977679

. sum age if corona_prime==1, detail

                             Age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           18             18
 5%           21             18
10%           24             18       Obs               4,074
25%           33             18       Sum of Wgt.       4,074

50%           49                      Mean           47.98061
                        Largest       Std. Dev.       17.0866
75%           62             89
90%           70             95       Variance       291.9517
95%           74             96       Skewness       .0049476
99%           81             97       Kurtosis       1.981493

. sum age, detail

                             Age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           18             18
 5%           21             18
10%           24             18       Obs               8,116
25%           33             18       Sum of Wgt.       8,116

50%           49                      Mean            48.0016
                        Largest       Std. Dev.      17.10769
75%           62             93
90%           70             95       Variance       292.6732
95%           74             96       Skewness       .0116739
99%           82             97       Kurtosis       1.979633

. 
. sum retirement_age if corona_prime==0, detail

                       Retirement age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .1862939
                        Largest       Std. Dev.      .3893918
75%            0              1
90%            1              1       Variance        .151626
95%            1              1       Skewness       1.611461
99%            1              1       Kurtosis       3.596807

. sum retirement_age if corona_prime==1, detail

                       Retirement age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .1838488
                        Largest       Std. Dev.      .3874084
75%            0              1
90%            1              1       Variance       .1500853
95%            1              1       Skewness       1.632334
99%            1              1       Kurtosis       3.664515

. sum retirement_age, detail

                       Retirement age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .1850665
                        Largest       Std. Dev.      .3883755
75%            0              1
90%            1              1       Variance       .1508355
95%            1              1       Skewness       1.621899
99%            1              1       Kurtosis       3.630556

. 
. sum child if corona_prime==0, detail

                            Child
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean            .240475
                        Largest       Std. Dev.      .4274248
75%            0              1
90%            1              1       Variance        .182692
95%            1              1       Skewness       1.214516
99%            1              1       Kurtosis       2.475049

. sum child if corona_prime==1, detail

                            Child
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .2508591
                        Largest       Std. Dev.      .4335608
75%            1              1
90%            1              1       Variance        .187975
95%            1              1       Skewness       1.149419
99%            1              1       Kurtosis       2.321164

. sum child, detail

                            Child
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .2456875
                        Largest       Std. Dev.      .4305206
75%            0              1
90%            1              1       Variance        .185348
95%            1              1       Skewness       1.181491
99%            1              1       Kurtosis       2.395921

. 
. sum alone if corona_prime==0, detail

                        Living alone
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .2157348
                        Largest       Std. Dev.       .411382
75%            0              1
90%            1              1       Variance       .1692352
95%            1              1       Skewness       1.382172
99%            1              1       Kurtosis         2.9104

. sum alone if corona_prime==1, detail

                        Living alone
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .2152676
                        Largest       Std. Dev.      .4110583
75%            0              1
90%            1              1       Variance       .1689689
95%            1              1       Skewness       1.385533
99%            1              1       Kurtosis       2.919702

. sum alone, detail

                        Living alone
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .2155002
                        Largest       Std. Dev.      .4111943
75%            0              1
90%            1              1       Variance       .1690807
95%            1              1       Skewness       1.383858
99%            1              1       Kurtosis       2.915064

. 
. sum urban if corona_prime==0, detail

                            Urban
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            1              0       Sum of Wgt.       4,042

50%            1                      Mean           .7553191
                        Largest       Std. Dev.       .429951
75%            1              1
90%            1              1       Variance       .1848579
95%            1              1       Skewness      -1.187813
99%            1              1       Kurtosis         2.4109

. sum urban if corona_prime==1, detail

                            Urban
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            1              0       Sum of Wgt.       4,074

50%            1                      Mean           .7503682
                        Largest       Std. Dev.       .432853
75%            1              1
90%            1              1       Variance       .1873618
95%            1              1       Skewness       -1.15697
99%            1              1       Kurtosis       2.338579

. sum urban, detail

                            Urban
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            1              0       Sum of Wgt.       8,116

50%            1                      Mean           .7528339
                        Largest       Std. Dev.      .4313907
75%            1              1
90%            1              1       Variance       .1860979
95%            1              1       Skewness      -1.172253
99%            1              1       Kurtosis       2.374177

. 
. sum northeast if corona_prime==0, detail

                          Northeast
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .2041069
                        Largest       Std. Dev.      .4030973
75%            0              1
90%            1              1       Variance       .1624875
95%            1              1       Skewness       1.468279
99%            1              1       Kurtosis       3.155844

. sum northeast if corona_prime==1, detail

                          Northeast
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .1980854
                        Largest       Std. Dev.      .3986058
75%            0              1
90%            1              1       Variance       .1588866
95%            1              1       Skewness       1.515039
99%            1              1       Kurtosis       3.295343

. sum northeast, detail

                          Northeast
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .2010843
                        Largest       Std. Dev.      .4008356
75%            0              1
90%            1              1       Variance       .1606692
95%            1              1       Skewness       1.491555
99%            1              1       Kurtosis       3.224736

. 
. sum midwest if corona_prime==0, detail

                           Midwest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .2248887
                        Largest       Std. Dev.      .4175606
75%            0              1
90%            1              1       Variance       .1743569
95%            1              1       Skewness        1.31787
99%            1              1       Kurtosis       2.736782

. sum midwest if corona_prime==1, detail

                           Midwest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .2307315
                        Largest       Std. Dev.      .4213526
75%            0              1
90%            1              1       Variance        .177538
95%            1              1       Skewness       1.278272
99%            1              1       Kurtosis       2.633979

. sum midwest, detail

                           Midwest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .2278216
                        Largest       Std. Dev.      .4194527
75%            0              1
90%            1              1       Variance       .1759406
95%            1              1       Skewness       1.297859
99%            1              1       Kurtosis       2.684437

. 
. sum west if corona_prime==0, detail

                            West
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .2224146
                        Largest       Std. Dev.      .4159197
75%            0              1
90%            1              1       Variance       .1729892
95%            1              1       Skewness       1.334968
99%            1              1       Kurtosis       2.782139

. sum west if corona_prime==1, detail

                            West
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .2250859
                        Largest       Std. Dev.      .4176902
75%            0              1
90%            1              1       Variance       .1744651
95%            1              1       Skewness       1.316516
99%            1              1       Kurtosis       2.733214

. sum west, detail

                            West
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .2237555
                        Largest       Std. Dev.      .4167858
75%            0              1
90%            1              1       Variance       .1737104
95%            1              1       Skewness       1.325676
99%            1              1       Kurtosis       2.757417

. 
. sum south if corona_prime==0, detail

                            South
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            0                      Mean           .3485898
                        Largest       Std. Dev.      .4765828
75%            1              1
90%            1              1       Variance       .2271311
95%            1              1       Skewness        .635478
99%            1              1       Kurtosis       1.403832

. sum south if corona_prime==1, detail

                            South
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            0                      Mean           .3460972
                        Largest       Std. Dev.       .475783
75%            1              1
90%            1              1       Variance       .2263695
95%            1              1       Skewness       .6470247
99%            1              1       Kurtosis       1.418641

. sum south, detail

                            South
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            0                      Mean           .3473386
                        Largest       Std. Dev.      .4761538
75%            1              1
90%            1              1       Variance       .2267224
95%            1              1       Skewness       .6412668
99%            1              1       Kurtosis       1.411223

. 
. sum infected_march28_des if corona_prime==0, detail

                    infected_march28_des
-------------------------------------------------------------
      Percentiles      Smallest
 1%     5.356703       4.962759
 5%      8.46672       4.962759
10%     8.505547       4.962759       Obs               4,042
25%      11.3568       4.962759       Sum of Wgt.       4,042

50%     17.52047                      Mean           39.48904
                        Largest       Std. Dev.      65.64023
75%     27.54932       269.4108
90%     71.30882       269.4108       Variance        4308.64
95%     269.4108       269.4108       Skewness       2.907333
99%     269.4108       269.4108       Kurtosis       10.21126

. sum infected_march28_des if corona_prime==1, detail

                    infected_march28_des
-------------------------------------------------------------
      Percentiles      Smallest
 1%     5.356703       4.962759
 5%      8.46672       4.962759
10%      8.46672       4.962759       Obs               4,074
25%      11.3568       4.962759       Sum of Wgt.       4,074

50%     17.52047                      Mean           39.23384
                        Largest       Std. Dev.      64.87063
75%     27.54932       269.4108
90%     71.30882       269.4108       Variance       4208.199
95%     269.4108       269.4108       Skewness       2.937678
99%     269.4108       269.4108       Kurtosis       10.43854

. sum infected_march28_des, detail

                    infected_march28_des
-------------------------------------------------------------
      Percentiles      Smallest
 1%     5.356703       4.962759
 5%      8.46672       4.962759
10%      8.46672       4.962759       Obs               8,116
25%      11.3568       4.962759       Sum of Wgt.       8,116

50%     17.52047                      Mean           39.36094
                        Largest       Std. Dev.      65.25115
75%     27.54932       269.4108
90%     71.30882       269.4108       Variance       4257.713
95%     269.4108       269.4108       Skewness       2.922502
99%     269.4108       269.4108       Kurtosis       10.32434

. 
. sum high_confirmed if corona_prime==0, detail

                       High confirmed
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,042
25%            0              0       Sum of Wgt.       4,042

50%            1                      Mean           .5257298
                        Largest       Std. Dev.      .4993993
75%            1              1
90%            1              1       Variance       .2493997
95%            1              1       Skewness      -.1030559
99%            1              1       Kurtosis       1.010621

. sum high_confirmed if corona_prime==1, detail

                       High confirmed
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,074
25%            0              0       Sum of Wgt.       4,074

50%            1                      Mean           .5279823
                        Largest       Std. Dev.      .4992777
75%            1              1
90%            1              1       Variance       .2492782
95%            1              1       Skewness       -.112105
99%            1              1       Kurtosis       1.012568

. sum high_confirmed, detail

                       High confirmed
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.       8,116

50%            1                      Mean           .5268605
                        Largest       Std. Dev.      .4993088
75%            1              1
90%            1              1       Variance       .2493092
95%            1              1       Skewness      -.1075975
99%            1              1       Kurtosis       1.011577

. 
. restore

. 
. *************************************************************************
. *PRIMING EFFECTS, MAIN OUTCOMES, Table S2
. *************************************************************************
. 
. reg zprior_soc_over_self corona_prime [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       8.43
                                                Prob > F          =     0.0037
                                                R-squared         =     0.0012
                                                Root MSE          =     .99944

------------------------------------------------------------------------------
             |               Robust
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0703882   .0242385     2.90   0.004     .0228745    .1179019
       _cons |  -.0349294    .017053    -2.05   0.041    -.0683577   -.0015011
------------------------------------------------------------------------------

. est store col1

. reg zprior_soc_over_self corona_prime republican highinc higheduc female retir
> ement_age high_confirmed child alone urban northeast midwest south [pw=Weightv
> ar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      17.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     .97592

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0645152   .0251615     2.56   0.010     .0151913    .1138391
   republican |  -.3067634   .0260083   -11.79   0.000    -.3577473   -.2557795
      highinc |  -.0071296   .0281813    -0.25   0.800    -.0623731    .0481139
     higheduc |   .0788258   .0267547     2.95   0.003     .0263787    .1312729
       female |   .1027485   .0254502     4.04   0.000     .0528586    .1526383
retirement~ge |  -.1139175    .032072    -3.55   0.000     -.176788    -.051047
high_confir~d |  -.0389454   .0280855    -1.39   0.166    -.0940013    .0161104
        child |  -.0881924   .0314766    -2.80   0.005    -.1498958   -.0264889
        alone |  -.0172651    .035319    -0.49   0.625    -.0865005    .0519704
        urban |   .0244654   .0306947     0.80   0.425    -.0357052     .084636
    northeast |   .0233881   .0427535     0.55   0.584    -.0604213    .1071974
      midwest |   .0341179   .0373069     0.91   0.360    -.0390145    .1072503
        south |  -.0330761   .0336352    -0.98   0.325     -.099011    .0328588
        _cons |    .041228   .0476561     0.87   0.387    -.0521919    .1346479
-------------------------------------------------------------------------------

. est store col2

. 
. reg zprior_national_over_global corona_prime [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.46
                                                Prob > F          =     0.4961
                                                R-squared         =     0.0001
                                                Root MSE          =          1

------------------------------------------------------------------------------
             |               Robust
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |    .016648   .0244596     0.68   0.496    -.0312991    .0645951
       _cons |  -.0082614    .017288    -0.48   0.633    -.0421503    .0256275
------------------------------------------------------------------------------

. est store col3

. reg zprior_national_over_global corona_prime republican highinc higheduc femal
> e retirement_age high_confirmed child alone urban northeast midwest south [pw=
> Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      52.66
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0927
                                                Root MSE          =     .94184

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0057937   .0243962     0.24   0.812    -.0420299    .0536174
   republican |   .5543855   .0245063    22.62   0.000      .506346    .6024251
      highinc |   .0441229   .0272091     1.62   0.105    -.0092149    .0974606
     higheduc |  -.0834206   .0263294    -3.17   0.002    -.1350339   -.0318072
       female |   .0499797   .0248021     2.02   0.044     .0013602    .0985991
retirement~ge |   .2090981   .0294164     7.11   0.000     .1514334    .2667628
high_confir~d |   .0199767   .0274392     0.73   0.467    -.0338121    .0737655
        child |  -.0012714   .0306411    -0.04   0.967     -.061337    .0587942
        alone |  -.0416604   .0336474    -1.24   0.216    -.1076191    .0242983
        urban |   -.042801    .028951    -1.48   0.139    -.0995535    .0139514
    northeast |   .0027129   .0411186     0.07   0.947    -.0778915    .0833173
      midwest |   .0605886   .0359335     1.69   0.092    -.0098515    .1310287
        south |   .0418293    .033112     1.26   0.207    -.0230799    .1067385
        _cons |   -.243185   .0465237    -5.23   0.000     -.334385    -.151985
-------------------------------------------------------------------------------

. est store col4

. 
. reg zluck_unfair_agree corona_prime [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =      12.41
                                                Prob > F          =     0.0004
                                                R-squared         =     0.0019
                                                Root MSE          =     .99913

------------------------------------------------------------------------------
             |               Robust
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0861083   .0244436    -3.52   0.000     -.134024   -.0381925
       _cons |   .0427303    .017631     2.42   0.015     .0081691    .0772916
------------------------------------------------------------------------------

. est store col5

. reg zluck_unfair_agree corona_prime republican highinc higheduc female retirem
> ent_age high_confirmed child alone urban northeast midwest south [pw=Weightvar
> ], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      24.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0503
                                                Root MSE          =     .98431

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0835438   .0255067    -3.28   0.001    -.1335443   -.0335433
   republican |  -.3387756   .0269589   -12.57   0.000     -.391623   -.2859282
      highinc |  -.1402159   .0282078    -4.97   0.000    -.1955115   -.0849203
     higheduc |   .0200641   .0274233     0.73   0.464    -.0336937    .0738218
       female |   .0718182   .0256202     2.80   0.005     .0215952    .1220412
retirement~ge |  -.1416885   .0326029    -4.35   0.000    -.2055997   -.0777774
high_confir~d |  -.0078669   .0288346    -0.27   0.785     -.064391    .0486573
        child |    .128957   .0319748     4.03   0.000     .0662772    .1916369
        alone |   .0184081   .0340409     0.54   0.589    -.0483219    .0851382
        urban |   .0771224   .0306295     2.52   0.012     .0170797    .1371651
    northeast |   .1284176   .0428563     3.00   0.003     .0444067    .2124285
      midwest |  -.0420466   .0386569    -1.09   0.277    -.1178255    .0337323
        south |   .0464089   .0351714     1.32   0.187    -.0225373    .1153552
        _cons |   .1020212   .0484089     2.11   0.035     .0071255    .1969169
-------------------------------------------------------------------------------

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/priming.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime retirement_age female highinc republican higheduc child alon
> e urban high_confirmed northeast midwest south _cons) ///
> label mtitle("Solidarity (std.)"  "Solidarity (std.)"  "Nationalism (std.)" "N
> ationalism (std.)" "Luck unfair (std.)" "Luck unfair (std.)") ///
> b(3)
(output written to tables/priming.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, SOLIDARITY, Table S3
. *************************************************************************
. 
. reg zprior_soc_over_self corona_prime republicanXcorona_prime republican highi
> nc higheduc female retirement_age high_confirmed child alone urban northeast m
> idwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     .97596

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |    .052795    .033086     1.60   0.111    -.0120633    .1176532
republicanX~e |   .0299143   .0507976     0.59   0.556    -.0696639    .1294925
   republican |  -.3216173   .0358362    -8.97   0.000    -.3918666    -.251368
      highinc |  -.0075668   .0281544    -0.27   0.788    -.0627576    .0476241
     higheduc |    .079341   .0267676     2.96   0.003     .0268687    .1318133
       female |   .1027731   .0254525     4.04   0.000     .0528787    .1526675
retirement~ge |  -.1137456   .0320891    -3.54   0.000    -.1766497   -.0508416
high_confir~d |  -.0388453   .0280903    -1.38   0.167    -.0939106      .01622
        child |  -.0883205   .0314665    -2.81   0.005    -.1500041   -.0266369
        alone |  -.0176464   .0352804    -0.50   0.617    -.0868063    .0515135
        urban |   .0243116    .030696     0.79   0.428    -.0358615    .0844847
    northeast |   .0239232   .0427704     0.56   0.576    -.0599192    .1077656
      midwest |   .0345395   .0373071     0.93   0.355    -.0385932    .1076723
        south |  -.0327789   .0336466    -0.97   0.330     -.098736    .0331783
        _cons |   .0467236   .0485484     0.96   0.336    -.0484455    .1418927
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0827092   .0385512     2.15   0.032     .0071376    .1582808
------------------------------------------------------------------------------

. estadd scalar Wint1=r(estimate)

added scalar:
              e(Wint1) =  .08270922

. estadd scalar sd1=r(se)

added scalar:
                e(sd1) =  .0385512

. est store col1

. 
. reg zprior_soc_over_self corona_prime highincXcorona_prime republican highinc 
> higheduc female retirement_age high_confirmed child alone urban northeast midw
> est south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      16.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0342
                                                Root MSE          =     .97589

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0374363   .0343338     1.09   0.276    -.0298681    .1047406
highincXcor~e |   .0549439   .0503367     1.09   0.275    -.0437308    .1536185
   republican |   -.307081   .0259956   -11.81   0.000    -.3580399   -.2561221
      highinc |  -.0343984   .0371298    -0.93   0.354    -.1071836    .0383867
     higheduc |   .0791824   .0267407     2.96   0.003     .0267627     .131602
       female |   .1028512   .0254459     4.04   0.000     .0529698    .1527325
retirement~ge |  -.1147361   .0320612    -3.58   0.000    -.1775854   -.0518868
high_confir~d |     -.0386   .0280763    -1.37   0.169    -.0936378    .0164377
        child |  -.0884887   .0314658    -2.81   0.005    -.1501709   -.0268066
        alone |  -.0178024   .0352888    -0.50   0.614    -.0869788     .051374
        urban |   .0242738   .0306912     0.79   0.429    -.0358898    .0844375
    northeast |   .0234775   .0427658     0.55   0.583     -.060356     .107311
      midwest |   .0330774   .0373046     0.89   0.375    -.0400505    .1062052
        south |  -.0342155   .0336548    -1.02   0.309    -.1001888    .0317578
        _cons |   .0556774   .0493323     1.13   0.259    -.0410284    .1523832
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0923802   .0368304     2.51   0.012     .0201819    .1645784
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .09238016

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03683036

. est store col2

. 
. reg zprior_soc_over_self corona_prime higheducXcorona_prime republican highinc
>  higheduc female retirement_age high_confirmed child alone urban northeast mid
> west south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0342
                                                Root MSE          =     .97587

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0925575   .0349409     2.65   0.008     .0240632    .1610518
higheducXco~e |  -.0597631   .0502758    -1.19   0.235    -.1583184    .0387921
   republican |  -.3075028   .0260191   -11.82   0.000    -.3585079   -.2564977
      highinc |  -.0073295    .028164    -0.26   0.795    -.0625391    .0478801
     higheduc |   .1083521   .0359314     3.02   0.003     .0379161    .1787881
       female |   .1028237   .0254459     4.04   0.000     .0529423    .1527052
retirement~ge |  -.1138936    .032079    -3.55   0.000    -.1767779   -.0510094
high_confir~d |  -.0394131    .028098    -1.40   0.161    -.0944935    .0156673
        child |  -.0878957   .0314583    -2.79   0.005    -.1495631   -.0262284
        alone |  -.0168477   .0352961    -0.48   0.633    -.0860384    .0523431
        urban |   .0240281   .0306926     0.78   0.434    -.0361384    .0841946
    northeast |   .0243972   .0427061     0.57   0.568    -.0593192    .1081137
      midwest |    .034652   .0373064     0.93   0.353    -.0384795    .1077835
        south |  -.0324524   .0336085    -0.97   0.334    -.0983349    .0334302
        _cons |   .0277035   .0486568     0.57   0.569     -.067678     .123085
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0327944    .036189     0.91   0.365    -.0381466    .1037355
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .03279442

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03618901

. est store col3

. 
. reg zprior_soc_over_self corona_prime femaleXcorona_prime republican highinc h
> igheduc female retirement_age high_confirmed child alone urban northeast midwe
> st south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     .97599

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0633503   .0369475     1.71   0.086    -.0090775    .1357782
femaleXcoro~e |   .0022798   .0504513     0.05   0.964    -.0966195    .1011791
   republican |  -.3067601   .0260099   -11.79   0.000    -.3577472    -.255773
      highinc |   -.007121   .0281725    -0.25   0.800    -.0623473    .0481054
     higheduc |   .0788178   .0267488     2.95   0.003     .0263824    .1312532
       female |   .1016288   .0351453     2.89   0.004     .0327336     .170524
retirement~ge |  -.1139066   .0320763    -3.55   0.000    -.1767855   -.0510278
high_confir~d |  -.0389707    .028072    -1.39   0.165    -.0939999    .0160586
        child |  -.0882207   .0314836    -2.80   0.005    -.1499377   -.0265037
        alone |  -.0172663   .0353231    -0.49   0.625    -.0865099    .0519774
        urban |   .0244829   .0307221     0.80   0.426    -.0357414    .0847073
    northeast |   .0234331   .0427607     0.55   0.584    -.0603904    .1072566
      midwest |   .0341541   .0373629     0.91   0.361    -.0390882    .1073963
        south |   -.033059   .0336438    -0.98   0.326    -.0990107    .0328926
        _cons |   .0417753   .0486795     0.86   0.391    -.0536507    .1372013
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0656301    .034314     1.91   0.056    -.0016353    .1328956
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .06563014

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .034314

. est store col4

. 
. reg zprior_soc_over_self corona_prime retirement_ageXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      16.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0343
                                                Root MSE          =     .97581

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0474966   .0282546     1.68   0.093    -.0078906    .1028839
retirement~me |   .0965283    .061134     1.58   0.114    -.0233121    .2163687
   republican |  -.3063192   .0259967   -11.78   0.000    -.3572803   -.2553581
      highinc |  -.0081039   .0281864    -0.29   0.774    -.0633574    .0471496
     higheduc |   .0792672   .0267502     2.96   0.003     .0268289    .1317055
       female |    .103171   .0254447     4.05   0.000      .053292      .15305
retirement~ge |  -.1613699   .0431498    -3.74   0.000     -.245956   -.0767837
high_confir~d |  -.0398023   .0280934    -1.42   0.157    -.0948736    .0152689
        child |   -.087399   .0314665    -2.78   0.005    -.1490825   -.0257155
        alone |  -.0171004   .0353249    -0.48   0.628    -.0863477    .0521468
        urban |   .0243145   .0306835     0.79   0.428    -.0358342    .0844631
    northeast |   .0234879   .0427511     0.55   0.583    -.0603168    .1072927
      midwest |   .0332801   .0373146     0.89   0.372    -.0398675    .1064277
        south |  -.0335662     .03362    -1.00   0.318    -.0994713    .0323389
        _cons |   .0501018   .0480564     1.04   0.297    -.0441028    .1443064
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1440249   .0541929     2.66   0.008      .037791    .2502589
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .14402493

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .05419291

. est store col5

. 
. reg zprior_soc_over_self corona_prime high_confirmedXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     .97594

-------------------------------------------------------------------------------
              |               Robust
zprior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0842357    .035682     2.36   0.018     .0142887    .1541828
high_confir~e |  -.0388669   .0503524    -0.77   0.440    -.1375723    .0598386
   republican |  -.3071257   .0260254   -11.80   0.000    -.3581431   -.2561084
      highinc |  -.0074591   .0281708    -0.26   0.791     -.062682    .0477639
     higheduc |   .0788257   .0267593     2.95   0.003     .0263697    .1312817
       female |   .1028843   .0254452     4.04   0.000     .0530044    .1527643
retirement~ge |  -.1133287    .032076    -3.53   0.000    -.1762071   -.0504504
high_confir~d |  -.0196435   .0370471    -0.53   0.596    -.0922665    .0529796
        child |  -.0883336   .0314882    -2.81   0.005    -.1500597   -.0266075
        alone |   -.017658   .0353006    -0.50   0.617    -.0868575    .0515415
        urban |   .0243828   .0306949     0.79   0.427    -.0357881    .0845538
    northeast |   .0228468   .0427499     0.53   0.593    -.0609554     .106649
      midwest |   .0342679   .0373049     0.92   0.358    -.0388607    .1073964
        south |  -.0332136   .0336469    -0.99   0.324    -.0991714    .0327442
        _cons |     .03184   .0487341     0.65   0.514    -.0636931    .1273731
-------------------------------------------------------------------------------

. lincom corona_prime + high_confirmedXcorona_prime

 ( 1)  corona_prime + high_confirmedXcorona_prime = 0

------------------------------------------------------------------------------
zprior_soc~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0453689    .035505     1.28   0.201    -.0242312    .1149689
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .04536886

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03550495

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/heterogeneityzsol.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interac.)" "Observations" "\(
> R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime high_confirmedXcorona_p
> rime _cons) ///
> label mtitle("Solidarity (std.)" "Solidarity (std.)" "Solidarity (std.)" "Soli
> darity (std.)" "Solidarity (std.)" "Solidarity (std.)") ///
> b(3)
(output written to tables/heterogeneityzsol.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, NATIONALISM, Table S4
. *************************************************************************
. reg zprior_national_over_global corona_prime  republicanXcorona_prime republic
> an highinc higheduc female retirement_age high_confirmed child alone urban nor
> theast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0929
                                                Root MSE          =     .94178

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0308132   .0335483     0.92   0.358    -.0349513    .0965776
republicanX~e |  -.0638584   .0479043    -1.33   0.183    -.1577649    .0300481
   republican |   .5860943    .033378    17.56   0.000     .5206637     .651525
      highinc |   .0450561   .0272018     1.66   0.098    -.0082674    .0983795
     higheduc |  -.0845203   .0263317    -3.21   0.001    -.1361382   -.0329024
       female |   .0499271   .0248005     2.01   0.044     .0013108    .0985434
retirement~ge |   .2087312   .0294306     7.09   0.000     .1510386    .2664238
high_confir~d |    .019763   .0274411     0.72   0.471    -.0340296    .0735555
        child |  -.0009978   .0306406    -0.03   0.974    -.0610624    .0590667
        alone |  -.0408464   .0336239    -1.21   0.224    -.1067591    .0250664
        urban |  -.0424727   .0289501    -1.47   0.142    -.0992234     .014278
    northeast |   .0015706    .041115     0.04   0.970    -.0790269    .0821681
      midwest |   .0596885   .0359562     1.66   0.097    -.0107962    .1301733
        south |   .0411948   .0331222     1.24   0.214    -.0237344    .1061239
        _cons |  -.2549167   .0475822    -5.36   0.000    -.3481916   -.1616417
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0330453    .034171    -0.97   0.334    -.1000305    .0339399
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.03304527

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03417102

. est store col1

. 
. reg zprior_national_over_global corona_prime highincXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      48.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0927
                                                Root MSE          =      .9419

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0017616   .0336468    -0.05   0.958    -.0677192    .0641961
highincXcor~e |   .0153299   .0488732     0.31   0.754     -.080476    .1111357
   republican |   .5542969   .0245071    22.62   0.000     .5062558    .6023381
      highinc |   .0365146   .0360843     1.01   0.312    -.0342211    .1072503
     higheduc |  -.0833211   .0263376    -3.16   0.002    -.1349506   -.0316916
       female |   .0500083   .0248037     2.02   0.044     .0013858    .0986308
retirement~ge |   .2088697   .0294248     7.10   0.000     .1511885     .266551
high_confir~d |   .0200731   .0274374     0.73   0.464    -.0337122    .0738584
        child |  -.0013541   .0306453    -0.04   0.965    -.0614278    .0587197
        alone |  -.0418103    .033656    -1.24   0.214     -.107786    .0241653
        urban |  -.0428545   .0289541    -1.48   0.139     -.099613     .013904
    northeast |   .0027379   .0411179     0.07   0.947    -.0778652    .0833409
      midwest |   .0602983   .0359241     1.68   0.093    -.0101235    .1307201
        south |   .0415114    .033117     1.25   0.210    -.0234076    .1064304
        _cons |  -.2391535   .0479713    -4.99   0.000    -.3331913   -.1451156
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0135683   .0354145     0.38   0.702    -.0558544    .0829911
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01356832

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0354145

. est store col2

. 
. reg zprior_national_over_global corona_prime higheducXcorona_prime republican 
> highinc higheduc female retirement_age high_confirmed child alone urban northe
> ast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0929
                                                Root MSE          =      .9418

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0205143   .0341949    -0.60   0.549    -.0875463    .0465177
higheducXco~e |   .0560671   .0487878     1.15   0.251    -.0395713    .1517055
   republican |   .5550792   .0245049    22.65   0.000     .5070424     .603116
      highinc |   .0443104   .0272013     1.63   0.103    -.0090121    .0976328
     higheduc |  -.1111208   .0351168    -3.16   0.002      -.17996   -.0422816
       female |    .049909   .0248005     2.01   0.044     .0012929    .0985252
retirement~ge |   .2090757    .029433     7.10   0.000     .1513784     .266773
high_confir~d |   .0204155   .0274434     0.74   0.457    -.0333816    .0742125
        child |  -.0015497   .0306428    -0.05   0.960    -.0616185    .0585192
        alone |   -.042052   .0336348    -1.25   0.211    -.1079861    .0238821
        urban |  -.0423908    .028941    -1.46   0.143    -.0991237    .0143421
    northeast |   .0017661   .0411124     0.04   0.966    -.0788262    .0823584
      midwest |   .0600876   .0359412     1.67   0.095    -.0103677    .1305428
        south |   .0412441   .0330984     1.25   0.213    -.0236385    .1061266
        _cons |   -.230497   .0481814    -4.78   0.000    -.3249466   -.1360473
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0355528   .0347702     1.02   0.307    -.0326071    .1037126
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .03555276

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03477023

. est store col3

. 
. reg zprior_national_over_global corona_prime femaleXcorona_prime republican hi
> ghinc higheduc female retirement_age high_confirmed child alone urban northeas
> t midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      48.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0927
                                                Root MSE          =      .9419

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   -.000129   .0365066    -0.00   0.997    -.0716927    .0714347
femaleXcoro~e |   .0115915   .0489752     0.24   0.813    -.0844143    .1075973
   republican |   .5544025   .0245074    22.62   0.000     .5063609     .602444
      highinc |   .0441669   .0272044     1.62   0.105    -.0091616    .0974953
     higheduc |  -.0834614   .0263266    -3.17   0.002    -.1350692   -.0318535
       female |   .0442868   .0340907     1.30   0.194    -.0225409    .1111146
retirement~ge |   .2091535   .0294284     7.11   0.000     .1514653    .2668417
high_confir~d |   .0198483   .0274432     0.72   0.470    -.0339483     .073645
        child |  -.0014155   .0306515    -0.05   0.963    -.0615013    .0586704
        alone |  -.0416666     .03365    -1.24   0.216    -.1076304    .0242972
        urban |  -.0427118   .0289715    -1.47   0.140    -.0995044    .0140807
    northeast |   .0029419   .0410827     0.07   0.943    -.0775922     .083476
      midwest |   .0607726   .0359407     1.69   0.091    -.0096818    .1312269
        south |   .0419163    .033104     1.27   0.205    -.0229772    .1068097
        _cons |  -.2404021    .048229    -4.98   0.000     -.334945   -.1458592
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0114625   .0325931     0.35   0.725    -.0524296    .0753546
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01146249

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03259315

. est store col4

. 
. reg zprior_national_over_global corona_prime retirement_ageXcorona_prime repub
> lican highinc higheduc female retirement_age high_confirmed child alone urban 
> northeast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0930
                                                Root MSE          =     .94173

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0225851   .0276915     0.82   0.415    -.0316983    .0768684
retirement~me |  -.0952394   .0560648    -1.70   0.089    -.2051427    .0146639
   republican |   .5539472   .0244954    22.61   0.000      .505929    .6019654
      highinc |   .0450841   .0271887     1.66   0.097    -.0082136    .0983819
     higheduc |   -.083856   .0263113    -3.19   0.001    -.1354338   -.0322782
       female |   .0495628   .0248026     2.00   0.046     .0009424    .0981832
retirement~ge |   .2559169    .039561     6.47   0.000     .1783657     .333468
high_confir~d |   .0208222   .0274557     0.76   0.448     -.032999    .0746434
        child |  -.0020542    .030635    -0.07   0.947    -.0621077    .0579993
        alone |  -.0418228   .0336475    -1.24   0.214    -.1077819    .0241362
        urban |  -.0426521   .0289491    -1.47   0.141    -.0994009    .0140966
    northeast |   .0026144   .0410947     0.06   0.949    -.0779432    .0831719
      midwest |   .0614152     .03591     1.71   0.087    -.0089788    .1318093
        south |   .0423128   .0330877     1.28   0.201    -.0225488    .1071744
        _cons |  -.2519404    .046879    -5.37   0.000    -.3438369   -.1600439
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0726543   .0487795    -1.49   0.136    -.1682764    .0229677
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.0726543

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04877948

. est store col5

. 
. reg zprior_national_over_global corona_prime high_confirmedXcorona_prime repub
> lican highinc higheduc female retirement_age high_confirmed child alone urban 
> northeast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      48.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0927
                                                Root MSE          =     .94189

-------------------------------------------------------------------------------
              |               Robust
zprior_nati~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   -.003934   .0347243    -0.11   0.910    -.0720038    .0641358
high_confir~e |   .0191722   .0489463     0.39   0.695    -.0767767    .1151212
   republican |   .5545643   .0245277    22.61   0.000     .5064829    .6026457
      highinc |   .0442854    .027212     1.63   0.104    -.0090581    .0976288
     higheduc |  -.0834205   .0263336    -3.17   0.002     -.135042    -.031799
       female |   .0499126    .024807     2.01   0.044     .0012837    .0985415
retirement~ge |   .2088077   .0294404     7.09   0.000      .151096    .2665194
high_confir~d |   .0104555   .0361238     0.29   0.772    -.0603577    .0812686
        child |  -.0012017   .0306419    -0.04   0.969    -.0612688    .0588654
        alone |  -.0414666   .0336498    -1.23   0.218    -.1074301    .0244969
        urban |  -.0427603   .0289525    -1.48   0.140    -.0995157    .0139951
    northeast |   .0029799   .0411237     0.07   0.942    -.0776345    .0835944
      midwest |   .0605146   .0359502     1.68   0.092    -.0099583    .1309876
        south |   .0418971   .0331177     1.27   0.206    -.0230233    .1068175
        _cons |  -.2385541   .0480888    -4.96   0.000    -.3328223    -.144286
-------------------------------------------------------------------------------

. lincom corona_prime + high_confirmedXcorona_prime

 ( 1)  corona_prime + high_confirmedXcorona_prime = 0

------------------------------------------------------------------------------
zprior_nat~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0152383   .0343897     0.44   0.658    -.0521756    .0826521
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01523825

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03438972

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/heterogeneity_znationalism.t
> ex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder+ Interaction)" "Observations" "
> \(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime high_confirmedXcorona_p
> rime _cons) ///
> label mtitle("Nationalism (std.)" "Nationalism (std.)" "Nationalism (std.)" "N
> ationalism (std.)" "Nationalism (std.)" "Nationalism (std.)") ///
> b(3)
(output written to tables/heterogeneity_znationalism.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, LUCK UNFAIR, Table S5
. *************************************************************************
. reg zluck_unfair_agree corona_prime republicanXcorona_prime republican highinc
>  higheduc female retirement_age high_confirmed child alone urban northeast mid
> west south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0512
                                                Root MSE          =     .98394

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.1310001   .0321544    -4.07   0.000    -.1940322    -.067968
republicanX~e |   .1211253   .0527884     2.29   0.022     .0176446    .2246059
   republican |  -.3989201   .0384625   -10.37   0.000    -.4743179   -.3235223
      highinc |   -.141986   .0281875    -5.04   0.000    -.1972417   -.0867302
     higheduc |     .02215    .027424     0.81   0.419    -.0316091    .0759091
       female |   .0719179   .0256015     2.81   0.005     .0217314    .1221044
retirement~ge |  -.1409926   .0326021    -4.32   0.000    -.2049023   -.0770829
high_confir~d |  -.0074614   .0288203    -0.26   0.796    -.0639576    .0490348
        child |   .1284382   .0319278     4.02   0.000     .0658504     .191026
        alone |   .0168641   .0340156     0.50   0.620    -.0498165    .0835447
        urban |   .0764996   .0305785     2.50   0.012     .0165568    .1364424
    northeast |   .1305843   .0428366     3.05   0.002     .0466122    .2145565
      midwest |  -.0403394   .0386563    -1.04   0.297     -.116117    .0354383
        south |   .0476125   .0351572     1.35   0.176     -.021306     .116531
        _cons |   .1242735   .0489832     2.54   0.011     .0282522    .2202948
-------------------------------------------------------------------------------

. lincom corona_prime + republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0098748   .0418029    -0.24   0.813    -.0918208    .0720711
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.00987484

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04180292

. est store col1

. 
. reg zluck_unfair_agree corona_prime highincXcorona_prime republican highinc hi
> gheduc female retirement_age high_confirmed child alone urban northeast midwes
> t south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0507
                                                Root MSE          =     .98415

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0414592   .0324788    -1.28   0.202    -.1051271    .0222087
highincXcor~e |  -.0853908   .0511202    -1.67   0.095    -.1856013    .0148197
   republican |   -.338282   .0269583   -12.55   0.000     -.391128   -.2854359
      highinc |  -.0978361   .0385104    -2.54   0.011    -.1733278   -.0223444
     higheduc |   .0195099   .0274094     0.71   0.477    -.0342204    .0732403
       female |   .0716585   .0256074     2.80   0.005     .0214605    .1218566
retirement~ge |  -.1404163   .0326102    -4.31   0.000    -.2043418   -.0764908
high_confir~d |  -.0084036   .0288247    -0.29   0.771    -.0649086    .0481013
        child |   .1294176   .0319526     4.05   0.000     .0667812     .192054
        alone |   .0192432   .0340386     0.57   0.572    -.0474824    .0859689
        urban |   .0774201   .0306029     2.53   0.011     .0174295    .1374107
    northeast |   .1282786   .0428431     2.99   0.003     .0442937    .2122635
      midwest |  -.0404295   .0386377    -1.05   0.295    -.1161707    .0353117
        south |   .0481797   .0351476     1.37   0.170    -.0207199    .1170793
        _cons |   .0795646   .0496635     1.60   0.109    -.0177904    .1769197
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -.12685   .0394776    -3.21   0.001    -.2042376   -.0494625
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.12685001

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03947756

. est store col2

. 
. reg zluck_unfair_agree corona_prime higheducXcorona_prime republican highinc h
> igheduc female retirement_age high_confirmed child alone urban northeast midwe
> st south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0507
                                                Root MSE          =     .98418

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0456954   .0343539    -1.33   0.184     -.113039    .0216482
higheducXco~e |  -.0806616   .0511997    -1.58   0.115     -.181028    .0197048
   republican |  -.3397735    .026972   -12.60   0.000    -.3926465   -.2869005
      highinc |  -.1404856   .0282137    -4.98   0.000    -.1957928   -.0851785
     higheduc |   .0599153    .037941     1.58   0.114    -.0144601    .1342908
       female |   .0719198   .0256117     2.81   0.005     .0217134    .1221261
retirement~ge |  -.1416563   .0325857    -4.35   0.000    -.2055337   -.0777788
high_confir~d |  -.0084981   .0288285    -0.29   0.768    -.0650105    .0480143
        child |   .1293574   .0319657     4.05   0.000     .0666952    .1920196
        alone |   .0189715   .0340172     0.56   0.577    -.0477122    .0856552
        urban |   .0765322   .0306197     2.50   0.012     .0165085    .1365559
    northeast |   .1297797   .0428479     3.03   0.002     .0457853     .213774
      midwest |  -.0413258   .0386369    -1.07   0.285    -.1170653    .0344138
        south |   .0472508   .0351447     1.34   0.179    -.0216431    .1161448
        _cons |   .0837674    .049249     1.70   0.089    -.0127751    .1803098
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.126357   .0379776    -3.33   0.001    -.2008042   -.0519098
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.12635703

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0379776

. est store col3

. 
. reg zluck_unfair_agree corona_prime femaleXcorona_prime republican highinc hig
> heduc female retirement_age high_confirmed child alone urban northeast midwest
>  south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.13
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0504
                                                Root MSE          =     .98435

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0667912   .0382255    -1.75   0.081    -.1417242    .0081419
femaleXcoro~e |  -.0327869   .0511353    -0.64   0.521    -.1330271    .0674532
   republican |  -.3388234   .0269631   -12.57   0.000     -.391679   -.2859677
      highinc |  -.1403403   .0282057    -4.98   0.000    -.1956317    -.085049
     higheduc |   .0201795   .0274188     0.74   0.462    -.0335695    .0739285
       female |   .0879205    .036535     2.41   0.016     .0163012    .1595398
retirement~ge |  -.1418452   .0326155    -4.35   0.000    -.2057812   -.0779092
high_confir~d |  -.0075038   .0288286    -0.26   0.795    -.0640162    .0490087
        child |   .1293645   .0319749     4.05   0.000     .0666843    .1920447
        alone |   .0184255   .0340431     0.54   0.588    -.0483088    .0851599
        urban |   .0768701   .0306433     2.51   0.012     .0168002      .13694
    northeast |   .1277699   .0428706     2.98   0.003     .0437309    .2118088
      midwest |  -.0425669   .0386488    -1.10   0.271    -.1183298     .033196
        south |    .046163   .0351655     1.31   0.189    -.0227716    .1150976
        _cons |   .0941497    .050256     1.87   0.061    -.0043667    .1926661
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0995781   .0339632    -2.93   0.003    -.1661559   -.0330003
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.09957809

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03396318

. est store col4

. 
. reg zluck_unfair_agree corona_prime retirement_ageXcorona_prime republican hig
> hinc higheduc female retirement_age high_confirmed child alone urban northeast
>  midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.47
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0503
                                                Root MSE          =     .98436

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0775654   .0286115    -2.71   0.007    -.1336523   -.0214785
retirement~me |  -.0339092   .0624035    -0.54   0.587    -.1562384      .08842
   republican |  -.3389316   .0269568   -12.57   0.000    -.3917748   -.2860884
      highinc |  -.1398736   .0282208    -4.96   0.000    -.1951946   -.0845527
     higheduc |    .019909   .0274247     0.73   0.468    -.0338515    .0736695
       female |   .0716697   .0256284     2.80   0.005     .0214305     .121909
retirement~ge |  -.1250191   .0471751    -2.65   0.008    -.2174962    -.032542
high_confir~d |  -.0075659   .0288426    -0.26   0.793    -.0641058    .0489741
        child |   .1286783   .0319763     4.02   0.000     .0659954    .1913612
        alone |   .0183503    .034038     0.54   0.590    -.0483741    .0850747
        urban |   .0771754   .0306285     2.52   0.012     .0171346    .1372162
    northeast |   .1283825   .0428554     3.00   0.003     .0443735    .2123916
      midwest |  -.0417523   .0386762    -1.08   0.280     -.117569    .0340644
        south |   .0465811   .0351746     1.32   0.185    -.0223714    .1155336
        _cons |   .0989039   .0488109     2.03   0.043     .0032202    .1945876
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1114746   .0554417    -2.01   0.044    -.2201565   -.0027927
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.11147461

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .05544166

. est store col5

. 
. reg zluck_unfair_agree corona_prime high_confirmedXcorona_prime republican hig
> hinc higheduc female retirement_age high_confirmed child alone urban northeast
>  midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0503
                                                Root MSE          =     .98438

-------------------------------------------------------------------------------
              |               Robust
zluck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0911927   .0367354    -2.48   0.013    -.1632048   -.0191805
high_confir~e |    .015075   .0510153     0.30   0.768    -.0849299    .1150799
   republican |   -.338635    .026972   -12.56   0.000     -.391508   -.2857621
      highinc |  -.1400881   .0281954    -4.97   0.000    -.1953592    -.084817
     higheduc |   .0200641   .0274228     0.73   0.464    -.0336927    .0738209
       female |   .0717655   .0256182     2.80   0.005     .0215463    .1219846
retirement~ge |  -.1419169   .0326068    -4.35   0.000    -.2058357    -.077998
high_confir~d |  -.0153534   .0390481    -0.39   0.694    -.0918992    .0611924
        child |   .1290118     .03198     4.03   0.000     .0663216     .191702
        alone |   .0185605   .0340298     0.55   0.585    -.0481478    .0852689
        urban |   .0771544   .0306279     2.52   0.012     .0171148     .137194
    northeast |   .1286276   .0428561     3.00   0.003      .044617    .2126382
      midwest |  -.0421048   .0386555    -1.09   0.276    -.1178808    .0336713
        south |   .0464623   .0351714     1.32   0.187     -.022484    .1154086
        _cons |   .1056624   .0499304     2.12   0.034     .0077842    .2035407
-------------------------------------------------------------------------------

. lincom corona_prime + high_confirmedXcorona_prime

 ( 1)  corona_prime + high_confirmedXcorona_prime = 0

------------------------------------------------------------------------------
zluck_unfa~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0761177   .0354148    -2.15   0.032     -.145541   -.0066944
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.07611766

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03541477

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/het_zunfairluck.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime high_confirmedXcorona_p
> rime _cons) ///
> label mtitle("Luck unfair (std.)" "Luck unfair (std.)" "Luck unfair (std.)" "L
> uck unfair (std.)" "Luck unfair (std.)" "Luck unfair (std.)") ///
> b(3)
(output written to tables/het_zunfairluck.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, REDISTRIBUTION/MORAL VIEWS, Table S6
. *************************************************************************
. reg zgov_reduce_inequality_agree zprior_soc_over_self [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =     121.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0179
                                                Root MSE          =     .99107

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .1337869   .0121368    11.02   0.000     .1099956    .1575783
        _cons |   5.55e-09   .0119379     0.00   1.000    -.0234014    .0234014
-------------------------------------------------------------------------------

. est store col1

. reg zgov_reduce_inequality_agree zprior_soc_over_self i.State_Recoded [pw=Weig
> htvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =       5.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0338
                                                Root MSE          =     .98607

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .1311272   .0121196    10.82   0.000     .1073697    .1548847
              |
State_Recoded |
      Alaska  |   .4437903   .2903399     1.53   0.126    -.1253508    1.012931
     Arizona  |   .1677247   .1309911     1.28   0.200    -.0890518    .4245011
    Arkansas  |   .1719487   .1733242     0.99   0.321    -.1678114    .5117088
  California  |   .3768943   .1068334     3.53   0.000     .1674732    .5863154
    Colorado  |   .0533637    .137175     0.39   0.697    -.2155347     .322262
 Connecticut  |   .2730529   .1402617     1.95   0.052    -.0018963     .548002
    Delaware  |   -.087822   .2486249    -0.35   0.724    -.5751911    .3995471
District o..  |   .6521436   .2102618     3.10   0.002     .2399762    1.064311
     Florida  |   .2173711   .1113286     1.95   0.051    -.0008617     .435604
     Georgia  |   .0750032   .1293681     0.58   0.562    -.1785916     .328598
      Hawaii  |   .5477344   .1705383     3.21   0.001     .2134354    .8820334
       Idaho  |   .0578268   .1900083     0.30   0.761    -.3146385    .4302921
    Illinois  |   .2865692   .1148221     2.50   0.013     .0614883    .5116501
     Indiana  |    .048403   .1384944     0.35   0.727    -.2230817    .3198877
        Iowa  |   .1654048   .1534867     1.08   0.281    -.1354687    .4662783
      Kansas  |  -.0330471   .1750014    -0.19   0.850    -.3760951    .3100009
    Kentucky  |   .1219569   .1454101     0.84   0.402    -.1630844    .4069983
   Louisiana  |    .182655    .153003     1.19   0.233    -.1172704    .4825804
       Maine  |   .6215327   .1519312     4.09   0.000     .3237083    .9193571
    Maryland  |   .3321583   .1336509     2.49   0.013      .070168    .5941487
Massachuse~s  |   .2806646   .1309687     2.14   0.032     .0239322     .537397
    Michigan  |   .2274245   .1214391     1.87   0.061    -.0106274    .4654765
   Minnesota  |   .2457926   .1353728     1.82   0.069     -.019573    .5111582
 Mississippi  |   .1258301   .1822942     0.69   0.490    -.2315137    .4831739
    Missouri  |   .1263071   .1337861     0.94   0.345    -.1359482    .3885623
     Montana  |  -.3099982   .2197355    -1.41   0.158    -.7407366    .1207401
    Nebraska  |   .1308703     .18732     0.70   0.485    -.2363253    .4980659
      Nevada  |   .3207645   .1461674     2.19   0.028     .0342385    .6072904
New Hampsh..  |    .210634   .1737391     1.21   0.225    -.1299394    .5512075
  New Jersey  |   .2468976   .1209964     2.04   0.041     .0097135    .4840816
  New Mexico  |   .2769157    .169307     1.64   0.102    -.0549698    .6088012
    New York  |   .4735267   .1083905     4.37   0.000     .2610533    .6860002
North Dakota  |   .0116781   .3265237     0.04   0.971    -.6283926    .6517489
North Caro..  |    .272039    .121504     2.24   0.025     .0338597    .5102182
        Ohio  |   .1487571   .1189501     1.25   0.211    -.0844157      .38193
    Oklahoma  |   .0643464   .1494475     0.43   0.667    -.2286092     .357302
      Oregon  |   .2744396    .144317     1.90   0.057     -.008459    .5573382
Pennsylvania  |   .2541886   .1121622     2.27   0.023     .0343217    .4740555
Rhode Island  |   .4063448   .2171145     1.87   0.061    -.0192556    .8319453
South Dakota  |   .1307171    .278083     0.47   0.638    -.4143974    .6758317
South Caro..  |   .1056011   .1433937     0.74   0.461    -.1754875    .3866897
   Tennessee  |   .1988428    .133439     1.49   0.136    -.0627321    .4604176
       Texas  |   .2070324   .1112626     1.86   0.063    -.0110709    .4251357
        Utah  |  -.0072689   .1695974    -0.04   0.966    -.3397236    .3251858
     Vermont  |   .1304815   .2899054     0.45   0.653    -.4378079    .6987709
    Virginia  |   .3565285   .1232695     2.89   0.004     .1148884    .5981685
  Washington  |   .2624472   .1255051     2.09   0.037     .0164249    .5084696
West Virgi..  |   .3728563   .1583202     2.36   0.019     .0625079    .6832047
   Wisconsin  |   .1591434   .1270955     1.25   0.211    -.0899966    .4082835
     Wyoming  |   .2016531   .2648168     0.76   0.446    -.3174563    .7207624
              |
        _cons |  -.2420297   .1009542    -2.40   0.017    -.4399261   -.0441333
-------------------------------------------------------------------------------

. est store col2

. reg zgov_reduce_inequality_agree zprior_soc_over_self republican highinc highe
> duc female retirement_age high_confirmed child alone urban i.State_Recoded [pw
> =Weightvar], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      33.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2446
                                                Root MSE          =     .88603

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0749984   .0121095     6.19   0.000     .0512602    .0987366
   republican |  -.9112062   .0253736   -35.91   0.000    -.9609459   -.8614666
      highinc |  -.1093449   .0254171    -4.30   0.000      -.15917   -.0595199
     higheduc |  -.0471694   .0248488    -1.90   0.058    -.0958804    .0015416
       female |  -.0114977   .0227858    -0.50   0.614    -.0561646    .0331692
retirement~ge |  -.2052468    .030549    -6.72   0.000    -.2651318   -.1453618
high_confir~d |   .1236482   .1117592     1.11   0.269    -.0954327    .3427291
        child |   .1145507   .0285316     4.01   0.000     .0586203     .170481
        alone |   .0052695   .0290686     0.18   0.856    -.0517136    .0622526
        urban |   .0600739   .0277455     2.17   0.030     .0056845    .1144632
              |
State_Recoded |
      Alaska  |   .2421457   .3150846     0.77   0.442     -.375513    .8598043
     Arizona  |   .0835747   .1175821     0.71   0.477    -.1469209    .3140703
    Arkansas  |   .0895997    .150182     0.60   0.551    -.2048013    .3840006
  California  |   .1919173   .0956157     2.01   0.045     .0044825    .3793522
    Colorado  |  -.1527279    .112947    -1.35   0.176    -.3741374    .0686816
 Connecticut  |    .014868   .1204342     0.12   0.902    -.2212185    .2509545
    Delaware  |  -.3271793   .2246802    -1.46   0.145    -.7676187    .1132601
District o..  |   .1834468   .1937635     0.95   0.344    -.1963867    .5632802
     Florida  |  -.0151403   .0817976    -0.19   0.853    -.1754877    .1452072
     Georgia  |  -.1554791   .1008051    -1.54   0.123    -.3530868    .0421286
      Hawaii  |   .4910416   .1987523     2.47   0.014     .1014285    .8806546
       Idaho  |   .0850454   .1849178     0.46   0.646     -.277448    .4475388
    Illinois  |   .0231075   .0841943     0.27   0.784    -.1419381    .1881531
     Indiana  |  -.1175722    .107325    -1.10   0.273    -.3279608    .0928164
        Iowa  |  -.0265743   .1365087    -0.19   0.846    -.2941716     .241023
      Kansas  |   .0159388   .1798613     0.09   0.929    -.3366423    .3685199
    Kentucky  |  -.0381585   .1270109    -0.30   0.764    -.2871374    .2108203
   Louisiana  |   .0428067   .1495272     0.29   0.775    -.2503107    .3359241
       Maine  |   .5799185   .1375561     4.22   0.000      .310268     .849569
    Maryland  |   -.030667   .1061373    -0.29   0.773    -.2387275    .1773934
Massachuse~s  |  -.0509713   .1101998    -0.46   0.644    -.2669953    .1650527
    Michigan  |  -.0795076   .0907473    -0.88   0.381    -.2573989    .0983837
   Minnesota  |   .2294149   .1313539     1.75   0.081    -.0280774    .4869071
 Mississippi  |   .0320086   .1520006     0.21   0.833    -.2659573    .3299746
    Missouri  |   .1249216   .1145025     1.09   0.275    -.0995371    .3493803
     Montana  |  -.3897331   .1804435    -2.16   0.031    -.7434555   -.0360107
    Nebraska  |   .1876391   .1829582     1.03   0.305    -.1710128     .546291
      Nevada  |   .0264917   .1348871     0.20   0.844    -.2379267    .2909101
New Hampsh..  |   .0763393   .1538066     0.50   0.620    -.2251668    .3778455
  New Jersey  |  -.0006249   .0957817    -0.01   0.995    -.1883852    .1871355
  New Mexico  |   .2444818   .1495176     1.64   0.102    -.0486167    .5375803
    New York  |   .1864379   .0799011     2.33   0.020     .0298082    .3430677
North Dakota  |   .0761422   .3620625     0.21   0.833    -.6336068    .7858912
North Caro..  |   .1354123   .1086527     1.25   0.213     -.077579    .3484036
        Ohio  |   .0640402   .1068738     0.60   0.549    -.1454641    .2735444
    Oklahoma  |   .0919939    .139776     0.66   0.510    -.1820082     .365996
      Oregon  |   .0841431   .1274441     0.66   0.509    -.1656849     .333971
Pennsylvania  |    .049626   .0827048     0.60   0.548    -.1124997    .2117517
Rhode Island  |   .0813671   .1805482     0.45   0.652    -.2725605    .4352946
South Dakota  |   .1178493   .2533111     0.47   0.642     -.378715    .6144137
South Caro..  |    .127267   .1250239     1.02   0.309    -.1178166    .3723506
   Tennessee  |  -.0421327   .1081523    -0.39   0.697    -.2541432    .1698777
       Texas  |   .0749396   .0978244     0.77   0.444     -.116825    .2667042
        Utah  |  -.1981935   .1539813    -1.29   0.198    -.5000422    .1036551
     Vermont  |  -.1915022   .2586116    -0.74   0.459    -.6984571    .3154527
    Virginia  |   .2136596   .1082757     1.97   0.049     .0014073    .4259119
  Washington  |  -.0479503   .1017432    -0.47   0.637    -.2473969    .1514963
West Virgi..  |   .2159873   .1522452     1.42   0.156    -.0824581    .5144327
   Wisconsin  |          0  (omitted)
     Wyoming  |  -.0136114   .2187241    -0.06   0.950     -.442375    .4151522
              |
        _cons |   .2623943    .092337     2.84   0.004     .0813865     .443402
-------------------------------------------------------------------------------

. est store col3

. 
. reg zgov_reduce_inequality_agree zprior_national_over_global [pw=Weightvar], r
> obust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =     271.73
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0392
                                                Root MSE          =     .98026

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |   -.198014   .0120124   -16.48   0.000    -.2215614   -.1744665
        _cons |   4.49e-09   .0118142     0.00   1.000    -.0231589    .0231589
-------------------------------------------------------------------------------

. est store col4

. reg zgov_reduce_inequality_agree zprior_national_over_global i.State_Recoded [
> pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =       7.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0532
                                                Root MSE          =     .97613

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |   -.191874   .0120062   -15.98   0.000    -.2154092   -.1683388
              |
State_Recoded |
      Alaska  |   .2962889   .2778344     1.07   0.286    -.2483382     .840916
     Arizona  |   .1666575   .1262071     1.32   0.187     -.080741     .414056
    Arkansas  |   .1983208    .170855     1.16   0.246    -.1365992    .5332407
  California  |   .3494253   .1035488     3.37   0.001     .1464429    .5524076
    Colorado  |   .0494452   .1341907     0.37   0.713    -.2136034    .3124937
 Connecticut  |   .2511118   .1362463     1.84   0.065    -.0159662    .5181897
    Delaware  |  -.1134218   .2507689    -0.45   0.651    -.6049936      .37815
District o..  |    .543836    .220483     2.47   0.014     .1116324    .9760396
     Florida  |   .2064313    .108154     1.91   0.056    -.0055785     .418441
     Georgia  |   .0540661    .126309     0.43   0.669    -.1935322    .3016643
      Hawaii  |   .5327176    .162136     3.29   0.001     .2148892    .8505461
       Idaho  |   .0223114   .1874295     0.12   0.905    -.3450988    .3897215
    Illinois  |   .2861313   .1112877     2.57   0.010     .0679786    .5042839
     Indiana  |   .0818612    .134972     0.61   0.544    -.1827187    .3464412
        Iowa  |    .151415   .1506837     1.00   0.315     -.143964     .446794
      Kansas  |  -.0410392   .1668701    -0.25   0.806    -.3681477    .2860694
    Kentucky  |   .1494574   .1448965     1.03   0.302    -.1345771     .433492
   Louisiana  |   .1995251   .1539037     1.30   0.195     -.102166    .5012162
       Maine  |   .6275177   .1498963     4.19   0.000     .3336822    .9213531
    Maryland  |   .3072947   .1298808     2.37   0.018     .0526948    .5618946
Massachuse~s  |   .2699225   .1274058     2.12   0.034     .0201742    .5196707
    Michigan  |   .2197951    .118374     1.86   0.063    -.0122486    .4518388
   Minnesota  |   .2590998   .1330502     1.95   0.052    -.0017129    .5199125
 Mississippi  |   .0937683     .17178     0.55   0.585    -.2429649    .4305015
    Missouri  |   .1303015   .1296823     1.00   0.315    -.1239092    .3845123
     Montana  |  -.2155054   .2164186    -1.00   0.319    -.6397416    .2087309
    Nebraska  |   .1421335   .1815771     0.78   0.434    -.2138046    .4980716
      Nevada  |   .3417478   .1408279     2.43   0.015     .0656887    .6178068
New Hampsh..  |   .2046262   .1721028     1.19   0.234    -.1327398    .5419921
  New Jersey  |   .2290896   .1180853     1.94   0.052    -.0023879    .4605672
  New Mexico  |   .2459107     .16642     1.48   0.140    -.0803155    .5721369
    New York  |   .4483241   .1052988     4.26   0.000     .2419112    .6547369
North Dakota  |   .0212664   .3282998     0.06   0.948     -.622286    .6648188
North Caro..  |   .2636859   .1180008     2.23   0.025     .0323739     .494998
        Ohio  |   .1605687   .1159194     1.39   0.166    -.0666633    .3878007
    Oklahoma  |   .0631198   .1457691     0.43   0.665    -.2226253    .3488649
      Oregon  |   .2851224   .1390645     2.05   0.040     .0125201    .5577246
Pennsylvania  |   .2575619   .1092471     2.36   0.018     .0434093    .4717144
Rhode Island  |   .4189711   .2127997     1.97   0.049     .0018287    .8361135
South Dakota  |   .1496922   .2826906     0.53   0.596    -.4044543    .7038387
South Caro..  |   .0940434   .1394569     0.67   0.500    -.1793282     .367415
   Tennessee  |   .2110146   .1312367     1.61   0.108    -.0462432    .4682724
       Texas  |   .1848012   .1079149     1.71   0.087    -.0267399    .3963423
        Utah  |  -.0187922   .1636958    -0.11   0.909    -.3396783    .3020938
     Vermont  |   .1467678   .2741867     0.54   0.592    -.3907089    .6842445
    Virginia  |   .3519468   .1197562     2.94   0.003     .1171936    .5866999
  Washington  |   .2624582   .1217009     2.16   0.031      .023893    .5010235
West Virgi..  |   .4006544   .1560935     2.57   0.010     .0946708     .706638
   Wisconsin  |   .1571761   .1232789     1.27   0.202    -.0844824    .3988347
     Wyoming  |   .1938454   .2406058     0.81   0.420     -.277804    .6654948
              |
        _cons |  -.2337208   .0974756    -2.40   0.017    -.4247982   -.0426434
-------------------------------------------------------------------------------

. est store col5

. reg zgov_reduce_inequality_agree zprior_national_over_global republican highin
> c higheduc female retirement_age high_confirmed child alone urban i.State_Reco
> ded [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      33.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2456
                                                Root MSE          =     .88546

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0846713   .0124515    -6.80   0.000    -.1090798   -.0602628
   republican |  -.8869444   .0260299   -34.07   0.000    -.9379707   -.8359181
      highinc |   -.105744   .0253678    -4.17   0.000    -.1554723   -.0560157
     higheduc |  -.0480036    .024781    -1.94   0.053    -.0965817    .0005745
       female |   .0004348   .0227559     0.02   0.985    -.0441734     .045043
retirement~ge |  -.1964119    .030646    -6.41   0.000    -.2564871   -.1363367
high_confir~d |   .1292932   .1106202     1.17   0.243    -.0875551    .3461414
        child |   .1076292   .0286237     3.76   0.000     .0515183    .1637402
        alone |   .0005687   .0290286     0.02   0.984    -.0563359    .0574734
        urban |   .0598053   .0278763     2.15   0.032     .0051595    .1144512
              |
State_Recoded |
      Alaska  |   .1781185    .301404     0.59   0.555    -.4127221    .7689592
     Arizona  |   .0835832   .1165004     0.72   0.473     -.144792    .3119584
    Arkansas  |   .1097566   .1501228     0.73   0.465    -.1845284    .4040415
  California  |   .1911045   .0947167     2.02   0.044      .005432    .3767771
    Colorado  |  -.1553384   .1128238    -1.38   0.169    -.3765063    .0658294
 Connecticut  |   .0071229   .1195535     0.06   0.952    -.2272371    .2414829
    Delaware  |  -.3382111   .2286182    -1.48   0.139      -.78637    .1099479
District o..  |   .1364561   .2007756     0.68   0.497    -.2571231    .5300354
     Florida  |  -.0207966   .0811959    -0.26   0.798    -.1799645    .1383713
     Georgia  |  -.1654881   .0996572    -1.66   0.097    -.3608455    .0298693
      Hawaii  |   .4884046   .1945706     2.51   0.012     .1069889    .8698203
       Idaho  |   .0675621   .1853847     0.36   0.716    -.2958466    .4309707
    Illinois  |   .0276732   .0833836     0.33   0.740    -.1357833    .1911296
     Indiana  |   -.103768   .1059487    -0.98   0.327    -.3114586    .1039227
        Iowa  |  -.0226859   .1361656    -0.17   0.868    -.2896106    .2442389
      Kansas  |   .0151116    .176034     0.09   0.932    -.3299668      .36019
    Kentucky  |  -.0141446   .1275782    -0.11   0.912    -.2642354    .2359462
   Louisiana  |   .0429798   .1522261     0.28   0.778    -.2554282    .3413879
       Maine  |   .5881238   .1369518     4.29   0.000     .3196579    .8565897
    Maryland  |   -.033095   .1053586    -0.31   0.753    -.2396288    .1734389
Massachuse~s  |  -.0549855   .1097234    -0.50   0.616    -.2700757    .1601046
    Michigan  |  -.0820326   .0904624    -0.91   0.365    -.2593656    .0953005
   Minnesota  |   .2420409   .1308235     1.85   0.064    -.0144117    .4984935
 Mississippi  |   .0026766   .1499073     0.02   0.986    -.2911858    .2965391
    Missouri  |   .1290661   .1135948     1.14   0.256    -.0936132    .3517453
     Montana  |  -.3483373   .1815415    -1.92   0.055    -.7042121    .0075374
    Nebraska  |   .1950561   .1808292     1.08   0.281    -.1594223    .5495345
      Nevada  |   .0299457   .1323194     0.23   0.821    -.2294392    .2893307
New Hampsh..  |   .0812451   .1535374     0.53   0.597    -.2197335    .3822237
  New Jersey  |  -.0085488   .0953099    -0.09   0.929    -.1953843    .1782866
  New Mexico  |   .2359788   .1496316     1.58   0.115    -.0573432    .5293009
    New York  |   .1801126   .0795581     2.26   0.024     .0241552      .33607
North Dakota  |   .0805647   .3614784     0.22   0.824    -.6280394    .7891688
North Caro..  |   .1399844   .1077214     1.30   0.194    -.0711812    .3511501
        Ohio  |   .0744683   .1061877     0.70   0.483    -.1336908    .2826274
    Oklahoma  |   .1047611   .1396993     0.75   0.453    -.1690907    .3786128
      Oregon  |   .0992738   .1259168     0.79   0.430    -.1475602    .3461078
Pennsylvania  |    .050976   .0824517     0.62   0.536    -.1106537    .2126056
Rhode Island  |   .0895874   .1796432     0.50   0.618    -.2625662    .4417411
South Dakota  |   .1286034   .2561521     0.50   0.616    -.3735301     .630737
South Caro..  |   .1205616   .1236785     0.97   0.330    -.1218847    .3630079
   Tennessee  |  -.0407754   .1088196    -0.37   0.708    -.2540938    .1725431
       Texas  |   .0735979   .0970083     0.76   0.448    -.1165669    .2637626
        Utah  |  -.2101725   .1527962    -1.38   0.169     -.509698    .0893529
     Vermont  |  -.1720929   .2502508    -0.69   0.492    -.6626581    .3184723
    Virginia  |   .2183609   .1073811     2.03   0.042     .0078623    .4288594
  Washington  |  -.0481711   .1003091    -0.48   0.631    -.2448064    .1484642
West Virgi..  |      .2354   .1506059     1.56   0.118    -.0598318    .5306319
   Wisconsin  |          0  (omitted)
     Wyoming  |  -.0091476   .2120008    -0.04   0.966    -.4247316    .4064364
              |
        _cons |   .2445909   .0915552     2.67   0.008     .0651157    .4240661
-------------------------------------------------------------------------------

. est store col6

. 
. reg zgov_reduce_inequality_agree zluck_unfair_agree [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =     712.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1031
                                                Root MSE          =     .94713

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .3210149   .0120285    26.69   0.000     .2974361    .3445938
        _cons |   3.00e-09   .0114027     0.00   1.000    -.0223522    .0223522
-------------------------------------------------------------------------------

. est store col7

. reg zgov_reduce_inequality_agree zluck_unfair_agree i.State_Recoded [pw=Weight
> var], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =      16.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1159
                                                Root MSE          =     .94323

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .3168739   .0120112    26.38   0.000     .2933288     .340419
              |
State_Recoded |
      Alaska  |   .4273587   .2860475     1.49   0.135    -.1333682    .9880856
     Arizona  |   .1306334   .1283252     1.02   0.309    -.1209172     .382184
    Arkansas  |   .2189639   .1634035     1.34   0.180    -.1013491     .539277
  California  |   .3559026   .1067702     3.33   0.001     .1466055    .5651998
    Colorado  |   .0056755   .1390023     0.04   0.967    -.2668049    .2781558
 Connecticut  |   .1720143   .1425527     1.21   0.228    -.1074259    .4514545
    Delaware  |  -.0752188   .2381376    -0.32   0.752    -.5420299    .3915923
District o..  |    .534388   .2046243     2.61   0.009     .1332714    .9355045
     Florida  |   .1743587    .110664     1.58   0.115    -.0425714    .3912887
     Georgia  |   .0481914    .126549     0.38   0.703    -.1998773    .2962601
      Hawaii  |   .4518892    .174625     2.59   0.010     .1095791    .7941993
       Idaho  |   .0741201   .1899934     0.39   0.696     -.298316    .4465563
    Illinois  |   .2723999   .1140023     2.39   0.017     .0489259    .4958739
     Indiana  |   .1086451   .1341443     0.81   0.418    -.1543124    .3716025
        Iowa  |   .2006497   .1461515     1.37   0.170    -.0858449    .4871443
      Kansas  |  -.0854626   .1599942    -0.53   0.593    -.3990927    .2281674
    Kentucky  |   .1184739   .1467208     0.81   0.419    -.1691368    .4060846
   Louisiana  |   .1936514   .1556455     1.24   0.213    -.1114541    .4987568
       Maine  |   .5417539   .1543491     3.51   0.000     .2391899    .8443179
    Maryland  |    .263141   .1313912     2.00   0.045     .0055804    .5207016
Massachuse~s  |   .2045924   .1333074     1.53   0.125    -.0567244    .4659093
    Michigan  |     .20766   .1220374     1.70   0.089    -.0315648    .4468848
   Minnesota  |   .2829304   .1330023     2.13   0.033     .0222116    .5436492
 Mississippi  |   .0357981   .1748602     0.20   0.838    -.3069731    .3785692
    Missouri  |   .0996109   .1305269     0.76   0.445    -.1562554    .3554773
     Montana  |  -.1954778   .2171815    -0.90   0.368    -.6212095     .230254
    Nebraska  |    .169828   .1751461     0.97   0.332    -.1735036    .5131595
      Nevada  |   .3641205   .1475314     2.47   0.014     .0749209    .6533201
New Hampsh..  |   .1864521   .1807912     1.03   0.302    -.1679454    .5408496
  New Jersey  |   .2057498   .1181953     1.74   0.082    -.0259435    .4374431
  New Mexico  |   .2583958   .1777079     1.45   0.146    -.0899576    .6067491
    New York  |   .3982525   .1091419     3.65   0.000     .1843062    .6121989
North Dakota  |  -.0175333   .3310375    -0.05   0.958    -.6664523    .6313857
North Caro..  |   .2764259   .1199758     2.30   0.021     .0412424    .5116094
        Ohio  |   .1564649   .1184801     1.32   0.187    -.0757867    .3887165
    Oklahoma  |     .09334   .1447272     0.64   0.519    -.1903627    .3770427
      Oregon  |   .2220613   .1456683     1.52   0.127    -.0634863    .5076088
Pennsylvania  |    .226114   .1121176     2.02   0.044     .0063346    .4458934
Rhode Island  |   .2909709   .1966701     1.48   0.139    -.0945533    .6764951
South Dakota  |   .1575961   .2483498     0.63   0.526    -.3292336    .6444258
South Caro..  |   .0752831   .1381863     0.54   0.586    -.1955978    .3461641
   Tennessee  |    .161659   .1312485     1.23   0.218     -.095622    .4189401
       Texas  |   .1667529   .1113503     1.50   0.134    -.0515225    .3850283
        Utah  |  -.0429399   .1552861    -0.28   0.782    -.3473407    .2614608
     Vermont  |   .2200466   .2571185     0.86   0.392    -.2839719    .7240652
    Virginia  |    .308532   .1222845     2.52   0.012     .0688228    .5482412
  Washington  |   .2948318   .1214597     2.43   0.015     .0567395    .5329241
West Virgi..  |   .2561031   .1513486     1.69   0.091    -.0405792    .5527855
   Wisconsin  |   .1954715     .12488     1.57   0.118    -.0493255    .4402686
     Wyoming  |   .2236356   .2670126     0.84   0.402    -.2997781    .7470492
              |
        _cons |   -.217491   .1016138    -2.14   0.032    -.4166802   -.0183018
-------------------------------------------------------------------------------

. est store col8

. reg zgov_reduce_inequality_agree zluck_unfair_agree republican highinc highedu
> c female retirement_age high_confirmed child alone urban i.State_Recoded [pw=W
> eightvar], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      48.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2953
                                                Root MSE          =     .85578

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .2447442    .011843    20.67   0.000     .2215285    .2679599
   republican |  -.8524391   .0249107   -34.22   0.000    -.9012714   -.8036067
      highinc |  -.0742878   .0247677    -3.00   0.003    -.1228399   -.0257357
     higheduc |  -.0456196    .024059    -1.90   0.058    -.0927825    .0015432
       female |  -.0215564    .021988    -0.98   0.327    -.0646593    .0215465
retirement~ge |  -.1794789   .0298906    -6.00   0.000    -.2380733   -.1208845
high_confir~d |   .1614373   .1112101     1.45   0.147    -.0565672    .3794419
        child |    .076586   .0276536     2.77   0.006     .0223769    .1307952
        alone |    .000252   .0279611     0.01   0.993      -.05456     .055064
        urban |   .0455473   .0265535     1.72   0.086    -.0065053    .0975999
              |
State_Recoded |
      Alaska  |   .2463424   .3075927     0.80   0.423    -.3566299    .8493148
     Arizona  |   .0730641   .1165399     0.63   0.531    -.1553883    .3015166
    Arkansas  |   .1468899   .1440812     1.02   0.308    -.1355516    .4293314
  California  |   .1835499    .095329     1.93   0.054    -.0033231    .3704228
    Colorado  |  -.2054528   .1137064    -1.81   0.071    -.4283508    .0174453
 Connecticut  |  -.0976856   .1234335    -0.79   0.429    -.3396516    .1442804
    Delaware  |  -.3344226   .2222545    -1.50   0.132    -.7701068    .1012617
District o..  |   .0297009   .1887888     0.16   0.875    -.3403807    .3997824
     Florida  |   -.077562   .0794143    -0.98   0.329    -.2332375    .0781135
     Georgia  |  -.2068891   .0969333    -2.13   0.033     -.396907   -.0168712
      Hawaii  |   .4215643   .1999171     2.11   0.035     .0296679    .8134607
       Idaho  |   .0847306   .1837779     0.46   0.645    -.2755281    .4449894
    Illinois  |  -.0174265   .0822695    -0.21   0.832     -.178699    .1438459
     Indiana  |  -.1051346   .1014976    -1.04   0.300    -.3040999    .0938306
        Iowa  |  -.0021713   .1297073    -0.02   0.987    -.2564358    .2520931
      Kansas  |  -.0273573   .1676413    -0.16   0.870    -.3559836     .301269
    Kentucky  |  -.0372675   .1270451    -0.29   0.769    -.2863133    .2117784
   Louisiana  |   .0120678    .151579     0.08   0.937    -.2850716    .3092073
       Maine  |   .5127123   .1384845     3.70   0.000     .2412419    .7841828
    Maryland  |  -.1230772   .1038227    -1.19   0.236    -.3266003    .0804459
Massachuse~s  |   -.131625   .1096999    -1.20   0.230     -.346669    .0834191
    Michigan  |  -.1291803   .0898344    -1.44   0.150    -.3052823    .0469217
   Minnesota  |   .2532206   .1272627     1.99   0.047     .0037483    .5026929
 Mississippi  |  -.0698054    .146517    -0.48   0.634    -.3570218     .217411
    Missouri  |   .1141443    .112372     1.02   0.310    -.1061378    .3344264
     Montana  |  -.3083524    .179015    -1.72   0.085    -.6592746    .0425697
    Nebraska  |   .1892164   .1794051     1.05   0.292    -.1624704    .5409031
      Nevada  |   .0277683   .1324308     0.21   0.834    -.2318349    .2873716
New Hampsh..  |   .0611444   .1610729     0.38   0.704     -.254606    .3768948
  New Jersey  |  -.0578443    .091069    -0.64   0.525    -.2363665    .1206778
  New Mexico  |   .2726376   .1566179     1.74   0.082    -.0343795    .5796547
    New York  |   .1009604    .078604     1.28   0.199    -.0531266    .2550473
North Dakota  |   .0231794   .3685806     0.06   0.950    -.6993472     .745706
North Caro..  |   .1437674   .1070251     1.34   0.179    -.0660333     .353568
        Ohio  |    .076393   .1060071     0.72   0.471    -.1314122    .2841982
    Oklahoma  |   .1142751   .1363116     0.84   0.402    -.1529358    .3814859
      Oregon  |   .0579736   .1293259     0.45   0.654    -.1955432    .3114903
Pennsylvania  |  -.0023727   .0808246    -0.03   0.977    -.1608126    .1560672
Rhode Island  |  -.0315451   .1717054    -0.18   0.854    -.3681382     .305048
South Dakota  |   .1432595   .2355127     0.61   0.543    -.3184148    .6049338
South Caro..  |   .1146254   .1210846     0.95   0.344    -.1227361     .351987
   Tennessee  |  -.0992731   .1048581    -0.95   0.344     -.304826    .1062797
       Texas  |   .0521966   .0977969     0.53   0.594    -.1395142    .2439074
        Utah  |  -.2474467   .1413853    -1.75   0.080    -.5246036    .0297102
     Vermont  |  -.1867612   .2332195    -0.80   0.423    -.6439402    .2704177
    Virginia  |   .1904608   .1077484     1.77   0.077    -.0207577    .4016793
  Washington  |  -.0632721   .0957186    -0.66   0.509    -.2509087    .1243645
West Virgi..  |   .1388268   .1462584     0.95   0.343    -.1478828    .4255364
   Wisconsin  |          0  (omitted)
     Wyoming  |   .0197443   .2235246     0.09   0.930    -.4184297    .4579183
              |
        _cons |   .2538014   .0922721     2.75   0.006     .0729209    .4346819
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrredistr.t
> ex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree repub
> lican highinc higheduc female retirement_age high_confirmed child alone urban 
> _cons) ///
> label mtitle("Redistribution (std.)" "Redistribution (std.)" "Redistribution (
> std.)" "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)"
>  "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)") ///
> b(3)
(output written to tables/corrredistr.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, HEALTH CARE/MORAL VIEWS, Table S7
. *************************************************************************
. reg zfed_univ_healthcare zprior_soc_over_self [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =      84.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0121
                                                Root MSE          =     .99399

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |    .110038   .0119673     9.19   0.000      .086579     .133497
        _cons |  -7.42e-09   .0119574    -0.00   1.000    -.0234396    .0234396
-------------------------------------------------------------------------------

. est store col1

. reg zfed_univ_healthcare zprior_soc_over_self i.State_Recoded [pw=Weightvar], 
> robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =       6.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0407
                                                Root MSE          =     .98252

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .1066726   .0119128     8.95   0.000     .0833206    .1300247
              |
State_Recoded |
      Alaska  |   .5807263   .2821863     2.06   0.040     .0275683    1.133884
     Arizona  |   .4040504   .1279696     3.16   0.002      .153197    .6549038
    Arkansas  |   .2503611   .1647886     1.52   0.129    -.0726672    .5733893
  California  |   .6459728    .106864     6.04   0.000     .4364919    .8554538
    Colorado  |   .4171507   .1363043     3.06   0.002      .149959    .6843423
 Connecticut  |   .6368609   .1431657     4.45   0.000     .3562192    .9175027
    Delaware  |   .2320645   .2416909     0.96   0.337    -.2417122    .7058411
District o..  |   1.014183   .1847696     5.49   0.000     .6519867    1.376379
     Florida  |   .5474518   .1100912     4.97   0.000     .3316447    .7632589
     Georgia  |    .368179   .1265358     2.91   0.004     .1201362    .6162219
      Hawaii  |   .5700831   .2048043     2.78   0.005     .1686139    .9715524
       Idaho  |    .039228   .1855048     0.21   0.833    -.3244093    .4028652
    Illinois  |   .6594653   .1133998     5.82   0.000     .4371724    .8817581
     Indiana  |   .3741569   .1322401     2.83   0.005     .1149321    .6333817
        Iowa  |   .4189877   .1540287     2.72   0.007     .1170518    .7209237
      Kansas  |  -.0987587   .1637196    -0.60   0.546    -.4196913     .222174
    Kentucky  |   .4295413   .1414257     3.04   0.002     .1523104    .7067721
   Louisiana  |    .368491   .1583044     2.33   0.020     .0581734    .6788086
       Maine  |   .4644281   .1941424     2.39   0.017     .0838588    .8449974
    Maryland  |   .7220767   .1300684     5.55   0.000     .4671091    .9770443
Massachuse~s  |   .5913451   .1308577     4.52   0.000     .3348302      .84786
    Michigan  |    .483401    .121082     3.99   0.000     .2460489    .7207531
   Minnesota  |   .5069146   .1356259     3.74   0.000     .2410528    .7727764
 Mississippi  |   .1040482   .1787839     0.58   0.561    -.2464144    .4545107
    Missouri  |   .2255049   .1317865     1.71   0.087    -.0328308    .4838405
     Montana  |   .0410525   .2166293     0.19   0.850    -.3835968    .4657019
    Nebraska  |   .1814545   .1865104     0.97   0.331    -.1841541    .5470631
      Nevada  |   .5651848   .1498752     3.77   0.000     .2713906     .858979
New Hampsh..  |   .3590048   .1864239     1.93   0.054    -.0064341    .7244437
  New Jersey  |   .5298207     .12102     4.38   0.000     .2925901    .7670512
  New Mexico  |   .4630867    .185421     2.50   0.013     .0996138    .8265597
    New York  |   .6822431   .1087222     6.28   0.000     .4691196    .8953667
North Dakota  |   .3111534   .2861127     1.09   0.277    -.2497014    .8720082
North Caro..  |   .5218969   .1212539     4.30   0.000     .2842079    .7595859
        Ohio  |   .3718768   .1165998     3.19   0.001     .1433111    .6004425
    Oklahoma  |    .237679   .1490155     1.59   0.111    -.0544299     .529788
      Oregon  |   .4813662   .1367832     3.52   0.000     .2132358    .7494967
Pennsylvania  |   .5166876   .1115989     4.63   0.000     .2979249    .7354503
Rhode Island  |   .7212489   .2145876     3.36   0.001     .3006018    1.141896
South Dakota  |    .015878   .2474816     0.06   0.949    -.4692499     .501006
South Caro..  |   .1656861   .1453344     1.14   0.254    -.1192068     .450579
   Tennessee  |   .2730853   .1324451     2.06   0.039     .0134588    .5327119
       Texas  |   .4948793   .1103446     4.48   0.000     .2785754    .7111832
        Utah  |  -.1241847   .1564886    -0.79   0.427    -.4309428    .1825734
     Vermont  |   .7155384    .229849     3.11   0.002      .264975    1.166102
    Virginia  |   .5172445   .1224424     4.22   0.000     .2772259    .7572631
  Washington  |   .4924879   .1228798     4.01   0.000     .2516119     .733364
West Virgi..  |   .5761701   .1607615     3.58   0.000     .2610359    .8913042
   Wisconsin  |   .4367323   .1263146     3.46   0.001      .189123    .6843416
     Wyoming  |   .5699409   .2467673     2.31   0.021     .0862133    1.053669
              |
        _cons |  -.4866289   .1002788    -4.85   0.000    -.6832012   -.2900566
-------------------------------------------------------------------------------

. est store col2

. reg zfed_univ_healthcare zprior_soc_over_self republican highinc higheduc fema
> le retirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightv
> ar], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      49.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2845
                                                Root MSE          =     .85237

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0348299   .0118281     2.94   0.003     .0116433    .0580165
   republican |  -.9883458   .0245977   -40.18   0.000    -1.036564   -.9401272
      highinc |  -.0813682   .0242468    -3.36   0.001     -.128899   -.0338373
     higheduc |   .0284522   .0235307     1.21   0.227    -.0176749    .0745793
       female |   .0132576   .0220668     0.60   0.548    -.0299998     .056515
retirement~ge |  -.1845148   .0272723    -6.77   0.000    -.2379766   -.1310531
high_confir~d |   .3111525   .1026595     3.03   0.002     .1099097    .5123954
        child |   .0583286   .0281271     2.07   0.038     .0031912    .1134659
        alone |  -.0373153   .0286604    -1.30   0.193    -.0934982    .0188676
        urban |   .0997254   .0271742     3.67   0.000     .0464559    .1529949
              |
State_Recoded |
      Alaska  |   .3158317   .2834319     1.11   0.265    -.2397783    .8714416
     Arizona  |   .2851852   .0992245     2.87   0.004     .0906759    .4796945
    Arkansas  |   .0436589   .1472708     0.30   0.767    -.2450353    .3323531
  California  |   .4048408   .0857567     4.72   0.000     .2367323    .5729492
    Colorado  |  -.0665044   .1082731    -0.61   0.539    -.2787514    .1457427
 Connecticut  |   .1165379   .1141933     1.02   0.308    -.1073145    .3403903
    Delaware  |  -.1992688   .2337032    -0.85   0.394    -.6573958    .2588583
District o..  |   .2663365   .1557848     1.71   0.087    -.0390475    .5717205
     Florida  |   .0941939   .0793752     1.19   0.235    -.0614049    .2497928
     Georgia  |  -.0895859   .0985332    -0.91   0.363    -.2827401    .1035683
      Hawaii  |   .4388137     .21511     2.04   0.041     .0171348    .8604927
       Idaho  |   .0810231   .1737364     0.47   0.641    -.2595514    .4215977
    Illinois  |   .1316198     .08239     1.60   0.110    -.0298889    .2931285
     Indiana  |   .0393797   .1016457     0.39   0.698    -.1598758    .2386353
        Iowa  |   .2064578   .1335184     1.55   0.122    -.0552776    .4681931
      Kansas  |   .0107955   .1418681     0.08   0.939    -.2673077    .2888986
    Kentucky  |   .2230813   .1154601     1.93   0.053    -.0032544     .449417
   Louisiana  |    .026107   .1537548     0.17   0.865    -.2752978    .3275117
       Maine  |   .4117004   .1369051     3.01   0.003     .1433261    .6800747
    Maryland  |   .0904844   .1034979     0.87   0.382    -.1124019    .2933708
Massachuse~s  |   .0189782   .1082724     0.18   0.861    -.1932675    .2312239
    Michigan  |  -.0272718   .0872972    -0.31   0.755    -.1984001    .1438565
   Minnesota  |   .4160618   .1243355     3.35   0.001     .1723276     .659796
 Mississippi  |  -.1645925    .138613    -1.19   0.235    -.4363147    .1071298
    Missouri  |   .1764381   .1023956     1.72   0.085    -.0242875    .3771637
     Montana  |   .0181074    .171047     0.11   0.916    -.3171951    .3534099
    Nebraska  |   .1426678   .1361516     1.05   0.295    -.1242294    .4095651
      Nevada  |   .0549696    .130982     0.42   0.675    -.2017936    .3117329
New Hampsh..  |   .2597436   .1453865     1.79   0.074    -.0252567    .5447439
  New Jersey  |   .0347599   .0930875     0.37   0.709    -.1477191    .2172389
  New Mexico  |   .2776405   .1727243     1.61   0.108      -.06095     .616231
    New York  |   .1566696   .0787227     1.99   0.047     .0023499    .3109893
North Dakota  |   .3835604   .3132569     1.22   0.221    -.2305153    .9976361
North Caro..  |   .3500716   .0965848     3.62   0.000      .160737    .5394061
        Ohio  |   .2434739   .0960508     2.53   0.011     .0551859    .4317618
    Oklahoma  |   .2481731   .1327156     1.87   0.062    -.0119885    .5083347
      Oregon  |   .2634975   .1073188     2.46   0.014      .053121    .4738739
Pennsylvania  |   .0545206   .0803712     0.68   0.498    -.1030307    .2120719
Rhode Island  |   .1869062   .1909795     0.98   0.328    -.1874698    .5612822
South Dakota  |  -.0209062   .1866877    -0.11   0.911     -.386869    .3450567
South Caro..  |   .1311476   .1284442     1.02   0.307    -.1206408     .382936
   Tennessee  |  -.1476999   .1060983    -1.39   0.164    -.3556838    .0602839
       Texas  |   .3065155   .0891322     3.44   0.001     .1317901    .4812408
        Utah  |  -.5301815   .1369197    -3.87   0.000    -.7985845   -.2617785
     Vermont  |    .190823   .1796107     1.06   0.288    -.1612668    .5429128
    Virginia  |    .287103   .1011042     2.84   0.005      .088909    .4852971
  Washington  |  -.0284608   .1017606    -0.28   0.780    -.2279415    .1710199
West Virgi..  |   .3871997   .1400009     2.77   0.006     .1127566    .6616427
   Wisconsin  |          0  (omitted)
     Wyoming  |   .3160311   .1977189     1.60   0.110    -.0715562    .7036183
              |
        _cons |   .0204308   .0844912     0.24   0.809    -.1451969    .1860585
-------------------------------------------------------------------------------

. est store col3

. 
. reg zfed_univ_healthcare zprior_national_over_global [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =     324.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0445
                                                Root MSE          =     .97753

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.2110524   .0117158   -18.01   0.000    -.2340183   -.1880864
        _cons |  -8.09e-09    .011796    -0.00   1.000    -.0231231    .0231231
-------------------------------------------------------------------------------

. est store col4

. reg zfed_univ_healthcare zprior_national_over_global i.State_Recoded [pw=Weigh
> tvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =      11.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0705
                                                Root MSE          =     .96712

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.2038078   .0117086   -17.41   0.000    -.2267597    -.180856
              |
State_Recoded |
      Alaska  |   .4343915   .2695714     1.61   0.107     -.094038     .962821
     Arizona  |   .4074314   .1232142     3.31   0.001     .1658998     .648963
    Arkansas  |   .2744788   .1609341     1.71   0.088    -.0409936    .5899512
  California  |   .6142152   .1032254     5.95   0.000     .4118669    .8165636
    Colorado  |   .4136079   .1328985     3.11   0.002     .1530926    .6741232
 Connecticut  |    .615491    .137175     4.49   0.000     .3465925    .8843895
    Delaware  |   .2026317   .2443837     0.83   0.407    -.2764234    .6816868
District o..  |   .9026513   .1873083     4.82   0.000     .5354787    1.269824
     Florida  |     .53866   .1066386     5.05   0.000     .3296209    .7476991
     Georgia  |   .3463986   .1216861     2.85   0.004     .1078625    .5849348
      Hawaii  |   .5528865   .1995881     2.77   0.006     .1616423    .9441307
       Idaho  |  -.0031516   .1820871    -0.02   0.986    -.3600893    .3537862
    Illinois  |   .6572513   .1100072     5.97   0.000     .4416087    .8728939
     Indiana  |    .406569    .128622     3.16   0.002     .1544367    .6587013
        Iowa  |    .402025   .1527691     2.63   0.009     .1025581    .7014919
      Kansas  |  -.1092844   .1533697    -0.71   0.476    -.4099287    .1913598
    Kentucky  |   .4516929   .1398713     3.23   0.001      .177509    .7258768
   Louisiana  |    .388457   .1589576     2.44   0.015     .0768591     .700055
       Maine  |   .4679533   .1928974     2.43   0.015     .0898247     .846082
    Maryland  |   .6929375   .1280974     5.41   0.000     .4418334    .9440416
Massachuse~s  |   .5825339   .1262326     4.61   0.000     .3350855    .8299824
    Michigan  |   .4758562    .117451     4.05   0.000      .245622    .7060904
   Minnesota  |   .5180088   .1327749     3.90   0.000     .2577356    .7782819
 Mississippi  |   .0727243   .1698543     0.43   0.669     -.260234    .4056827
    Missouri  |   .2332206   .1258164     1.85   0.064     -.013412    .4798533
     Montana  |   .1378416    .216004     0.64   0.523     -.285582    .5612652
    Nebraska  |   .1888086   .1791472     1.05   0.292    -.1623661    .5399834
      Nevada  |   .5903647   .1458265     4.05   0.000     .3045071    .8762224
New Hampsh..  |    .354363   .1869619     1.90   0.058    -.0121305    .7208566
  New Jersey  |   .5136777   .1185235     4.33   0.000      .281341    .7460144
  New Mexico  |    .432096   .1841482     2.35   0.019     .0711179     .793074
    New York  |   .6529317    .105198     6.21   0.000     .4467163     .859147
North Dakota  |   .3270399   .2869418     1.14   0.254    -.2354402      .88952
North Caro..  |   .5101583   .1170556     4.36   0.000      .280699    .7396176
        Ohio  |    .381324   .1132867     3.37   0.001     .1592529    .6033952
    Oklahoma  |   .2358826   .1434522     1.64   0.100    -.0453209     .517086
      Oregon  |   .4880107   .1301001     3.75   0.000     .2329809    .7430405
Pennsylvania  |   .5180472   .1081349     4.79   0.000     .3060749    .7300195
Rhode Island  |   .7278012   .2160757     3.37   0.001     .3042371    1.151365
South Dakota  |   .0391613   .2312726     0.17   0.866    -.4141927    .4925152
South Caro..  |   .1569145   .1412861     1.11   0.267    -.1200427    .4338717
   Tennessee  |   .2871932   .1279377     2.24   0.025     .0364022    .5379842
       Texas  |   .4742886   .1067755     4.44   0.000     .2649811    .6835961
        Utah  |  -.1286432   .1526838    -0.84   0.400    -.4279428    .1706565
     Vermont  |   .7233437   .2185732     3.31   0.001     .2948837    1.151804
    Virginia  |   .5126156   .1191354     4.30   0.000     .2790795    .7461518
  Washington  |   .4873484   .1193456     4.08   0.000     .2534002    .7212966
West Virgi..  |   .6044612   .1588456     3.81   0.000     .2930828    .9158396
   Wisconsin  |   .4345372   .1223861     3.55   0.000     .1946288    .6744456
     Wyoming  |   .5607084   .2253586     2.49   0.013     .1189474    1.002469
              |
        _cons |  -.4773678    .096505    -4.95   0.000    -.6665425    -.288193
-------------------------------------------------------------------------------

. est store col5

. reg zfed_univ_healthcare zprior_national_over_global republican highinc highed
> uc female retirement_age high_confirmed child alone urban i.State_Recoded [pw=
> Weightvar], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      50.60
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2881
                                                Root MSE          =     .85023

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0735882   .0120557    -6.10   0.000    -.0972209   -.0499554
   republican |  -.9580922   .0253848   -37.74   0.000    -1.007854   -.9083305
      highinc |  -.0781207    .024212    -3.23   0.001    -.1255834    -.030658
     higheduc |   .0252818   .0234883     1.08   0.282    -.0207622    .0713259
       female |    .020481   .0219876     0.93   0.352    -.0226211    .0635832
retirement~ge |  -.1732665   .0273621    -6.33   0.000    -.2269043   -.1196287
high_confir~d |   .3166438   .1023519     3.09   0.002     .1160039    .5172836
        child |   .0550709   .0281274     1.96   0.050    -.0000671    .1102088
        alone |  -.0407941   .0285498    -1.43   0.153    -.0967602     .015172
        urban |   .0980345   .0272042     3.60   0.000     .0447063    .1513628
              |
State_Recoded |
      Alaska  |   .2748384   .2718079     1.01   0.312    -.2579851    .8076618
     Arizona  |   .2902307   .0987982     2.94   0.003     .0965571    .4839043
    Arkansas  |   .0594644   .1469548     0.40   0.686    -.2286103    .3475392
  California  |   .4051768   .0855676     4.74   0.000     .2374392    .5729144
    Colorado  |  -.0681796   .1080917    -0.63   0.528    -.2800712     .143712
 Connecticut  |   .1147601   .1124206     1.02   0.307    -.1056173    .3351375
    Delaware  |  -.2104362   .2372284    -0.89   0.375    -.6754737    .2546013
District o..  |   .2352211   .1572461     1.50   0.135    -.0730275    .5434697
     Florida  |   .0927941   .0791706     1.17   0.241    -.0624035    .2479917
     Georgia  |  -.0963336   .0971316    -0.99   0.321    -.2867401    .0940729
      Hawaii  |   .4377715   .2123964     2.06   0.039     .0214121    .8541309
       Idaho  |   .0632907   .1736627     0.36   0.716    -.2771394    .4037209
    Illinois  |    .135875   .0823122     1.65   0.099    -.0254812    .2972312
     Indiana  |   .0493938   .1010747     0.49   0.625    -.1487425      .24753
        Iowa  |   .2079949    .134409     1.55   0.122    -.0554863    .4714761
      Kansas  |   .0075059   .1385032     0.05   0.957    -.2640013     .279013
    Kentucky  |    .239212   .1161896     2.06   0.040     .0114463    .4669778
   Louisiana  |   .0291251   .1560353     0.19   0.852      -.27675    .3350003
       Maine  |   .4157424   .1386821     3.00   0.003     .1438847    .6876001
    Maryland  |   .0899844   .1033003     0.87   0.384    -.1125146    .2924834
Massachuse~s  |   .0212937   .1075939     0.20   0.843    -.1896221    .2322094
    Michigan  |  -.0270742   .0872317    -0.31   0.756    -.1980741    .1439256
   Minnesota  |   .4257657   .1243911     3.42   0.001     .1819226    .6696089
 Mississippi  |  -.1874394   .1393687    -1.34   0.179     -.460643    .0857642
    Missouri  |   .1846155   .1013539     1.82   0.069    -.0140679     .383299
     Montana  |   .0531476   .1728871     0.31   0.759     -.285762    .3920572
    Nebraska  |   .1478545   .1358951     1.09   0.277    -.1185398    .4142489
      Nevada  |   .0636483   .1298727     0.49   0.624    -.1909405    .3182371
New Hampsh..  |   .2656075   .1465754     1.81   0.070    -.0217234    .5529384
  New Jersey  |   .0320547   .0933782     0.34   0.731    -.1509942    .2151035
  New Mexico  |   .2697925   .1728651     1.56   0.119    -.0690741    .6086591
    New York  |    .151003    .078587     1.92   0.055    -.0030508    .3050567
North Dakota  |   .3923655   .3128068     1.25   0.210     -.220828    1.005559
North Caro..  |   .3536532   .0962407     3.67   0.000      .164993    .5423133
        Ohio  |     .25183   .0959566     2.62   0.009     .0637268    .4399333
    Oklahoma  |   .2580461   .1323484     1.95   0.051    -.0013956    .5174878
      Oregon  |    .273421   .1062213     2.57   0.010     .0651959    .4816461
Pennsylvania  |    .054311   .0803254     0.68   0.499    -.1031504    .2117725
Rhode Island  |   .1893071   .1921685     0.99   0.325    -.1873998     .566014
South Dakota  |  -.0077355   .1818862    -0.04   0.966    -.3642861     .348815
South Caro..  |   .1307721   .1278783     1.02   0.307     -.119907    .3814513
   Tennessee  |   -.144291   .1055625    -1.37   0.172    -.3512246    .0626426
       Texas  |   .3097831   .0889178     3.48   0.000      .135478    .4840881
        Utah  |  -.5336744   .1374684    -3.88   0.000     -.803153   -.2641958
     Vermont  |   .1976029   .1749863     1.13   0.259    -.1454217    .5406275
    Virginia  |   .2932926   .1010915     2.90   0.004     .0951235    .4914617
  Washington  |  -.0300621   .1011062    -0.30   0.766      -.22826    .1681358
West Virgi..  |   .4041785   .1397805     2.89   0.004     .1301675    .6781896
   Wisconsin  |          0  (omitted)
     Wyoming  |   .3229767   .1937702     1.67   0.096      -.05687    .7028234
              |
        _cons |    .002377   .0846644     0.03   0.978    -.1635901    .1683441
-------------------------------------------------------------------------------

. est store col6

. 
. reg zfed_univ_healthcare zluck_unfair_agree [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =     403.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0565
                                                Root MSE          =     .97139

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .2377471   .0118431    20.07   0.000     .2145316    .2609626
        _cons |  -9.46e-09   .0116727    -0.00   1.000    -.0228815    .0228815
-------------------------------------------------------------------------------

. est store col7

. reg zfed_univ_healthcare zluck_unfair_agree i.State_Recoded [pw=Weightvar], ro
> bust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(51, 8064)       =      13.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0828
                                                Root MSE          =     .96072

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .2324312    .011736    19.81   0.000     .2094257    .2554368
              |
State_Recoded |
      Alaska  |   .5653475   .2863446     1.97   0.048     .0040381    1.126657
     Arizona  |   .3753914   .1255194     2.99   0.003     .1293411    .6214418
    Arkansas  |      .2861   .1608291     1.78   0.075    -.0291665    .6013665
  California  |   .6314051   .1071951     5.89   0.000     .4212749    .8415352
    Colorado  |   .3819714   .1345784     2.84   0.005     .1181629    .6457799
 Connecticut  |   .5621252   .1425381     3.94   0.000     .2827137    .8415366
    Delaware  |   .2420298    .224012     1.08   0.280    -.1970915     .681151
District o..  |   .9266776   .1744132     5.31   0.000     .5847826    1.268573
     Florida  |   .5149918   .1098066     4.69   0.000     .2997426    .7302411
     Georgia  |   .3483646   .1253346     2.78   0.005     .1026764    .5940528
      Hawaii  |   .5001802   .2210826     2.26   0.024     .0668012    .9335592
       Idaho  |   .0526767   .1828817     0.29   0.773    -.3058187    .4111721
    Illinois  |   .6496344   .1130188     5.75   0.000     .4280884    .8711804
     Indiana  |   .4193511   .1296022     3.24   0.001     .1652974    .6734048
        Iowa  |   .4455167   .1461727     3.05   0.002     .1589805     .732053
      Kansas  |  -.1365511   .1526331    -0.89   0.371    -.4357515    .1626493
    Kentucky  |    .429257    .143935     2.98   0.003     .1471072    .7114069
   Louisiana  |   .3758987   .1598072     2.35   0.019     .0626353    .6891621
       Maine  |   .4068202   .1920027     2.12   0.034     .0304454     .783195
    Maryland  |   .6723294   .1289681     5.21   0.000     .4195187    .9251401
Massachuse~s  |   .5347092    .133021     4.02   0.000     .2739537    .7954647
    Michigan  |   .4687236   .1213526     3.86   0.000     .2308411     .706606
   Minnesota  |   .5351337    .133842     4.00   0.000     .2727688    .7974986
 Mississippi  |   .0371297   .1819102     0.20   0.838    -.3194613    .3937208
    Missouri  |   .2048059   .1293804     1.58   0.113    -.0488132    .4584249
     Montana  |   .1262066   .2143428     0.59   0.556    -.2939606    .5463738
    Nebraska  |   .2115132   .1741499     1.21   0.225    -.1298657     .552892
      Nevada  |    .596057   .1521346     3.92   0.000     .2978338    .8942802
New Hampsh..  |   .3407074   .1878895     1.81   0.070    -.0276046    .7090194
  New Jersey  |   .4987465   .1194603     4.17   0.000     .2645733    .7329196
  New Mexico  |   .4488773   .1850086     2.43   0.015     .0862126    .8115419
    New York  |   .6278459   .1092303     5.75   0.000     .4137264    .8419655
North Dakota  |   .2878925   .2709284     1.06   0.288    -.2431972    .8189821
North Caro..  |   .5260366   .1201797     4.38   0.000     .2904534    .7616198
        Ohio  |   .3785274   .1168568     3.24   0.001     .1494579    .6075968
    Oklahoma  |    .259105   .1463445     1.77   0.077     -.027768    .5459779
      Oregon  |   .4444587   .1346302     3.30   0.001     .1805487    .7083687
Pennsylvania  |   .4968098     .11128     4.46   0.000     .2786722    .7149473
Rhode Island  |   .6388268   .1991755     3.21   0.001     .2483913    1.029262
South Dakota  |    .034588   .2406428     0.14   0.886     -.437134      .50631
South Caro..  |   .1423201   .1441795     0.99   0.324    -.1403089     .424949
   Tennessee  |   .2454314   .1323552     1.85   0.064    -.0140191    .5048818
       Texas  |   .4643613   .1105775     4.20   0.000     .2476009    .6811217
        Utah  |  -.1528528   .1564262    -0.98   0.329    -.4594886    .1537829
     Vermont  |   .7842894    .206187     3.80   0.000     .3801097    1.188469
    Virginia  |    .481962   .1217645     3.96   0.000     .2432722    .7206518
  Washington  |   .5178993   .1222304     4.24   0.000     .2782961    .7575025
West Virgi..  |   .4909276   .1589286     3.09   0.002     .1793866    .8024687
   Wisconsin  |   .4634133   .1246769     3.72   0.000     .2190144    .7078123
     Wyoming  |   .5863675   .2450898     2.39   0.017     .1059282    1.066807
              |
        _cons |  -.4687695     .10074    -4.65   0.000    -.6662458   -.2712931
-------------------------------------------------------------------------------

. est store col8

. reg zfed_univ_healthcare zluck_unfair_agree republican highinc higheduc female
>  retirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar
> ], robust
(sum of wgt is 7,213.05472456784)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      7,239
                                                F(59, 7179)       =      58.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3042
                                                Root MSE          =     .84054

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1478339   .0112497    13.14   0.000     .1257812    .1698867
   republican |  -.9496855   .0246764   -38.49   0.000    -.9980585   -.9013125
      highinc |  -.0601518   .0240264    -2.50   0.012    -.1072507   -.0130529
     higheduc |   .0285446   .0231192     1.23   0.217    -.0167758    .0738651
       female |    .006096   .0217525     0.28   0.779    -.0365453    .0487372
retirement~ge |  -.1677185   .0273034    -6.14   0.000    -.2212411   -.1141958
high_confir~d |   .3341804   .1030171     3.24   0.001     .1322366    .5361242
        child |   .0363481   .0278259     1.31   0.192    -.0181989    .0908951
        alone |  -.0401367   .0283595    -1.42   0.157    -.0957297    .0154562
        urban |    .090448    .027098     3.34   0.001      .037328     .143568
              |
State_Recoded |
      Alaska  |   .3234222   .2836754     1.14   0.254    -.2326652    .8795095
     Arizona  |   .2805747   .0989306     2.84   0.005     .0866415    .4745078
    Arkansas  |   .0776732   .1473602     0.53   0.598    -.2111961    .3665425
  California  |   .4001462   .0868159     4.61   0.000     .2299614    .5703309
    Colorado  |  -.0981472   .1069254    -0.92   0.359    -.3077524     .111458
 Connecticut  |   .0502607   .1155747     0.43   0.664    -.1762998    .2768211
    Delaware  |   -.204189   .2206928    -0.93   0.355    -.6368118    .2284339
District o..  |   .1768237   .1492803     1.18   0.236    -.1158095     .469457
     Florida  |   .0577022   .0780249     0.74   0.460    -.0952496    .2106539
     Georgia  |  -.1199661   .0968573    -1.24   0.216     -.309835    .0699027
      Hawaii  |   .3972782   .2239352     1.77   0.076    -.0417009    .8362572
       Idaho  |   .0799575   .1715935     0.47   0.641    -.2564162    .4163313
    Illinois  |   .1072349   .0815856     1.31   0.189    -.0526969    .2671668
     Indiana  |   .0462082   .0983158     0.47   0.638    -.1465196     .238936
        Iowa  |   .2205624   .1287361     1.71   0.087    -.0317984    .4729231
      Kansas  |  -.0162438   .1348178    -0.12   0.904    -.2805264    .2480389
    Kentucky  |   .2219842   .1172625     1.89   0.058    -.0078849    .4518533
   Louisiana  |    .008529   .1540835     0.06   0.956    -.2935201    .3105782
       Maine  |   .3700397   .1364825     2.71   0.007     .1024938    .6375856
    Maryland  |    .035221   .1016529     0.35   0.729    -.1640485    .2344906
Massachuse~s  |  -.0277369   .1086254    -0.26   0.798    -.2406746    .1852009
    Michigan  |  -.0564506   .0864967    -0.65   0.514    -.2260095    .1131084
   Minnesota  |   .4300033    .122634     3.51   0.000     .1896046    .6704021
 Mississippi  |  -.2251789   .1413495    -1.59   0.111    -.5022655    .0519077
    Missouri  |   .1715068    .102139     1.68   0.093    -.0287158    .3717294
     Montana  |   .0669409   .1712298     0.39   0.696      -.26872    .4026017
    Nebraska  |    .143186   .1302933     1.10   0.272    -.1122273    .3985994
      Nevada  |   .0576993   .1311888     0.44   0.660    -.1994694     .314868
New Hampsh..  |   .2511175   .1484963     1.69   0.091     -.039979     .542214
  New Jersey  |   .0016401   .0908945     0.02   0.986      -.17654    .1798202
  New Mexico  |   .2944895   .1763788     1.67   0.095    -.0512648    .6402439
    New York  |   .1049798   .0779817     1.35   0.178    -.0478872    .2578468
North Dakota  |   .3532808   .2963914     1.19   0.233    -.2277337    .9342953
North Caro..  |    .354983   .0966653     3.67   0.000     .1654905    .5444755
        Ohio  |   .2506915   .0966425     2.59   0.010     .0612438    .4401392
    Oklahoma  |   .2612098   .1315272     1.99   0.047     .0033778    .5190417
      Oregon  |    .246577    .106138     2.32   0.020     .0385152    .4546387
Pennsylvania  |   .0226345   .0790753     0.29   0.775    -.1323764    .1776454
Rhode Island  |   .1170668    .185998     0.63   0.529    -.2475441    .4816776
South Dakota  |  -.0042381   .1847698    -0.02   0.982    -.3664413    .3579651
South Caro..  |   .1253928   .1283249     0.98   0.329    -.1261617    .3769473
   Tennessee  |  -.1814456   .1059106    -1.71   0.087    -.3890615    .0261703
       Texas  |   .2943076   .0900797     3.27   0.001      .117725    .4708903
        Utah  |  -.5575453   .1379893    -4.04   0.000    -.8280449   -.2870457
     Vermont  |    .190206    .162459     1.17   0.242    -.1282614    .5086734
    Virginia  |    .273816   .1014362     2.70   0.007     .0749711    .4726608
  Washington  |   -.038202    .099754    -0.38   0.702    -.2337491    .1573452
West Virgi..  |   .3406291   .1387908     2.45   0.014     .0685582       .6127
   Wisconsin  |          0  (omitted)
     Wyoming  |   .3372369   .1968483     1.71   0.087    -.0486437    .7231175
              |
        _cons |     .01435   .0853486     0.17   0.866    -.1529584    .1816583
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrhealth.te
> x, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree repub
> lican highinc higheduc female retirement_age high_confirmed child alone urban 
> _cons) ///
> label mtitle("Health care (std.)"  "Health care (std.)" "Health care (std.)" "
> Health care (std.)" "Health care (std.)" "Health care (std.)" "Health care (st
> d.)" "Health care (std.)" "Health care (std.)") ///
> b(3)
(output written to tables/corrhealth.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, REDISTRIBUTION/MORAL VIEWS, republicans, Table S8
. *************************************************************************
. reg zgov_reduce_inequality_agree zprior_soc_over_self [pw=Weightvar] if republ
> ican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =      30.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0125
                                                Root MSE          =     1.0623

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .1236596   .0222185     5.57   0.000     .0800946    .1672245
        _cons |  -.5750222   .0212329   -27.08   0.000    -.6166546   -.5333898
-------------------------------------------------------------------------------

. est store col1

. reg zgov_reduce_inequality_agree zprior_soc_over_self i.State_Recoded [pw=Weig
> htvar]  if republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =       4.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0536
                                                Root MSE          =     1.0487

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .1174508   .0219488     5.35   0.000     .0744142    .1604873
              |
State_Recoded |
      Alaska  |   .7742265   .5321972     1.45   0.146    -.2692889    1.817742
     Arizona  |   .0071648   .1714597     0.04   0.967     -.329028    .3433575
    Arkansas  |   .0527446   .2578007     0.20   0.838    -.4527429    .5582321
  California  |   .3667129   .1455796     2.52   0.012      .081265    .6521607
    Colorado  |   .0340237    .200929     0.17   0.866    -.3599516    .4279989
 Connecticut  |   .1589734   .2389792     0.67   0.506    -.3096093    .6275561
    Delaware  |  -.3870705   .3599255    -1.08   0.282    -1.092801    .3186599
District o..  |  -.1610697   .3352949    -0.48   0.631    -.8185052    .4963658
     Florida  |   .1756167   .1452309     1.21   0.227    -.1091473    .4603808
     Georgia  |  -.0059073    .167173    -0.04   0.972    -.3336948    .3218802
      Hawaii  |    1.22932    .234513     5.24   0.000     .7694944    1.689146
       Idaho  |   .2003203   .2577867     0.78   0.437    -.3051397    .7057803
    Illinois  |   .0878433   .1636672     0.54   0.592    -.2330702    .4087567
     Indiana  |  -.0728505   .1833874    -0.40   0.691    -.4324307    .2867296
        Iowa  |  -.3101857   .2151882    -1.44   0.150    -.7321199    .1117485
      Kansas  |   .0160308   .2127634     0.08   0.940     -.401149    .4332106
    Kentucky  |  -.1346879   .1966121    -0.69   0.493    -.5201986    .2508228
   Louisiana  |   .3802106   .2148884     1.77   0.077    -.0411358    .8015571
       Maine  |   .7314834   .2328986     3.14   0.002     .2748232    1.188143
    Maryland  |    .076792   .2173197     0.35   0.724    -.3493215    .5029055
Massachuse~s  |   .4266508    .226476     1.88   0.060    -.0174161    .8707178
    Michigan  |  -.0680427   .1715807    -0.40   0.692    -.4044728    .2683874
   Minnesota  |   .3956398    .219258     1.80   0.071    -.0342744     .825554
 Mississippi  |   .2479267    .217574     1.14   0.255    -.1786856     .674539
    Missouri  |   .0370755   .1722631     0.22   0.830    -.3006925    .3748435
     Montana  |  -.6971649   .1926947    -3.62   0.000    -1.074995   -.3193352
    Nebraska  |   .3304843   .2969266     1.11   0.266    -.2517199    .9126885
      Nevada  |   .4704554   .2376231     1.98   0.048     .0045316    .9363791
New Hampsh..  |  -.0580176   .2480632    -0.23   0.815    -.5444121    .4283768
  New Jersey  |   .2833085   .1669977     1.70   0.090    -.0441353    .6107522
  New Mexico  |   .2134104   .2363495     0.90   0.367    -.2500162    .6768369
    New York  |   .6265198   .1488301     4.21   0.000     .3346984    .9183412
North Dakota  |    .469145   .5123877     0.92   0.360    -.5355286    1.473819
North Caro..  |      .1566   .1697708     0.92   0.356    -.1762811    .4894811
        Ohio  |   .1053616   .1571016     0.67   0.502    -.2026782    .4134015
    Oklahoma  |   .2251938   .2002001     1.12   0.261    -.1673521    .6177398
      Oregon  |   .0364145    .227473     0.16   0.873    -.4096073    .4824364
Pennsylvania  |   .2184863   .1470832     1.49   0.138    -.0699098    .5068825
Rhode Island  |   .3251361   .4136074     0.79   0.432    -.4858522    1.136124
South Dakota  |    .183889   .4174987     0.44   0.660    -.6347291    1.002507
South Caro..  |   .2374376   .1738293     1.37   0.172    -.1034013    .5782766
   Tennessee  |   .1474226   .1851274     0.80   0.426    -.2155694    .5104146
       Texas  |   .0081771    .144224     0.06   0.955    -.2746127     .290967
        Utah  |   .0801898   .2241944     0.36   0.721    -.3594035     .519783
     Vermont  |  -.5029632   .2804003    -1.79   0.073    -1.052763    .0468368
    Virginia  |   .2089188   .1817788     1.15   0.251    -.1475073    .5653448
  Washington  |   .0751088   .2121742     0.35   0.723    -.3409156    .4911331
West Virgi..  |   .6093277   .2447434     2.49   0.013     .1294426    1.089213
   Wisconsin  |   .0779092   .1773757     0.44   0.661    -.2698834    .4257017
     Wyoming  |  -.2161485   .3461402    -0.62   0.532    -.8948492    .4625523
              |
        _cons |  -.7506274   .1227523    -6.11   0.000    -.9913161   -.5099386
-------------------------------------------------------------------------------

. est store col2

. reg zgov_reduce_inequality_agree zprior_soc_over_self highinc higheduc female 
> retirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar]
>   if republican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =       8.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1197
                                                Root MSE          =     1.0126

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |    .102206   .0214192     4.77   0.000     .0602079    .1442042
      highinc |  -.2163629   .0430683    -5.02   0.000      -.30081   -.1319158
     higheduc |   -.181218   .0439052    -4.13   0.000    -.2673061   -.0951299
       female |  -.1016289   .0404569    -2.51   0.012    -.1809556   -.0223022
retirement~ge |  -.3775029   .0478758    -7.89   0.000    -.4713764   -.2836294
high_confir~d |   .0615421   .1716867     0.36   0.720    -.2750961    .3981802
        child |   .3334106    .051422     6.48   0.000     .2325839    .4342374
        alone |   .0391556   .0539979     0.73   0.468    -.0667217     .145033
        urban |   .0999969   .0447004     2.24   0.025     .0123496    .1876442
              |
State_Recoded |
      Alaska  |   .7215262   .4709781     1.53   0.126    -.2019536    1.645006
     Arizona  |    .049601   .1583916     0.31   0.754    -.2609686    .3601706
    Arkansas  |   .0399445   .2473063     0.16   0.872    -.4449662    .5248552
  California  |   .3638251   .1392312     2.61   0.009     .0908247    .6368255
    Colorado  |  -.0401077   .2080647    -0.19   0.847    -.4480747    .3678593
 Connecticut  |   .1422614   .2376279     0.60   0.549    -.3236723    .6081951
    Delaware  |   -.354568   .3080132    -1.15   0.250     -.958511    .2493751
District o..  |  -.1464192   .4064912    -0.36   0.719    -.9434549    .6506165
     Florida  |    .126272    .149229     0.85   0.398    -.1663318    .4188759
     Georgia  |  -.0823436   .1704321    -0.48   0.629    -.4165218    .2518345
      Hawaii  |   1.210191   .2525896     4.79   0.000     .7149212    1.705461
       Idaho  |   .1129945    .254782     0.44   0.657    -.3865744    .6125634
    Illinois  |   .0181897   .1611855     0.11   0.910    -.2978581    .3342375
     Indiana  |  -.1345895   .1771058    -0.76   0.447    -.4818532    .2126742
        Iowa  |  -.2360055   .2045393    -1.15   0.249    -.6370601    .1650491
      Kansas  |   .1144079   .2146351     0.53   0.594    -.3064422    .5352579
    Kentucky  |  -.0704264   .1832147    -0.38   0.701    -.4296683    .2888155
   Louisiana  |   .2536516   .2287323     1.11   0.268    -.1948399    .7021431
       Maine  |    .689934   .2544227     2.71   0.007     .1910695    1.188799
    Maryland  |   .0829854   .2267652     0.37   0.714    -.3616491    .5276198
Massachuse~s  |    .334993    .213561     1.57   0.117    -.0837511     .753737
    Michigan  |  -.1066523   .1711159    -0.62   0.533    -.4421712    .2288666
   Minnesota  |   .5010455   .2118522     2.37   0.018     .0856521     .916439
 Mississippi  |    .158594   .2098273     0.76   0.450    -.2528291    .5700171
    Missouri  |   .0622966   .1615784     0.39   0.700    -.2545215    .3791148
     Montana  |  -.7500767   .1904321    -3.94   0.000     -1.12347   -.3766831
    Nebraska  |   .4904189   .2691156     1.82   0.069     -.037255    1.018093
      Nevada  |   .4236847   .2481232     1.71   0.088    -.0628279    .9101972
New Hampsh..  |  -.0401643   .2469914    -0.16   0.871    -.5244577    .4441291
  New Jersey  |   .2140742   .1699583     1.26   0.208     -.119175    .5473234
  New Mexico  |   .1987825   .2128186     0.93   0.350    -.2185058    .6160707
    New York  |   .5365904   .1501454     3.57   0.000     .2421898     .830991
North Dakota  |    .468674   .4780419     0.98   0.327    -.4686562    1.406004
North Caro..  |   .1732989   .1676784     1.03   0.301    -.1554799    .5020776
        Ohio  |   .0609918   .1515199     0.40   0.687    -.2361038    .3580875
    Oklahoma  |   .1190959    .185377     0.64   0.521    -.2443857    .4825775
      Oregon  |   .0144529   .2014935     0.07   0.943    -.3806295    .4095353
Pennsylvania  |   .1775247   .1493091     1.19   0.235    -.1152362    .4702855
Rhode Island  |   .1862463   .3564654     0.52   0.601    -.5127003     .885193
South Dakota  |   .1578543   .3786187     0.42   0.677    -.5845298    .9002384
South Caro..  |   .2138264   .1719668     1.24   0.214     -.123361    .5510138
   Tennessee  |   .1296578   .1820816     0.71   0.476    -.2273623    .4866779
       Texas  |  -.0231828   .1359964    -0.17   0.865    -.2898404    .2434749
        Utah  |  -.0476922   .2297992    -0.21   0.836    -.4982756    .4028912
     Vermont  |  -.4397054   .1952489    -2.25   0.024    -.8225436   -.0568672
    Virginia  |   .2036119   .1727464     1.18   0.239    -.1351041    .5423279
  Washington  |   .0377431   .2007993     0.19   0.851    -.3559782    .4314645
West Virgi..  |   .5105025   .2240944     2.28   0.023      .071105       .9499
   Wisconsin  |          0  (omitted)
     Wyoming  |  -.3083399   .3392079    -0.91   0.363    -.9734486    .3567689
              |
        _cons |  -.5954877   .1232067    -4.83   0.000    -.8370678   -.3539077
-------------------------------------------------------------------------------

. est store col3

. 
. reg zgov_reduce_inequality_agree zprior_national_over_global [pw=Weightvar]  i
> f republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =      66.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0247
                                                Root MSE          =     1.0557

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.1930257   .0236241    -8.17   0.000    -.2393469   -.1467046
        _cons |  -.5288402   .0221961   -23.83   0.000    -.5723613    -.485319
-------------------------------------------------------------------------------

. est store col4

. reg zgov_reduce_inequality_agree zprior_national_over_global i.State_Recoded [
> pw=Weightvar]  if republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =       4.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0645
                                                Root MSE          =     1.0426

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.1837589   .0231692    -7.93   0.000    -.2291882   -.1383296
              |
State_Recoded |
      Alaska  |   .4907612   .4947434     0.99   0.321    -.4793159    1.460838
     Arizona  |   .0153825   .1689688     0.09   0.927    -.3159262    .3466912
    Arkansas  |   .0776561   .2587063     0.30   0.764    -.4296071    .5849192
  California  |   .3584622   .1464375     2.45   0.014     .0713323    .6455922
    Colorado  |   .0285083   .2015499     0.14   0.888    -.3666843    .4237009
 Connecticut  |   .1655766   .2408083     0.69   0.492    -.3065927    .6377459
    Delaware  |   -.449078   .3649433    -1.23   0.219    -1.164647    .2664911
District o..  |  -.2802891   .3604573    -0.78   0.437    -.9870622    .4264841
     Florida  |    .142994   .1462067     0.98   0.328    -.1436834    .4296714
     Georgia  |  -.0375058   .1654132    -0.23   0.821    -.3618428    .2868313
      Hawaii  |   1.204582   .2308105     5.22   0.000     .7520158    1.657148
       Idaho  |   .1563129   .2574281     0.61   0.544    -.3484439    .6610697
    Illinois  |   .0967168    .163093     0.59   0.553    -.2230706    .4165043
     Indiana  |  -.0718224   .1809946    -0.40   0.692    -.4267108     .283066
        Iowa  |  -.3069801   .2171157    -1.41   0.157    -.7326936    .1187335
      Kansas  |   .0283619   .2128812     0.13   0.894    -.3890487    .4457725
    Kentucky  |  -.1052917   .1980139    -0.53   0.595     -.493551    .2829676
   Louisiana  |   .4049597   .2187977     1.85   0.064    -.0240519    .8339712
       Maine  |   .7356437   .2389883     3.08   0.002     .2670431    1.204244
    Maryland  |   .1181568   .2154693     0.55   0.583    -.3043286    .5406423
Massachuse~s  |   .4379875   .2273257     1.93   0.054    -.0077455    .8837204
    Michigan  |  -.0709661   .1712651    -0.41   0.679    -.4067773    .2648451
   Minnesota  |   .4078539   .2208993     1.85   0.065    -.0252784    .8409863
 Mississippi  |   .2675094   .2169117     1.23   0.218    -.1578041     .692823
    Missouri  |   .0404152   .1740436     0.23   0.816    -.3008438    .3816743
     Montana  |   -.655056   .1926014    -3.40   0.001    -1.032703   -.2774093
    Nebraska  |   .3273007   .2941652     1.11   0.266    -.2494892    .9040905
      Nevada  |   .4778826   .2337586     2.04   0.041     .0195361    .9362291
New Hampsh..  |  -.1070846   .2581784    -0.41   0.678    -.6133125    .3991434
  New Jersey  |   .2704712   .1665686     1.62   0.105    -.0561313    .5970737
  New Mexico  |   .1914427   .2323216     0.82   0.410    -.2640862    .6469716
    New York  |   .6116505   .1492119     4.10   0.000     .3190806    .9042204
North Dakota  |   .4262156   .5104683     0.83   0.404    -.5746943    1.427126
North Caro..  |   .1558524   .1690878     0.92   0.357    -.1756896    .4873944
        Ohio  |   .1140552   .1584804     0.72   0.472    -.1966882    .4247986
    Oklahoma  |   .2478867   .2006058     1.24   0.217    -.1454547    .6412281
      Oregon  |   .0528441   .2235894     0.24   0.813    -.3855629    .4912512
Pennsylvania  |   .2293941   .1489836     1.54   0.124    -.0627282    .5215165
Rhode Island  |   .3327041   .4072923     0.82   0.414    -.4659016     1.13131
South Dakota  |   .1877897   .4219652     0.45   0.656    -.6395863    1.015166
South Caro..  |   .2452532   .1742163     1.41   0.159    -.0963445    .5868509
   Tennessee  |   .1737163   .1854386     0.94   0.349    -.1898858    .5373184
       Texas  |   .0055749   .1451542     0.04   0.969     -.279039    .2901887
        Utah  |   .0744367   .2288999     0.33   0.745     -.374383    .5232564
     Vermont  |  -.5433473   .2719771    -2.00   0.046    -1.076631   -.0100632
    Virginia  |   .2144918    .179357     1.20   0.232    -.1371857    .5661692
  Washington  |   .0800388   .2025277     0.40   0.693    -.3170711    .4771487
West Virgi..  |   .5788278   .2465009     2.35   0.019     .0954967    1.062159
   Wisconsin  |   .0734072   .1750085     0.42   0.675    -.2697439    .4165584
     Wyoming  |  -.1490626   .3659534    -0.41   0.684    -.8666125    .5684873
              |
        _cons |  -.7038446   .1240284    -5.67   0.000    -.9470355   -.4606537
-------------------------------------------------------------------------------

. est store col5

. reg zgov_reduce_inequality_agree zprior_national_over_global highinc higheduc 
> female retirement_age high_confirmed child alone urban i.State_Recoded [pw=Wei
> ghtvar]  if republican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =       9.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1254
                                                Root MSE          =     1.0093

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.1479834   .0231977    -6.38   0.000    -.1934687   -.1024981
      highinc |  -.2120185   .0429438    -4.94   0.000    -.2962215   -.1278156
     higheduc |  -.1837696   .0438106    -4.19   0.000    -.2696722    -.097867
       female |  -.0914798   .0403894    -2.26   0.024    -.1706742   -.0122854
retirement~ge |  -.3569423   .0480978    -7.42   0.000    -.4512511   -.2626335
high_confir~d |   .0595691   .1702069     0.35   0.726    -.2741676    .3933057
        child |   .3219291   .0512943     6.28   0.000     .2213529    .4225054
        alone |   .0283708   .0538225     0.53   0.598    -.0771627    .1339043
        urban |   .0962949   .0450705     2.14   0.033      .007922    .1846679
              |
State_Recoded |
      Alaska  |   .5013408   .4372003     1.15   0.252    -.3559084     1.35859
     Arizona  |   .0567301   .1573273     0.36   0.718    -.2517526    .3652128
    Arkansas  |   .0618873   .2483788     0.25   0.803    -.4251265    .5489011
  California  |   .3623877   .1406881     2.58   0.010     .0865307    .6382447
    Colorado  |  -.0408378   .2061613    -0.20   0.843    -.4450728    .3633972
 Connecticut  |   .1491301   .2384571     0.63   0.532    -.3184295    .6166897
    Delaware  |  -.4076157   .3107096    -1.31   0.190    -1.016846    .2016144
District o..  |  -.2395642   .4266994    -0.56   0.575    -1.076224    .5970953
     Florida  |   .1036282   .1465124     0.71   0.479     -.183649    .3909054
     Georgia  |  -.1038776   .1663606    -0.62   0.532    -.4300726    .2223173
      Hawaii  |   1.196046   .2481042     4.82   0.000     .7095705    1.682521
       Idaho  |   .0803944   .2559477     0.31   0.753    -.4214602    .5822491
    Illinois  |   .0312888     .15731     0.20   0.842    -.2771599    .3397375
     Indiana  |   -.128311   .1722457    -0.74   0.456    -.4660453    .2094232
        Iowa  |  -.2322772   .2085049    -1.11   0.265    -.6411073    .1765529
      Kansas  |   .1204786   .2144337     0.56   0.574    -.2999766    .5409338
    Kentucky  |  -.0477694   .1845563    -0.26   0.796    -.4096419    .3141031
   Louisiana  |   .2795866   .2289702     1.22   0.222    -.1693713    .7285446
       Maine  |   .6951208    .257151     2.70   0.007     .1909068    1.199335
    Maryland  |   .1195489   .2225047     0.54   0.591    -.3167317    .5558295
Massachuse~s  |   .3489974    .211937     1.65   0.100    -.0665623    .7645571
    Michigan  |  -.1075291   .1676502    -0.64   0.521    -.4362525    .2211944
   Minnesota  |   .5090465    .213892     2.38   0.017     .0896536    .9284395
 Mississippi  |   .1781641   .2076142     0.86   0.391    -.2289195    .5852478
    Missouri  |   .0648721   .1635739     0.40   0.692    -.2558587    .3856029
     Montana  |  -.7080037   .1910232    -3.71   0.000    -1.082556   -.3334512
    Nebraska  |   .4882574   .2660422     1.84   0.067    -.0333902    1.009905
      Nevada  |   .4304927   .2420543     1.78   0.075    -.0441201    .9051055
New Hampsh..  |  -.0798906   .2539447    -0.31   0.753    -.5778177    .4180365
  New Jersey  |   .2092579   .1664145     1.26   0.209    -.1170427    .5355584
  New Mexico  |   .1834147   .2101969     0.87   0.383    -.2287331    .5955625
    New York  |   .5309743   .1470813     3.61   0.000     .2425817    .8193669
North Dakota  |   .4342006   .4770663     0.91   0.363    -.5012168    1.369618
North Caro..  |   .1732035    .167264     1.04   0.301    -.1547628    .5011697
        Ohio  |   .0713539   .1532972     0.47   0.642    -.2292266    .3719344
    Oklahoma  |   .1423339   .1862471     0.76   0.445    -.2228538    .5075216
      Oregon  |   .0271745   .2008948     0.14   0.892    -.3667341     .421083
Pennsylvania  |   .1892583   .1470379     1.29   0.198    -.0990492    .4775657
Rhode Island  |   .1996729   .3518035     0.57   0.570    -.4901329    .8894788
South Dakota  |   .1628107   .3796724     0.43   0.668    -.5816396    .9072611
South Caro..  |   .2220696   .1731414     1.28   0.200    -.1174209    .5615601
   Tennessee  |    .150165   .1794859     0.84   0.403    -.2017656    .5020956
       Texas  |  -.0232582   .1372599    -0.17   0.865    -.2923933    .2458769
        Utah  |  -.0496838   .2315815    -0.21   0.830    -.5037618    .4043942
     Vermont  |  -.4719673   .1880476    -2.51   0.012    -.8406853   -.1032492
    Virginia  |   .2095844   .1712648     1.22   0.221    -.1262266    .5453954
  Washington  |   .0434828   .1921015     0.23   0.821    -.3331841    .4201497
West Virgi..  |   .4907377   .2251203     2.18   0.029     .0493284    .9321469
   Wisconsin  |          0  (omitted)
     Wyoming  |  -.2528721   .3598661    -0.70   0.482    -.9584867    .4527426
              |
        _cons |  -.5643162   .1249037    -4.52   0.000    -.8092237   -.3194087
-------------------------------------------------------------------------------

. est store col6

. 
. reg zgov_reduce_inequality_agree zluck_unfair_agree [pw=Weightvar] if republic
> an==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =     302.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1041
                                                Root MSE          =     1.0118

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .3267154   .0187848    17.39   0.000      .289883    .3635479
        _cons |  -.5286631   .0205496   -25.73   0.000    -.5689559   -.4883703
-------------------------------------------------------------------------------

. est store col7

. reg zgov_reduce_inequality_agree zluck_unfair_agree i.State_Recoded [pw=Weight
> var]  if republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =      10.14
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1362
                                                Root MSE          =     1.0019

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .3144978   .0186707    16.84   0.000     .2778888    .3511068
              |
State_Recoded |
      Alaska  |   .7184568   .5308336     1.35   0.176    -.3223849    1.759298
     Arizona  |   .0843201   .1760021     0.48   0.632    -.2607793    .4294195
    Arkansas  |   .2232052   .2401519     0.93   0.353     -.247677    .6940874
  California  |   .3952646   .1460504     2.71   0.007     .1088936    .6816356
    Colorado  |   .0721619   .2025223     0.36   0.722    -.3249375    .4692612
 Connecticut  |   .0998022   .2498622     0.40   0.690    -.3901196    .5897241
    Delaware  |  -.1593048   .3576368    -0.45   0.656    -.8605476     .541938
District o..  |   .0408335   .3398847     0.12   0.904    -.6256015    .7072686
     Florida  |   .1816661   .1437615     1.26   0.206    -.1002168     .463549
     Georgia  |  -.0054764   .1708782    -0.03   0.974     -.340529    .3295762
      Hawaii  |   1.137713   .2521215     4.51   0.000     .6433608    1.632064
       Idaho  |   .2160553   .2566705     0.84   0.400    -.2872161    .7193267
    Illinois  |   .1505903   .1600289     0.94   0.347    -.1631893    .4643699
     Indiana  |  -.0061112    .170129    -0.04   0.971    -.3396948    .3274724
        Iowa  |   -.207877   .2126743    -0.98   0.328    -.6248819     .209128
      Kansas  |   .1012342   .2058416     0.49   0.623    -.3023735    .5048419
    Kentucky  |  -.1664949   .1991065    -0.84   0.403    -.5568966    .2239068
   Louisiana  |   .4527032   .2283534     1.98   0.048     .0049551    .9004512
       Maine  |   .6780276    .233309     2.91   0.004     .2205627    1.135492
    Maryland  |   .0307185   .2134319     0.14   0.886    -.3877721     .449209
Massachuse~s  |   .3512565   .2158039     1.63   0.104     -.071885    .7743979
    Michigan  |  -.0646311   .1733352    -0.37   0.709    -.4045012     .275239
   Minnesota  |   .4414783   .2139714     2.06   0.039       .02193    .8610265
 Mississippi  |   .1681342   .2159685     0.78   0.436      -.25533    .5915984
    Missouri  |    .095717   .1723045     0.56   0.579    -.2421322    .4335661
     Montana  |  -.5854864   .2014126    -2.91   0.004    -.9804098   -.1905629
    Nebraska  |   .4373795   .2877515     1.52   0.129    -.1268345    1.001593
      Nevada  |    .507678   .2266975     2.24   0.025     .0631768    .9521792
New Hampsh..  |  -.0112163   .2606439    -0.04   0.966    -.5222787     .499846
  New Jersey  |   .2659799   .1596124     1.67   0.096     -.046983    .5789429
  New Mexico  |   .2368209   .2304185     1.03   0.304    -.2149763     .688618
    New York  |    .533901   .1491824     3.58   0.000     .2413889     .826413
North Dakota  |   .4362791   .5450005     0.80   0.423    -.6323406    1.504899
North Caro..  |   .2208198   .1672152     1.32   0.187    -.1070504      .54869
        Ohio  |    .140281   .1565216     0.90   0.370    -.1666217    .4471836
    Oklahoma  |   .2621229   .1953097     1.34   0.180     -.120834    .6450799
      Oregon  |   .0702953   .2407733     0.29   0.770    -.4018054     .542396
Pennsylvania  |   .2355566   .1495641     1.57   0.115    -.0577039    .5288172
Rhode Island  |   .3891959   .3960419     0.98   0.326    -.3873505    1.165742
South Dakota  |   .3016679   .3759571     0.80   0.422    -.4354967    1.038833
South Caro..  |   .2581415   .1699548     1.52   0.129    -.0751006    .5913835
   Tennessee  |   .1741725   .1798603     0.97   0.333    -.1784918    .5268367
       Texas  |   .0202773   .1441323     0.14   0.888    -.2623328    .3028873
        Utah  |    .097798   .2036292     0.48   0.631    -.3014716    .4970676
     Vermont  |  -.1862674   .2041739    -0.91   0.362    -.5866052    .2140704
    Virginia  |   .2277501   .1751419     1.30   0.194    -.1156625    .5711628
  Washington  |     .17333   .2047289     0.85   0.397    -.2280959     .574756
West Virgi..  |   .4868408   .2208744     2.20   0.028     .0537572    .9199243
   Wisconsin  |   .2077137    .179223     1.16   0.247     -.143701    .5591284
     Wyoming  |  -.1972133   .3415494    -0.58   0.564    -.8669126     .472486
              |
        _cons |  -.7285836   .1257264    -5.79   0.000    -.9751039   -.4820633
-------------------------------------------------------------------------------

. est store col8

. reg zgov_reduce_inequality_agree zluck_unfair_agree highinc higheduc female re
> tirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar]  
> if republican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =      14.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1862
                                                Root MSE          =      .9736

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .2840394   .0186668    15.22   0.000     .2474381    .3206407
      highinc |  -.1782701   .0418396    -4.26   0.000    -.2603079   -.0962323
     higheduc |  -.1602103    .042063    -3.81   0.000    -.2426863   -.0777344
       female |  -.1073502   .0389867    -2.75   0.006    -.1837942   -.0309063
retirement~ge |  -.3551607   .0470769    -7.54   0.000    -.4474678   -.2628537
high_confir~d |   .1799119   .1744652     1.03   0.303    -.1621742     .521998
        child |   .2684736    .048927     5.49   0.000      .172539    .3644083
        alone |    .018469   .0518161     0.36   0.722    -.0831304    .1200684
        urban |   .0849283   .0434284     1.96   0.051    -.0002248    .1700814
              |
State_Recoded |
      Alaska  |   .6650517   .4845036     1.37   0.170    -.2849486    1.615052
     Arizona  |   .1168893   .1656074     0.71   0.480    -.2078287    .4416073
    Arkansas  |   .1922951   .2317598     0.83   0.407    -.2621325    .6467228
  California  |    .384885   .1425255     2.70   0.007     .1054251    .6643448
    Colorado  |  -.1227864   .2040858    -0.60   0.547    -.5229517    .2773789
 Connecticut  |  -.0384117   .2471934    -0.16   0.877    -.5231012    .4462777
    Delaware  |   -.282495   .3058584    -0.92   0.356     -.882213    .3172229
District o..  |  -.1049391   .3748534    -0.28   0.780    -.8399405    .6300623
     Florida  |   .0094089   .1439606     0.07   0.948    -.2728648    .2916826
     Georgia  |  -.2017039   .1710149    -1.18   0.238    -.5370248    .1336171
      Hawaii  |   1.129017   .2660992     4.24   0.000     .6072581    1.650777
       Idaho  |   .1361967   .2601879     0.52   0.601     -.373972    .6463654
    Illinois  |  -.0470635    .155599    -0.30   0.762    -.3521573    .2580303
     Indiana  |  -.1989826    .164192    -1.21   0.226    -.5209254    .1229602
        Iowa  |  -.1545989   .2026416    -0.76   0.446    -.5519324    .2427347
      Kansas  |   .1768616   .2047036     0.86   0.388     -.224515    .5782382
    Kentucky  |  -.1086874   .1841766    -0.59   0.555    -.4698154    .2524406
   Louisiana  |    .210039   .2332328     0.90   0.368    -.2472769    .6673548
       Maine  |   .6484977   .2576575     2.52   0.012     .1432905    1.153705
    Maryland  |  -.0897835   .2182994    -0.41   0.681    -.5178185    .3382515
Massachuse~s  |    .152734   .2033935     0.75   0.453    -.2460738    .5515419
    Michigan  |  -.2273678   .1690824    -1.34   0.179    -.5588995    .1041639
   Minnesota  |   .5205012   .2076666     2.51   0.012     .1133147    .9276876
 Mississippi  |   -.030772   .2091229    -0.15   0.883    -.4408139    .3792698
    Missouri  |   .1104252   .1640786     0.67   0.501    -.2112952    .4321456
     Montana  |  -.6449073   .1985941    -3.25   0.001    -1.034305     -.25551
    Nebraska  |   .5674054    .269787     2.10   0.036     .0384151    1.096396
      Nevada  |   .3363054   .2397963     1.40   0.161      -.13388    .8064908
New Hampsh..  |  -.0041121   .2625515    -0.02   0.988    -.5189152     .510691
  New Jersey  |   .0723554   .1593621     0.45   0.650     -.240117    .3848278
  New Mexico  |   .2138609   .2153876     0.99   0.321    -.2084647    .6361865
    New York  |   .3338684   .1476473     2.26   0.024     .0443659    .6233709
North Dakota  |   .4319173   .5114025     0.84   0.398    -.5708254     1.43466
North Caro..  |   .2257022   .1671587     1.35   0.177    -.1020575     .553462
        Ohio  |   .0953932   .1526484     0.62   0.532    -.2039152    .3947015
    Oklahoma  |    .168029   .1843498     0.91   0.362    -.1934386    .5294967
      Oregon  |   .0426231   .2130288     0.20   0.841    -.3750774    .4603236
Pennsylvania  |   .0704416   .1474695     0.48   0.633    -.2187122    .3595953
Rhode Island  |   .1406402   .3553726     0.40   0.692    -.5561637    .8374441
South Dakota  |   .2599591   .3421614     0.76   0.447    -.4109409     .930859
South Caro..  |   .2394938   .1704533     1.41   0.160     -.094726    .5737135
   Tennessee  |   .0297416   .1746673     0.17   0.865    -.3127408     .372224
       Texas  |  -.0102676   .1387524    -0.07   0.941    -.2823291    .2617939
        Utah  |  -.1388257    .210605    -0.66   0.510    -.5517737    .2741222
     Vermont  |  -.2919971   .1521707    -1.92   0.055    -.5903689    .0063746
    Virginia  |   .2203681   .1699477     1.30   0.195    -.1128602    .5535964
  Washington  |   .0057108   .1943487     0.03   0.977    -.3753623    .3867839
West Virgi..  |   .4096467   .2095583     1.95   0.051     -.001249    .8205425
   Wisconsin  |          0  (omitted)
     Wyoming  |   -.276206   .3463844    -0.80   0.425    -.9553863    .4029742
              |
        _cons |  -.5723163   .1274573    -4.49   0.000    -.8222308   -.3224019
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrredistrre
> p.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree highi
> nc higheduc female retirement_age high_confirmed child alone urban _cons) ///
> label mtitle("Redistribution (std.)" "Redistribution (std.)" "Redistribution (
> std.)" "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)"
>  "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)") ///
> b(3)
(output written to tables/corrredistrrep.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, REDISTRIBUTION/MORAL VIEWS, non-republicans, Table S9
. *************************************************************************
. reg zgov_reduce_inequality_agree zprior_soc_over_self [pw=Weightvar] if republ
> ican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =      11.00
                                                Prob > F          =     0.0009
                                                R-squared         =     0.0035
                                                Root MSE          =     .76886

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0464341    .014001     3.32   0.001     .0189847    .0738834
        _cons |   .3610089    .013245    27.26   0.000     .3350417    .3869761
-------------------------------------------------------------------------------

. est store col1

. reg zgov_reduce_inequality_agree zprior_soc_over_self i.State_Recoded [pw=Weig
> htvar]  if republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       1.33
                                                Prob > F          =     0.0595
                                                R-squared         =     0.0137
                                                Root MSE          =     .76948

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |    .045983   .0140912     3.26   0.001     .0183567    .0736093
              |
State_Recoded |
      Alaska  |  -.1210515   .3877823    -0.31   0.755    -.8813108    .6392077
     Arizona  |    .080887   .1653998     0.49   0.625    -.2433844    .4051583
    Arkansas  |   .0949498   .1865124     0.51   0.611    -.2707136    .4606132
  California  |   .0539312   .1334193     0.40   0.686    -.2076416     .315504
    Colorado  |  -.1107778   .1636628    -0.68   0.499    -.4316438    .2100883
 Connecticut  |   .0267904   .1672122     0.16   0.873    -.3010344    .3546151
    Delaware  |  -.1796952   .3139142    -0.57   0.567    -.7951338    .4357433
District o..  |   .2573227   .2264216     1.14   0.256    -.1865839    .7012292
     Florida  |   .0153453   .1386672     0.11   0.912    -.2565161    .2872066
     Georgia  |  -.0529126   .1622592    -0.33   0.744    -.3710269    .2652016
      Hawaii  |  -.0565577   .2183517    -0.26   0.796     -.484643    .3715276
       Idaho  |  -.0300278    .261256    -0.11   0.909    -.5422284    .4821727
    Illinois  |    .110441   .1381244     0.80   0.424    -.1603563    .3812382
     Indiana  |   .0797154   .1622493     0.49   0.623    -.2383793    .3978101
        Iowa  |   .0063465   .1799365     0.04   0.972    -.3464246    .3591176
      Kansas  |  -.0371567   .3023994    -0.12   0.902      -.63002    .5557067
    Kentucky  |  -.0153515   .1770514    -0.09   0.931    -.3624663    .3317634
   Louisiana  |  -.0422491   .2114939    -0.20   0.842    -.4568896    .3723913
       Maine  |   .3915454   .1485063     2.64   0.008     .1003941    .6826967
    Maryland  |   .0083035   .1563322     0.05   0.958    -.2981906    .3147976
Massachuse~s  |  -.1097157   .1589518    -0.69   0.490    -.4213455    .2019142
    Michigan  |   .0338407   .1432232     0.24   0.813    -.2469527    .3146342
   Minnesota  |   .0015048   .1611792     0.01   0.993     -.314492    .3175016
 Mississippi  |   .0858504   .2504915     0.34   0.732    -.4052461    .5769468
    Missouri  |   .1829242   .1486152     1.23   0.218    -.1084406     .474289
     Montana  |  -.2253847   .2569605    -0.88   0.380    -.7291637    .2783943
    Nebraska  |  -.1005179   .2494139    -0.40   0.687    -.5895017    .3884658
      Nevada  |  -.1025101   .1831377    -0.56   0.576    -.4615573    .2565372
New Hampsh..  |   .0389543   .1988615     0.20   0.845    -.3509198    .4288283
  New Jersey  |  -.0338506   .1520281    -0.22   0.824    -.3319064    .2642052
  New Mexico  |   .1632931   .1923769     0.85   0.396    -.2138679    .5404541
    New York  |   .0993552    .135303     0.73   0.463    -.1659105    .3646209
North Dakota  |  -.6078975   .5347412    -1.14   0.256    -1.656274    .4404792
North Caro..  |   .0927095   .1449509     0.64   0.522    -.1914712    .3768902
        Ohio  |   .0019812   .1493418     0.01   0.989    -.2908079    .2947704
    Oklahoma  |   -.002321   .1931005    -0.01   0.990    -.3809005    .3762586
      Oregon  |   .0749474   .1611289     0.47   0.642    -.2409509    .3908457
Pennsylvania  |   .0752686    .139133     0.54   0.589     -.197506    .3480432
Rhode Island  |   .1362806   .2114144     0.64   0.519    -.2782038    .5507651
South Dakota  |   .0631182   .2967737     0.21   0.832    -.5187158    .6449522
South Caro..  |   .0016501   .1795917     0.01   0.993     -.350445    .3537452
   Tennessee  |  -.0083135   .1648909    -0.05   0.960    -.3315871    .3149602
       Texas  |   .1131428    .136149     0.83   0.406    -.1537816    .3800672
        Utah  |  -.2152262   .2371105    -0.91   0.364    -.6800887    .2496363
     Vermont  |   .0184108   .3373254     0.05   0.956    -.6429262    .6797478
    Virginia  |   .1616281   .1435542     1.13   0.260    -.1198144    .4430705
  Washington  |  -.0138299   .1520609    -0.09   0.928    -.3119501    .2842904
West Virgi..  |  -.0570475   .1976122    -0.29   0.773    -.4444724    .3303774
   Wisconsin  |   .1315294   .1422713     0.92   0.355     -.147398    .4104567
     Wyoming  |   .0939853   .2831298     0.33   0.740    -.4610995    .6490701
              |
        _cons |    .316944   .1282224     2.47   0.013       .06556    .5683281
-------------------------------------------------------------------------------

. est store col2

. reg zgov_reduce_inequality_agree zprior_soc_over_self highinc higheduc female 
> retirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar]
>   if republican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       1.32
                                                Prob > F          =     0.0511
                                                R-squared         =     0.0167
                                                Root MSE          =     .76896

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0433388   .0141593     3.06   0.002      .015579    .0710985
      highinc |  -.0507352   .0302472    -1.68   0.094    -.1100359    .0085655
     higheduc |   .0308249   .0286024     1.08   0.281    -.0252511    .0869008
       female |   .0428344    .026336     1.63   0.104    -.0087982     .094467
retirement~ge |  -.0517568   .0377561    -1.37   0.171    -.1257788    .0222653
high_confir~d |   .1310459   .1410849     0.93   0.353    -.1455556    .4076474
        child |  -.0494469   .0322806    -1.53   0.126     -.112734    .0138403
        alone |  -.0511208   .0333828    -1.53   0.126    -.1165688    .0143273
        urban |   .0062593   .0331531     0.19   0.850    -.0587384    .0712571
              |
State_Recoded |
      Alaska  |  -.1132267   .3830133    -0.30   0.768    -.8641367    .6376832
     Arizona  |   .0850508   .1644924     0.52   0.605    -.2374418    .4075435
    Arkansas  |   .0828606   .1848185     0.45   0.654     -.279482    .4452033
  California  |   .0581168   .1326944     0.44   0.661    -.2020348    .3182683
    Colorado  |  -.2427705    .118505    -2.05   0.041    -.4751034   -.0104376
 Connecticut  |  -.0961975   .1232921    -0.78   0.435    -.3379157    .1455207
    Delaware  |  -.2975551    .293797    -1.01   0.311    -.8735536    .2784434
District o..  |   .1305622   .1956405     0.67   0.505    -.2529973    .5141216
     Florida  |  -.1132635   .0814312    -1.39   0.164     -.272912    .0463849
     Georgia  |  -.1824712   .1172427    -1.56   0.120    -.4123294     .047387
      Hawaii  |   -.055549   .2162766    -0.26   0.797    -.4795662    .3684682
       Idaho  |  -.0467499   .2616314    -0.18   0.858    -.5596866    .4661869
    Illinois  |  -.0093097   .0804824    -0.12   0.908     -.167098    .1484786
     Indiana  |  -.0402117   .1172741    -0.34   0.732    -.2701313    .1897079
        Iowa  |   .0141669   .1784482     0.08   0.937    -.3356865    .3640202
      Kansas  |  -.0262029   .2972223    -0.09   0.930    -.6089168     .556511
    Kentucky  |  -.0097563   .1740072    -0.06   0.955    -.3509031    .3313904
   Louisiana  |   -.183408   .1807079    -1.01   0.310    -.5376917    .1708756
       Maine  |   .3698951   .1484082     2.49   0.013     .0789361    .6608541
    Maryland  |  -.1144857   .1085682    -1.05   0.292    -.3273372    .0983658
Massachuse~s  |  -.2413567   .1122683    -2.15   0.032    -.4614623   -.0212511
    Michigan  |  -.0874361    .089188    -0.98   0.327     -.262292    .0874197
   Minnesota  |   .0106115   .1609553     0.07   0.947    -.3049464    .3261695
 Mississippi  |  -.0401694   .2224448    -0.18   0.857    -.4762797    .3959408
    Missouri  |   .1847252   .1481256     1.25   0.212    -.1056798    .4751303
     Montana  |  -.2296295   .2576946    -0.89   0.373     -.734848     .275589
    Nebraska  |  -.0874925   .2455258    -0.36   0.722    -.5688537    .3938687
      Nevada  |  -.2430722   .1469374    -1.65   0.098    -.5311476    .0450032
New Hampsh..  |   .0419974   .2001078     0.21   0.834    -.3503204    .4343153
  New Jersey  |  -.1561842    .101956    -1.53   0.126    -.3560722    .0437037
  New Mexico  |   .1643174   .1908878     0.86   0.389    -.2099243    .5385591
    New York  |  -.0244092   .0757521    -0.32   0.747    -.1729236    .1241051
North Dakota  |  -.6132962   .5311286    -1.15   0.248    -1.654591    .4279984
North Caro..  |   .0958046   .1439201     0.67   0.506    -.1863554    .3779646
        Ohio  |   .0056632   .1481116     0.04   0.970    -.2847143    .2960407
    Oklahoma  |   -.006166   .1930877    -0.03   0.975    -.3847207    .3723887
      Oregon  |    .074702   .1596196     0.47   0.640    -.2382373    .3876414
Pennsylvania  |  -.0539987    .082336    -0.66   0.512    -.2154211    .1074237
Rhode Island  |   .0155944    .177044     0.09   0.930    -.3315061    .3626949
South Dakota  |   .0576422     .30664     0.19   0.851    -.5435354    .6588198
South Caro..  |  -.0103638   .1787078    -0.06   0.954    -.3607262    .3399986
   Tennessee  |  -.1333139   .1209253    -1.10   0.270    -.3703918    .1037641
       Texas  |   .1123554   .1353812     0.83   0.407    -.1530639    .3777747
        Utah  |  -.3545737   .2122241    -1.67   0.095    -.7706458    .0614984
     Vermont  |  -.0881386    .314768    -0.28   0.779    -.7052514    .5289742
    Virginia  |   .1707117   .1429325     1.19   0.232    -.1095121    .4509355
  Washington  |  -.1435052   .1026525    -1.40   0.162    -.3447586    .0577483
West Virgi..  |  -.0543467   .1974259    -0.28   0.783    -.4414066    .3327131
   Wisconsin  |          0  (omitted)
     Wyoming  |    .088983   .2769582     0.32   0.748    -.4540025    .6319685
              |
        _cons |   .3263044   .1288074     2.53   0.011     .0737733    .5788354
-------------------------------------------------------------------------------

. est store col3

. 
. reg zgov_reduce_inequality_agree zprior_national_over_global [pw=Weightvar]  i
> f republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =      10.14
                                                Prob > F          =     0.0015
                                                R-squared         =     0.0034
                                                Root MSE          =     .76891

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0455222   .0142931    -3.18   0.001    -.0735443   -.0175002
        _cons |   .3570039   .0135633    26.32   0.000     .3304127    .3835951
-------------------------------------------------------------------------------

. est store col4

. reg zgov_reduce_inequality_agree zprior_national_over_global i.State_Recoded [
> pw=Weightvar]  if republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       1.27
                                                Prob > F          =     0.0939
                                                R-squared         =     0.0135
                                                Root MSE          =     .76958

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0440701   .0142483    -3.09   0.002    -.0720043   -.0161359
              |
State_Recoded |
      Alaska  |  -.1358414   .3855791    -0.35   0.725    -.8917811    .6200984
     Arizona  |   .0771922   .1638047     0.47   0.637    -.2439521    .3983365
    Arkansas  |   .1066976   .1856068     0.57   0.565    -.2571903    .4705856
  California  |   .0525328   .1312153     0.40   0.689    -.2047189    .3097844
    Colorado  |  -.1072092   .1621457    -0.66   0.509    -.4251009    .2106825
 Connecticut  |   .0232331     .16492     0.14   0.888    -.3000977     .346564
    Delaware  |  -.1724089   .3162644    -0.55   0.586     -.792455    .4476372
District o..  |    .235803    .226922     1.04   0.299    -.2090846    .6806906
     Florida  |   .0188075   .1365338     0.14   0.890    -.2488713    .2864863
     Georgia  |  -.0529956   .1597451    -0.33   0.740    -.3661808    .2601897
      Hawaii  |  -.0562047   .2139182    -0.26   0.793    -.4755979    .3631885
       Idaho  |  -.0361963   .2614395    -0.14   0.890    -.5487565    .4763639
    Illinois  |   .1152588   .1359455     0.85   0.397    -.1512665    .3817841
     Indiana  |   .0960257   .1597875     0.60   0.548    -.2172426     .409294
        Iowa  |   .0085325   .1783002     0.05   0.962    -.3410307    .3580957
      Kansas  |  -.0411853   .2965645    -0.14   0.890    -.6226092    .5402387
    Kentucky  |   .0006139   .1764461     0.00   0.997    -.3453142     .346542
   Louisiana  |  -.0510067    .214729    -0.24   0.812    -.4719897    .3699762
       Maine  |   .3934129   .1462668     2.69   0.007     .1066522    .6801735
    Maryland  |   .0056115   .1542174     0.04   0.971    -.2967366    .3079595
Massachuse~s  |  -.1102891    .157124    -0.70   0.483    -.4183356    .1977574
    Michigan  |    .036943   .1413867     0.26   0.794      -.24025     .314136
   Minnesota  |   .0105254    .159708     0.07   0.947    -.3025871     .323638
 Mississippi  |   .0441629   .2420706     0.18   0.855    -.4304241    .5187498
    Missouri  |    .184492    .146047     1.26   0.207    -.1018378    .4708217
     Montana  |  -.1968964   .2550808    -0.77   0.440    -.6969903    .3031974
    Nebraska  |  -.0982189   .2478103    -0.40   0.692    -.5840588     .387621
      Nevada  |  -.0963622   .1800839    -0.54   0.593    -.4494222    .2566979
New Hampsh..  |   .0506921   .1963819     0.26   0.796    -.3343206    .4357049
  New Jersey  |   -.035849   .1503347    -0.24   0.812    -.3305849    .2588869
  New Mexico  |   .1621379   .1912362     0.85   0.397    -.2127866    .5370624
    New York  |   .0990072   .1332966     0.74   0.458    -.1623248    .3603393
North Dakota  |  -.5860644   .5474143    -1.07   0.284    -1.659287    .4871585
North Caro..  |   .0962995   .1429074     0.67   0.500    -.1838749     .376474
        Ohio  |   .0084713   .1474117     0.06   0.954    -.2805339    .2974765
    Oklahoma  |  -.0013798   .1933452    -0.01   0.994    -.3804391    .3776795
      Oregon  |   .0863063   .1587261     0.54   0.587    -.2248811    .3974936
Pennsylvania  |   .0783401   .1371805     0.57   0.568    -.1906066    .3472868
Rhode Island  |   .1465183   .2102668     0.70   0.486    -.2657162    .5587528
South Dakota  |     .07069   .2982534     0.24   0.813    -.5140451     .655425
South Caro..  |  -.0112147   .1765254    -0.06   0.949    -.3572984    .3348689
   Tennessee  |  -.0072955   .1646071    -0.04   0.965    -.3300128    .3154217
       Texas  |   .1111215    .134057     0.83   0.407    -.1517014    .3739445
        Utah  |   -.220483   .2316167    -0.95   0.341    -.6745747    .2336086
     Vermont  |   .0439819   .3281803     0.13   0.893    -.5994257    .6873895
    Virginia  |   .1630397   .1418869     1.15   0.251     -.115134    .4412134
  Washington  |  -.0090283   .1501579    -0.06   0.952    -.3034175    .2853609
West Virgi..  |  -.0391952   .1954298    -0.20   0.841    -.4223415    .3439511
   Wisconsin  |   .1380325   .1401606     0.98   0.325    -.1367568    .4128219
     Wyoming  |   .0885962   .2741806     0.32   0.747    -.4489434    .6261357
              |
        _cons |   .3114818   .1262283     2.47   0.014     .0640073    .5589563
-------------------------------------------------------------------------------

. est store col5

. reg zgov_reduce_inequality_agree zprior_national_over_global highinc higheduc 
> female retirement_age high_confirmed child alone urban i.State_Recoded [pw=Wei
> ghtvar]  if republican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       1.29
                                                Prob > F          =     0.0675
                                                R-squared         =     0.0168
                                                Root MSE          =     .76894

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0434832   .0142411    -3.05   0.002    -.0714033   -.0155631
      highinc |  -.0481196   .0301705    -1.59   0.111    -.1072698    .0110306
     higheduc |   .0313663   .0284006     1.10   0.269    -.0243139    .0870466
       female |    .050978   .0262874     1.94   0.053    -.0005593    .1025154
retirement~ge |  -.0481398   .0378582    -1.27   0.204     -.122362    .0260824
high_confir~d |   .1368264   .1389666     0.98   0.325     -.135622    .4092748
        child |  -.0535413   .0324711    -1.65   0.099    -.1172019    .0101192
        alone |  -.0530553   .0333286    -1.59   0.111    -.1183972    .0122866
        urban |   .0070066   .0332152     0.21   0.833    -.0581128     .072126
              |
State_Recoded |
      Alaska  |  -.1236893   .3803451    -0.33   0.745    -.8693682    .6219895
     Arizona  |   .0815406     .16284     0.50   0.617    -.2377124    .4007936
    Arkansas  |   .0943285   .1838525     0.51   0.608    -.2661202    .4547771
  California  |   .0569006   .1304316     0.44   0.663    -.1988148     .312616
    Colorado  |  -.2451667   .1188592    -2.06   0.039     -.478194   -.0121394
 Connecticut  |  -.1064186   .1222963    -0.87   0.384    -.3461844    .1333471
    Delaware  |    -.29593   .2972656    -1.00   0.320    -.8787288    .2868688
District o..  |   .1027994   .1974312     0.52   0.603    -.2842707    .4898696
     Florida  |  -.1153789   .0811098    -1.42   0.155    -.2743972    .0436395
     Georgia  |  -.1872452   .1164483    -1.61   0.108    -.4155459    .0410554
      Hawaii  |  -.0569758   .2116363    -0.27   0.788    -.4718954    .3579439
       Idaho  |   -.055598   .2617082    -0.21   0.832    -.5686852    .4574893
    Illinois  |  -.0100281   .0801755    -0.13   0.900    -.1672147    .1471586
     Indiana  |  -.0293083   .1161304    -0.25   0.801    -.2569857    .1983691
        Iowa  |   .0163188   .1767628     0.09   0.926    -.3302304     .362868
      Kansas  |  -.0309219   .2909353    -0.11   0.915    -.6013099    .5394661
    Kentucky  |   .0071864   .1733275     0.04   0.967    -.3326277    .3470005
   Louisiana  |  -.1956668   .1859839    -1.05   0.293    -.5602942    .1689605
       Maine  |   .3719173   .1462208     2.54   0.011     .0852467    .6585879
    Maryland  |  -.1226386   .1081605    -1.13   0.257    -.3346907    .0894136
Massachuse~s  |  -.2476704   .1121761    -2.21   0.027    -.4675952   -.0277455
    Michigan  |  -.0901435   .0893673    -1.01   0.313    -.2653509    .0850638
   Minnesota  |   .0189426   .1594717     0.12   0.905    -.2937068    .3315921
 Mississippi  |   -.085233   .2159864    -0.39   0.693    -.5086813    .3382154
    Missouri  |   .1872148   .1455159     1.29   0.198    -.0980737    .4725034
     Montana  |  -.2025567   .2564455    -0.79   0.430    -.7053263    .3002128
    Nebraska  |  -.0846523   .2436569    -0.35   0.728    -.5623494    .3930448
      Nevada  |  -.2430371   .1449176    -1.68   0.094    -.5271527    .0410784
New Hampsh..  |   .0529224   .1977837     0.27   0.789    -.3348388    .4406837
  New Jersey  |  -.1636607   .1020569    -1.60   0.109    -.3637465    .0364251
  New Mexico  |   .1603246   .1899023     0.84   0.399    -.2119851    .5326342
    New York  |  -.0301944   .0759673    -0.40   0.691    -.1791307    .1187418
North Dakota  |  -.5892653   .5438339    -1.08   0.279    -1.655469    .4769385
North Caro..  |   .0994443   .1418246     0.70   0.483    -.1786073    .3774959
        Ohio  |    .011734   .1461544     0.08   0.936    -.2748065    .2982744
    Oklahoma  |  -.0033526   .1931841    -0.02   0.986    -.3820963    .3753912
      Oregon  |   .0852617   .1570803     0.54   0.587    -.2226992    .3932227
Pennsylvania  |  -.0571431   .0824257    -0.69   0.488    -.2187413    .1044551
Rhode Island  |   .0202281   .1768386     0.11   0.909    -.3264697    .3669259
South Dakota  |   .0674154   .3095736     0.22   0.828    -.5395135    .6743443
South Caro..  |  -.0224804   .1756525    -0.13   0.898    -.3668527    .3218919
   Tennessee  |  -.1377707   .1226806    -1.12   0.262    -.3782899    .1027485
       Texas  |   .1109251   .1332241     0.83   0.405     -.150265    .3721151
        Utah  |  -.3657298   .2079724    -1.76   0.079    -.7734662    .0420067
     Vermont  |  -.0677424   .3058388    -0.22   0.825    -.6673492    .5318643
    Virginia  |   .1723095   .1411944     1.22   0.222    -.1045067    .4491257
  Washington  |  -.1457618   .1025579    -1.42   0.155    -.3468298    .0553063
West Virgi..  |  -.0349044   .1953023    -0.18   0.858    -.4178008     .347992
   Wisconsin  |          0  (omitted)
     Wyoming  |   .0830827   .2676257     0.31   0.756     -.441606    .6077713
              |
        _cons |   .3150504   .1268566     2.48   0.013     .0663439    .5637568
-------------------------------------------------------------------------------

. est store col6

. 
. reg zgov_reduce_inequality_agree zluck_unfair_agree [pw=Weightvar] if republic
> an==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =     176.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0606
                                                Root MSE          =     .74652

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1994878    .015004    13.30   0.000     .1700721    .2289035
        _cons |   .3364101   .0135302    24.86   0.000     .3098837    .3629365
-------------------------------------------------------------------------------

. est store col7

. reg zgov_reduce_inequality_agree zluck_unfair_agree i.State_Recoded [pw=Weight
> var]  if republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       4.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0706
                                                Root MSE          =     .74698

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .2003742   .0150194    13.34   0.000     .1709282    .2298201
              |
State_Recoded |
      Alaska  |  -.0862252   .3687391    -0.23   0.815    -.8091496    .6366992
     Arizona  |   .0291796   .1593419     0.18   0.855    -.2832151    .3415743
    Arkansas  |   .0908282   .1805118     0.50   0.615    -.2630707    .4447272
  California  |   .0318767   .1290137     0.25   0.805    -.2210587    .2848121
    Colorado  |  -.1550107   .1635983    -0.95   0.343    -.4757502    .1657288
 Connecticut  |  -.0413294   .1662786    -0.25   0.804    -.3673239    .2846651
    Delaware  |  -.2248241   .3098044    -0.73   0.468    -.8322052    .3825571
District o..  |   .1221229   .2225795     0.55   0.583    -.3142512    .5584969
     Florida  |  -.0222865   .1343151    -0.17   0.868    -.2856155    .2410425
     Georgia  |  -.0770087   .1523842    -0.51   0.613    -.3757628    .2217453
      Hawaii  |  -.1127362   .2140811    -0.53   0.598    -.5324488    .3069764
       Idaho  |  -.0432151   .2567239    -0.17   0.866    -.5465303       .4601
    Illinois  |   .0838975   .1342191     0.63   0.532    -.1792432    .3470382
     Indiana  |   .1183557   .1567259     0.76   0.450    -.1889102    .4256216
        Iowa  |  -.0026075   .1689813    -0.02   0.988    -.3339006    .3286856
      Kansas  |  -.1739699   .2736731    -0.64   0.525    -.7105146    .3625748
    Kentucky  |   -.017824   .1725953    -0.10   0.918    -.3562025    .3205546
   Louisiana  |  -.1026398   .1992318    -0.52   0.606    -.4932399    .2879603
       Maine  |   .3243403   .1498974     2.16   0.031     .0304617    .6182189
    Maryland  |  -.0467011   .1519575    -0.31   0.759    -.3446185    .2512163
Massachuse~s  |  -.1495363   .1573252    -0.95   0.342    -.4579773    .1589046
    Michigan  |   .0136278   .1393736     0.10   0.922    -.2596186    .2868741
   Minnesota  |   .0254751   .1539455     0.17   0.869    -.2763399    .3272901
 Mississippi  |   .0354765   .2368802     0.15   0.881    -.4289345    .4998875
    Missouri  |   .1347454   .1427258     0.94   0.345     -.145073    .4145638
     Montana  |   -.154678    .244698    -0.63   0.527     -.634416    .3250601
    Nebraska  |  -.1408057   .2318002    -0.61   0.544    -.5952572    .3136457
      Nevada  |  -.0670915   .1826331    -0.37   0.713    -.4251494    .2909665
New Hampsh..  |   .0051694   .2046304     0.03   0.980    -.3960148    .4063536
  New Jersey  |  -.0504722   .1459307    -0.35   0.729     -.336574    .2356295
  New Mexico  |   .1909345   .1997529     0.96   0.339    -.2006873    .5825563
    New York  |   .0631233   .1316961     0.48   0.632    -.1950709    .3213176
North Dakota  |  -.6650064   .4745877    -1.40   0.161     -1.59545    .2654376
North Caro..  |   .0691922   .1402862     0.49   0.622    -.2058434    .3442277
        Ohio  |  -.0004609   .1448023    -0.00   0.997    -.2843503    .2834284
    Oklahoma  |   .0015699   .1849663     0.01   0.993    -.3610623    .3642021
      Oregon  |   .0198376   .1578505     0.13   0.900    -.2896332    .3293083
Pennsylvania  |   .0497076   .1344008     0.37   0.712    -.2137893    .3132046
Rhode Island  |   .0045495   .1991129     0.02   0.982    -.3858176    .3949166
South Dakota  |   .0306576   .2843761     0.11   0.914    -.5268706    .5881858
South Caro..  |  -.0283919   .1714163    -0.17   0.868     -.364459    .3076751
   Tennessee  |  -.0533244   .1604455    -0.33   0.740    -.3678829     .261234
       Texas  |   .0680857   .1326648     0.51   0.608    -.1920077    .3281792
        Utah  |  -.2531218    .224661    -1.13   0.260    -.6935767    .1873331
     Vermont  |  -.0211315   .3246366    -0.07   0.948    -.6575916    .6153285
    Virginia  |   .1207496   .1403191     0.86   0.390    -.1543505    .3958496
  Washington  |  -.0210306   .1435418    -0.15   0.884    -.3024488    .2603877
West Virgi..  |  -.1166736   .1929063    -0.60   0.545    -.4948725    .2615252
   Wisconsin  |   .1150916   .1380185     0.83   0.404     -.155498    .3856811
     Wyoming  |   .1071366    .281304     0.38   0.703    -.4443686    .6586418
              |
        _cons |    .320415   .1240724     2.58   0.010     .0771672    .5636628
-------------------------------------------------------------------------------

. est store col8

. reg zgov_reduce_inequality_agree zluck_unfair_agree highinc higheduc female re
> tirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar]  
> if republican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       4.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0727
                                                Root MSE          =     .74675

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1994734   .0149571    13.34   0.000     .1701494    .2287974
      highinc |  -.0210067   .0294936    -0.71   0.476    -.0788297    .0368164
     higheduc |   .0204618   .0278443     0.73   0.462     -.034128    .0750515
       female |   .0300608   .0254867     1.18   0.238    -.0199067    .0800283
retirement~ge |  -.0289225   .0365862    -0.79   0.429    -.1006509    .0428059
high_confir~d |   .1143507   .1364985     0.84   0.402    -.1532591    .3819605
        child |  -.0692048   .0318138    -2.18   0.030    -.1315769   -.0068327
        alone |  -.0495617   .0323223    -1.53   0.125    -.1129307    .0138073
        urban |  -.0062334   .0310848    -0.20   0.841    -.0671762    .0547094
              |
State_Recoded |
      Alaska  |  -.0892924   .3658574    -0.24   0.807    -.8065677    .6279828
     Arizona  |   .0324295   .1578122     0.21   0.837    -.2769665    .3418255
    Arkansas  |   .0808158   .1790554     0.45   0.652     -.270228    .4318597
  California  |   .0318409   .1279301     0.25   0.803    -.2189701    .2826519
    Colorado  |  -.2707144    .122088    -2.22   0.027    -.5100718   -.0313569
 Connecticut  |  -.1542082   .1251352    -1.23   0.218    -.3995398    .0911234
    Delaware  |  -.3345119    .292354    -1.14   0.253    -.9076813    .2386574
District o..  |   .0075566   .1925245     0.04   0.969    -.3698939    .3850071
     Florida  |  -.1345839   .0795653    -1.69   0.091    -.2905742    .0214065
     Georgia  |  -.1881298    .107739    -1.75   0.081    -.3993555     .023096
      Hawaii  |  -.1177453   .2122423    -0.55   0.579    -.5338532    .2983627
       Idaho  |  -.0610045   .2564943    -0.24   0.812    -.5638699    .4418609
    Illinois  |  -.0223986   .0792692    -0.28   0.778    -.1778084    .1330113
     Indiana  |   .0171906   .1138029     0.15   0.880    -.2059237    .2403049
        Iowa  |   .0056462   .1677291     0.03   0.973     -.323192    .3344844
      Kansas  |  -.1633982   .2685833    -0.61   0.543    -.6899644     .363168
    Kentucky  |  -.0121515    .170435    -0.07   0.943    -.3462948    .3219917
   Louisiana  |  -.2168092   .1676847    -1.29   0.196    -.5455605    .1119421
       Maine  |    .303059   .1496602     2.02   0.043     .0096455    .5964726
    Maryland  |  -.1554236   .1064799    -1.46   0.144     -.364181    .0533337
Massachuse~s  |  -.2661966   .1136898    -2.34   0.019    -.4890892    -.043304
    Michigan  |  -.0961551   .0881013    -1.09   0.275    -.2688805    .0765703
   Minnesota  |   .0284129   .1534008     0.19   0.853    -.2723343    .3291602
 Mississippi  |  -.0681884   .2107875    -0.32   0.746     -.481444    .3450672
    Missouri  |   .1335424    .141808     0.94   0.346    -.1444767    .4115615
     Montana  |  -.1706204   .2456819    -0.69   0.487    -.6522876    .3110469
    Nebraska  |  -.1317533   .2306006    -0.57   0.568    -.5838533    .3203466
      Nevada  |  -.1911877   .1485649    -1.29   0.198    -.4824539    .1000786
New Hampsh..  |  -.0020619   .2055096    -0.01   0.992      -.40497    .4008462
  New Jersey  |  -.1598333   .0974831    -1.64   0.101    -.3509521    .0312856
  New Mexico  |   .1841415   .1980385     0.93   0.353    -.2041193    .5724023
    New York  |  -.0455761   .0753362    -0.60   0.545    -.1932752     .102123
North Dakota  |  -.6680376   .4721189    -1.41   0.157    -1.593642    .2575667
North Caro..  |   .0727323   .1388601     0.52   0.600    -.1995073     .344972
        Ohio  |   .0000803   .1434118     0.00   1.000    -.2810831    .2812437
    Oklahoma  |   .0035433   .1837655     0.02   0.985     -.356735    .3638215
      Oregon  |   .0179868   .1558603     0.12   0.908    -.2875823     .323556
Pennsylvania  |  -.0665854    .079733    -0.84   0.404    -.2229045    .0897338
Rhode Island  |  -.1026637   .1653099    -0.62   0.535     -.426759    .2214316
South Dakota  |   .0224903   .2921013     0.08   0.939    -.5501837    .5951642
South Caro..  |  -.0382291   .1705052    -0.22   0.823      -.37251    .2960519
   Tennessee  |   -.160583   .1182958    -1.36   0.175    -.3925057    .0713398
       Texas  |   .0690714   .1315058     0.53   0.599      -.18875    .3268927
        Utah  |  -.3754554   .2002131    -1.88   0.061    -.7679797    .0170689
     Vermont  |  -.1313966   .3036486    -0.43   0.665    -.7267094    .4639162
    Virginia  |   .1275062    .139386     0.91   0.360    -.1457644    .4007769
  Washington  |  -.1383142   .0943296    -1.47   0.143    -.3232503    .0466219
West Virgi..  |  -.1157533   .1916614    -0.60   0.546    -.4915116    .2600049
   Wisconsin  |          0  (omitted)
     Wyoming  |   .1118975   .2771766     0.40   0.686    -.4315161    .6553112
              |
        _cons |   .3409285   .1246903     2.73   0.006     .0964691    .5853879
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrredistrno
> nrep.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree highi
> nc higheduc female retirement_age high_confirmed child alone urban _cons) ///
> label mtitle("Redistribution (std.)" "Redistribution (std.)" "Redistribution (
> std.)" "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)"
>  "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)") ///
> b(3)
(output written to tables/corrredistrnonrep.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, HEALTH CARE/MORAL VIEWS, republicans, Table S10
. *************************************************************************
. reg zfed_univ_healthcare zprior_soc_over_self [pw=Weightvar] if republican==1,
>  robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =       3.02
                                                Prob > F          =     0.0825
                                                R-squared         =     0.0013
                                                Root MSE          =      .9574

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0362784   .0208877     1.74   0.083    -.0046772     .077234
        _cons |  -.6446457   .0195275   -33.01   0.000    -.6829343    -.606357
-------------------------------------------------------------------------------

. est store col1

. reg zfed_univ_healthcare zprior_soc_over_self i.State_Recoded [pw=Weightvar] i
> f republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =      20.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0415
                                                Root MSE          =     .94584

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |    .031975    .020676     1.55   0.122    -.0085658    .0725157
              |
State_Recoded |
      Alaska  |   .7038034   .4957396     1.42   0.156    -.2682271    1.675834
     Arizona  |   .2473857   .1190323     2.08   0.038     .0139909    .4807806
    Arkansas  |   .3525935   .1895706     1.86   0.063    -.0191105    .7242976
  California  |   .6034844   .1008193     5.99   0.000     .4058011    .8011677
    Colorado  |   .4115023   .1399003     2.94   0.003     .1371903    .6858143
 Connecticut  |   .6037751   .2028705     2.98   0.003     .2059931    1.001557
    Delaware  |   .3440292   .3362196     1.02   0.306    -.3152195    1.003278
District o..  |   .7159059   .5266257     1.36   0.174     -.316685    1.748497
     Florida  |   .6393667   .1017513     6.28   0.000     .4398559    .8388774
     Georgia  |    .435213   .1277037     3.41   0.001     .1848156    .6856104
      Hawaii  |   .9374645   .3148816     2.98   0.003     .3200548    1.554874
       Idaho  |   .2763946   .1959446     1.41   0.158    -.1078075    .6605966
    Illinois  |   .6014998   .1271276     4.73   0.000     .3522321    .8507675
     Indiana  |   .5361392   .1467962     3.65   0.000     .2483059    .8239724
        Iowa  |   .1608523   .1715448     0.94   0.348    -.1755072    .4972118
      Kansas  |   .0341589   .1240202     0.28   0.783     -.209016    .2773338
    Kentucky  |   .2269158   .1459931     1.55   0.120    -.0593428    .5131743
   Louisiana  |   .6444159   .1998032     3.23   0.001     .2526482    1.036184
       Maine  |   .3219651   .2154219     1.49   0.135    -.1004273    .7443575
    Maryland  |    .638883   .2026346     3.15   0.002     .2415635    1.036203
Massachuse~s  |   .6178653   .1887981     3.27   0.001      .247676    .9880546
    Michigan  |   .2383374   .1182457     2.02   0.044     .0064849    .4701899
   Minnesota  |   .6996896   .1770324     3.95   0.000     .3525701    1.046809
 Mississippi  |   .2001935   .1482799     1.35   0.177     -.090549     .490936
    Missouri  |    .211662    .112123     1.89   0.059    -.0081852    .4315091
     Montana  |  -.1713412   .0683406    -2.51   0.012    -.3053413   -.0373411
    Nebraska  |  -.0130479     .13473    -0.10   0.923    -.2772222    .2511263
      Nevada  |   .6561358   .2235918     2.93   0.003      .217724    1.094548
New Hampsh..  |   .2033757   .2088177     0.97   0.330    -.2060673    .6128187
  New Jersey  |   .6086781   .1302777     4.67   0.000     .3532337    .8641225
  New Mexico  |   .4150939   .2291048     1.81   0.070    -.0341275    .8643153
    New York  |   .8155537   .1094224     7.45   0.000     .6010018    1.030106
North Dakota  |   .5673883   .4080844     1.39   0.165    -.2327706    1.367547
North Caro..  |   .3883213   .1214794     3.20   0.001     .1501283    .6265143
        Ohio  |   .4117032   .1089488     3.78   0.000     .1980798    .6253266
    Oklahoma  |   .5166097   .1584596     3.26   0.001     .2059071    .8273122
      Oregon  |   .2347302   .1447071     1.62   0.105    -.0490069    .5184673
Pennsylvania  |   .4783376   .1036459     4.62   0.000     .2751121    .6815632
Rhode Island  |   .8698194   .3657587     2.38   0.017     .1526514    1.586987
South Dakota  |  -.0145235   .1635126    -0.09   0.929    -.3351339    .3060868
South Caro..  |    .432614   .1423766     3.04   0.002     .1534464    .7117816
   Tennessee  |   .3764887   .1280316     2.94   0.003     .1254485     .627529
       Texas  |   .4573475   .0979614     4.67   0.000      .265268    .6494271
        Utah  |   .0443051   .1335161     0.33   0.740     -.217489    .3060991
     Vermont  |   .3486354   .3491356     1.00   0.318    -.3359386    1.033209
    Virginia  |   .4982841   .1301699     3.83   0.000      .243051    .7535171
  Washington  |    .520963   .1648522     3.16   0.002      .197726       .8442
West Virgi..  |   .6209854   .2213637     2.81   0.005     .1869425    1.055028
   Wisconsin  |    .450308   .1267844     3.55   0.000     .2017132    .6989029
     Wyoming  |   .4401261   .3601071     1.22   0.222    -.2659604    1.146213
              |
        _cons |  -1.121046   .0680471   -16.47   0.000    -1.254471   -.9876217
-------------------------------------------------------------------------------

. est store col2

. reg zfed_univ_healthcare zprior_soc_over_self highinc higheduc female retireme
> nt_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] if repu
> blican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =       7.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0896
                                                Root MSE          =     .92294

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0186206   .0202862     0.92   0.359     -.021156    .0583973
      highinc |  -.1137191   .0392328    -2.90   0.004    -.1906456   -.0367926
     higheduc |   -.075757   .0395841    -1.91   0.056    -.1533723    .0018582
       female |  -.0349083   .0372284    -0.94   0.348    -.1079046     .038088
retirement~ge |   -.345852   .0398499    -8.68   0.000    -.4239884   -.2677155
high_confir~d |   .4351958   .1285094     3.39   0.001     .1832185    .6871731
        child |    .243459   .0487331     5.00   0.000     .1479047    .3390134
        alone |   .0011971   .0499032     0.02   0.981    -.0966515    .0990458
        urban |   .0956632    .039309     2.43   0.015     .0185873    .1727391
              |
State_Recoded |
      Alaska  |   .6338507   .4578269     1.38   0.166    -.2638426    1.531544
     Arizona  |   .2795354   .1142774     2.45   0.014     .0554637     .503607
    Arkansas  |   .3453291   .1867507     1.85   0.065    -.0208462    .7115043
  California  |   .5894568   .0985508     5.98   0.000     .3962214    .7826922
    Colorado  |  -.0325636    .163006    -0.20   0.842    -.3521809    .2870538
 Connecticut  |   .2025893   .2025442     1.00   0.317    -.1945533    .5997319
    Delaware  |   .0112245   .3304212     0.03   0.973    -.6366555    .6591045
District o..  |   .3184294   .5578842     0.57   0.568    -.7754532    1.412312
     Florida  |   .2063827   .1329643     1.55   0.121    -.0543297    .4670951
     Georgia  |  -.0208711   .1512638    -0.14   0.890    -.3174646    .2757224
      Hawaii  |   .8788643   .3348663     2.62   0.009     .2222686     1.53546
       Idaho  |   .2191672   .1933133     1.13   0.257    -.1598758    .5982102
    Illinois  |   .1494114   .1509412     0.99   0.322    -.1465496    .4453724
     Indiana  |   .0878208   .1646033     0.53   0.594    -.2349285    .4105701
        Iowa  |    .227927    .168645     1.35   0.177     -.102747    .5586009
      Kansas  |    .125217   .1215106     1.03   0.303    -.1130374    .3634713
    Kentucky  |    .275734   .1450693     1.90   0.057    -.0087134    .5601815
   Louisiana  |   .1480665   .2163461     0.68   0.494    -.2761385    .5722715
       Maine  |    .343976   .1873423     1.84   0.066    -.0233592    .7113112
    Maryland  |   .2529492   .2070424     1.22   0.222    -.1530134    .6589117
Massachuse~s  |   .1486543   .1989516     0.75   0.455    -.2414439    .5387526
    Michigan  |  -.1884909   .1448559    -1.30   0.193    -.4725201    .0955383
   Minnesota  |   .7659127   .1728075     4.43   0.000      .427077    1.104748
 Mississippi  |  -.2544547    .170724    -1.49   0.136    -.5892052    .0802958
    Missouri  |   .2309366   .1084105     2.13   0.033     .0183686    .4435046
     Montana  |  -.1907121    .089156    -2.14   0.033    -.3655265   -.0158977
    Nebraska  |   .1297336   .1316519     0.99   0.324    -.1284056    .3878728
      Nevada  |   .2387614   .2418549     0.99   0.324    -.2354605    .7129833
New Hampsh..  |   .2192129   .1920717     1.14   0.254    -.1573955    .5958214
  New Jersey  |   .1431113   .1553878     0.92   0.357    -.1615686    .4477911
  New Mexico  |   .3991903   .2302443     1.73   0.083    -.0522659    .8506464
    New York  |   .3504925   .1371012     2.56   0.011     .0816685    .6193165
North Dakota  |   .5782603    .447718     1.29   0.197    -.2996118    1.456132
North Caro..  |   .3994562   .1205497     3.31   0.001     .1630859    .6358265
        Ohio  |   .3712468   .1101174     3.37   0.001     .1553319    .5871617
    Oklahoma  |   .4503829   .1505747     2.99   0.003     .1551405    .7456252
      Oregon  |   .2373146   .1328534     1.79   0.074    -.0231803    .4978095
Pennsylvania  |   .0627973   .1340623     0.47   0.640    -.2000681    .3256626
Rhode Island  |   .3721229   .3619623     1.03   0.304     -.337602    1.081848
South Dakota  |  -.0492412   .1793251    -0.27   0.784    -.4008565    .3023742
South Caro..  |   .4162794   .1440122     2.89   0.004     .1339045    .6986542
   Tennessee  |  -.0179132   .1522766    -0.12   0.906    -.3164927    .2806662
       Texas  |   .4205888   .0958422     4.39   0.000     .2326644    .6085133
        Utah  |  -.4467155   .1680485    -2.66   0.008      -.77622    -.117211
     Vermont  |  -.0111117   .3383096    -0.03   0.974     -.674459    .6522357
    Virginia  |   .4834947   .1255668     3.85   0.000      .237287    .7297024
  Washington  |   .0923671   .1758615     0.53   0.599     -.252457    .4371911
West Virgi..  |    .562261   .2418217     2.33   0.020     .0881042    1.036418
   Wisconsin  |          0  (omitted)
     Wyoming  |   .4003049   .3551658     1.13   0.260    -.2960936    1.096703
              |
        _cons |  -1.067218   .0790337   -13.50   0.000    -1.222184   -.9122508
-------------------------------------------------------------------------------

. est store col3

. 
. reg zfed_univ_healthcare zprior_national_over_global [pw=Weightvar] if republi
> can==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =      28.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0122
                                                Root MSE          =     .95218

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.1215211   .0227485    -5.34   0.000    -.1661253   -.0769169
        _cons |  -.6069249   .0212303   -28.59   0.000    -.6485522   -.5652976
-------------------------------------------------------------------------------

. est store col4

. reg zfed_univ_healthcare zprior_national_over_global i.State_Recoded [pw=Weigh
> tvar] if republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =      12.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0507
                                                Root MSE          =     .94133

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.1118436   .0225876    -4.95   0.000    -.1561327   -.0675546
              |
State_Recoded |
      Alaska  |    .550096   .4701406     1.17   0.242    -.3717407    1.471933
     Arizona  |   .2501911   .1184043     2.11   0.035     .0180277    .4823545
    Arkansas  |    .357767   .1941244     1.84   0.065    -.0228659       .7384
  California  |   .5935487   .1008413     5.89   0.000     .3958223    .7912752
    Colorado  |   .4110169   .1374515     2.99   0.003     .1415063    .6805275
 Connecticut  |   .6042611   .1973894     3.06   0.002     .2172262     .991296
    Delaware  |   .3191594   .3539413     0.90   0.367    -.3748373    1.013156
District o..  |   .6483471   .4816799     1.35   0.178    -.2961155     1.59281
     Florida  |    .617513   .1014279     6.09   0.000     .4186363    .8163896
     Georgia  |   .4146015   .1211678     3.42   0.001     .1770196    .6521834
      Hawaii  |   .9136822   .2950337     3.10   0.002     .3351895    1.492175
       Idaho  |   .2470794   .1876243     1.32   0.188    -.1208083    .6149671
    Illinois  |   .6005205   .1284941     4.67   0.000     .3485733    .8524676
     Indiana  |   .5312402   .1455441     3.65   0.000     .2458619    .8166186
        Iowa  |   .1577731   .1811782     0.87   0.384    -.1974754    .5130215
      Kansas  |   .0382199   .1253316     0.30   0.760    -.2075264    .2839662
    Kentucky  |   .2438269   .1454552     1.68   0.094    -.0413771    .5290309
   Louisiana  |   .6543071   .2021337     3.24   0.001     .2579699    1.050644
       Maine  |   .3105721   .2221968     1.40   0.162    -.1251043    .7462485
    Maryland  |    .649631   .2029776     3.20   0.001      .251639    1.047623
Massachuse~s  |    .630779   .1855551     3.40   0.001     .2669484    .9946096
    Michigan  |   .2401979   .1181499     2.03   0.042     .0085333    .4718624
   Minnesota  |   .7013624   .1805832     3.88   0.000     .3472806    1.055444
 Mississippi  |    .209471   .1497355     1.40   0.162    -.0841256    .5030677
    Missouri  |   .2149563   .1103142     1.95   0.051    -.0013443    .4312568
     Montana  |  -.1509593   .0703161    -2.15   0.032    -.2888329   -.0130857
    Nebraska  |  -.0299652   .1334064    -0.22   0.822    -.2915443    .2316139
      Nevada  |   .6635611   .2193585     3.03   0.003     .2334498    1.093672
New Hampsh..  |   .1833416   .2133022     0.86   0.390    -.2348945    .6015777
  New Jersey  |     .60186   .1300972     4.63   0.000     .3467696    .8569505
  New Mexico  |   .4045794   .2222138     1.82   0.069    -.0311303    .8402891
    New York  |   .8040518   .1088504     7.39   0.000     .5906215    1.017482
North Dakota  |    .543365   .4017701     1.35   0.176    -.2444129    1.331143
North Caro..  |   .3858112   .1211901     3.18   0.001     .1481854    .6234369
        Ohio  |   .4114875   .1094655     3.76   0.000      .196851    .6261241
    Oklahoma  |   .5231529   .1579063     3.31   0.001     .2135352    .8327705
      Oregon  |    .244183   .1400357     1.74   0.081    -.0303945    .5187605
Pennsylvania  |   .4786098   .1030163     4.65   0.000     .2766187    .6806008
Rhode Island  |   .8707267   .3755611     2.32   0.020     .1343384    1.607115
South Dakota  |  -.0107352   .1605805    -0.07   0.947    -.3255963    .3041259
South Caro..  |   .4319088   .1418886     3.04   0.002      .153698    .7101195
   Tennessee  |   .3922839   .1272662     3.08   0.002     .1427443    .6418234
       Texas  |   .4588228   .0974678     4.71   0.000     .2677111    .6499345
        Utah  |   .0480992   .1365518     0.35   0.725    -.2196472    .3158456
     Vermont  |   .3171004    .334919     0.95   0.344    -.3395981    .9737989
    Virginia  |   .4972794   .1289739     3.86   0.000     .2443916    .7501673
  Washington  |   .5216426   .1576801     3.31   0.001     .2124685    .8308168
West Virgi..  |   .5971666   .2200892     2.71   0.007     .1656227    1.028711
   Wisconsin  |   .4488233   .1260165     3.56   0.000     .2017343    .6959124
     Wyoming  |   .4813547   .3583326     1.34   0.179    -.2212524    1.183962
              |
        _cons |  -1.082102   .0683487   -15.83   0.000    -1.216118   -.9480858
-------------------------------------------------------------------------------

. est store col5

. reg zfed_univ_healthcare zprior_national_over_global highinc higheduc female r
> etirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] 
> if republican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =       7.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0946
                                                Root MSE          =     .92039

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0821141   .0226185    -3.63   0.000    -.1264637   -.0377645
      highinc |  -.1090858   .0391021    -2.79   0.005     -.185756   -.0324156
     higheduc |   -.076547   .0395294    -1.94   0.053    -.1540551     .000961
       female |  -.0322091   .0370654    -0.87   0.385    -.1048858    .0404677
retirement~ge |  -.3281171   .0401259    -8.18   0.000    -.4067946   -.2494395
high_confir~d |   .4346216   .1279622     3.40   0.001     .1837171    .6855261
        child |   .2383909   .0486096     4.90   0.000     .1430787    .3337031
        alone |  -.0021736   .0495334    -0.04   0.965    -.0992973    .0949501
        urban |   .0915646   .0394843     2.32   0.020     .0141449    .1689843
              |
State_Recoded |
      Alaska  |    .530194   .4398636     1.21   0.228    -.3322775    1.392665
     Arizona  |   .2805767   .1142759     2.46   0.014     .0565079    .5046454
    Arkansas  |   .3482168   .1907381     1.83   0.068    -.0257768    .7222104
  California  |    .583291    .098962     5.89   0.000     .3892493    .7773327
    Colorado  |   -.031404   .1613575    -0.19   0.846    -.3477888    .2849809
 Connecticut  |   .2017952   .1992817     1.01   0.311    -.1889504    .5925408
    Delaware  |  -.0091044    .343314    -0.03   0.979    -.6822643    .6640555
District o..  |   .2712812   .5240394     0.52   0.605    -.7562397    1.298802
     Florida  |   .1909144    .132656     1.44   0.150    -.0691936    .4510223
     Georgia  |  -.0340458   .1470411    -0.23   0.817    -.3223597    .2542681
      Hawaii  |   .8634315   .3194279     2.70   0.007     .2371068    1.489756
       Idaho  |   .1993578   .1872595     1.06   0.287     -.167815    .5665305
    Illinois  |   .1497412   .1514246     0.99   0.323    -.1471676      .44665
     Indiana  |   .0852493   .1636363     0.52   0.602    -.2356038    .4061025
        Iowa  |   .2233347   .1764522     1.27   0.206    -.1226474    .5693169
      Kansas  |   .1244286   .1227726     1.01   0.311    -.1163003    .3651575
    Kentucky  |   .2870665    .144713     1.98   0.047     .0033175    .5708155
   Louisiana  |    .157666   .2174977     0.72   0.469     -.268797     .584129
       Maine  |   .3310821   .1940808     1.71   0.088    -.0494657    .7116299
    Maryland  |   .2583771   .2074735     1.25   0.213    -.1484308    .6651849
Massachuse~s  |   .1614978   .1969921     0.82   0.412    -.2247584     .547754
    Michigan  |  -.1860833   .1446619    -1.29   0.198    -.4697321    .0975654
   Minnesota  |   .7640687   .1759029     4.34   0.000     .4191636    1.108974
 Mississippi  |  -.2464194   .1718497    -1.43   0.152    -.5833772    .0905385
    Missouri  |   .2335057   .1071158     2.18   0.029     .0234762    .4435351
     Montana  |  -.1732131   .0903959    -1.92   0.055    -.3504586    .0040324
    Nebraska  |   .1117168   .1299552     0.86   0.390    -.1430954     .366529
      Nevada  |   .2442051   .2390225     1.02   0.307    -.2244631    .7128733
New Hampsh..  |   .2059278    .195183     1.06   0.291    -.1767812    .5886369
  New Jersey  |   .1407066   .1552251     0.91   0.365    -.1636541    .4450673
  New Mexico  |   .3930456    .224132     1.75   0.080    -.0464256    .8325169
    New York  |   .3439261   .1366654     2.52   0.012     .0759566    .6118956
North Dakota  |   .5609921   .4416767     1.27   0.204    -.3050344    1.427019
North Caro..  |   .3970859   .1204756     3.30   0.001     .1608609    .6333109
        Ohio  |   .3719624   .1105345     3.37   0.001     .1552297    .5886951
    Oklahoma  |   .4569935   .1504027     3.04   0.002     .1620885    .7518986
      Oregon  |   .2434559   .1306361     1.86   0.062    -.0126915    .4996033
Pennsylvania  |   .0620153   .1331837     0.47   0.642    -.1991272    .3231578
Rhode Island  |   .3763556   .3701397     1.02   0.309    -.3494032    1.102114
South Dakota  |  -.0439517    .174794    -0.25   0.801    -.3866825    .2987791
South Caro..  |   .4153518   .1438188     2.89   0.004     .1333561    .6973475
   Tennessee  |   -.007086   .1515563    -0.05   0.963    -.3042531     .290081
       Texas  |   .4237019   .0957534     4.42   0.000     .2359515    .6114524
        Utah  |  -.4409798   .1694859    -2.60   0.009    -.7733026   -.1086569
     Vermont  |  -.0361472   .3279468    -0.11   0.912    -.6791754    .6068811
    Virginia  |   .4827137   .1252202     3.85   0.000     .2371856    .7282417
  Washington  |   .0922221   .1719396     0.54   0.592    -.2449119    .4293561
West Virgi..  |   .5462195    .239966     2.28   0.023     .0757015    1.016738
   Wisconsin  |          0  (omitted)
     Wyoming  |   .4334591   .3540848     1.22   0.221    -.2608197    1.127738
              |
        _cons |  -1.040302   .0795206   -13.08   0.000    -1.196224   -.8843805
-------------------------------------------------------------------------------

. est store col6

. 
. reg zfed_univ_healthcare zluck_unfair_agree [pw=Weightvar] if republican==1, r
> obust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(1, 3001)        =     123.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0465
                                                Root MSE          =     .93549

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1957736   .0175967    11.13   0.000     .1612707    .2302765
        _cons |  -.6090004   .0194634   -31.29   0.000    -.6471633   -.5708375
-------------------------------------------------------------------------------

. est store col7

. reg zfed_univ_healthcare zluck_unfair_agree i.State_Recoded [pw=Weightvar] if 
> republican==1, robust
(sum of wgt is 2,822.90574199334)

Linear regression                               Number of obs     =      3,003
                                                F(51, 2951)       =       7.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0822
                                                Root MSE          =     .92555

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1880047   .0174707    10.76   0.000     .1537487    .2222608
              |
State_Recoded |
      Alaska  |   .6886794   .5043868     1.37   0.172    -.3003062    1.677665
     Arizona  |   .2913832   .1239848     2.35   0.019     .0482778    .5344886
    Arkansas  |   .4448272   .1766307     2.52   0.012     .0984954    .7911591
  California  |    .615797   .1054035     5.84   0.000     .4091252    .8224688
    Colorado  |     .43708   .1422917     3.07   0.002     .1580789    .7160811
 Connecticut  |   .5649839   .2158658     2.62   0.009     .1417211    .9882467
    Delaware  |   .4926416   .3343461     1.47   0.141    -.1629335    1.148217
District o..  |   .8414442   .4626728     1.82   0.069      -.06575    1.748638
     Florida  |   .6410493   .1031094     6.22   0.000     .4388757    .8432229
     Georgia  |   .4341357   .1287005     3.37   0.001     .1817839    .6864876
      Hawaii  |   .8742581   .3329969     2.63   0.009     .2213285    1.527188
       Idaho  |   .2833521   .1853186     1.53   0.126    -.0800148    .6467189
    Illinois  |   .6328352   .1272749     4.97   0.000     .3832786    .8823917
     Indiana  |    .570689   .1402133     4.07   0.000     .2957633    .8456147
        Iowa  |   .2171437   .1608085     1.35   0.177    -.0981645    .5324519
      Kansas  |   .0817598   .1254336     0.65   0.515    -.1641864     .327706
    Kentucky  |   .2069528   .1479806     1.40   0.162    -.0832029    .4971084
   Louisiana  |   .6827462   .2054473     3.32   0.001     .2799116    1.085581
       Maine  |   .2765335   .2038303     1.36   0.175    -.1231305    .6761976
    Maryland  |   .5973774   .2061755     2.90   0.004     .1931152     1.00164
Massachuse~s  |   .5786148   .1827345     3.17   0.002     .2203148    .9369148
    Michigan  |   .2438993    .120138     2.03   0.042     .0083365     .479462
   Minnesota  |   .7215161   .1753199     4.12   0.000     .3777545    1.065278
 Mississippi  |   .1499379   .1514048     0.99   0.322    -.1469319    .4468077
    Missouri  |   .2479384   .1154613     2.15   0.032     .0215455    .4743312
     Montana  |  -.1096587   .0888934    -1.23   0.217     -.283958    .0646407
    Nebraska  |   .0363569   .1349813     0.27   0.788    -.2283101    .3010239
      Nevada  |   .6811983   .2173476     3.13   0.002       .25503    1.107367
New Hampsh..  |   .2408663   .2256065     1.07   0.286    -.2014957    .6832283
  New Jersey  |   .5992824   .1297333     4.62   0.000     .3449054    .8536593
  New Mexico  |   .4318524   .2453244     1.76   0.078    -.0491719    .9128767
    New York  |    .757814   .1115937     6.79   0.000     .5390047    .9766233
North Dakota  |   .5497788   .3752207     1.47   0.143     -.185942    1.285499
North Caro..  |   .4247227   .1231449     3.45   0.001     .1832641    .6661812
        Ohio  |   .4272484   .1114978     3.83   0.000      .208627    .6458698
    Oklahoma  |   .5316514   .1553521     3.42   0.001      .227042    .8362608
      Oregon  |   .2544546   .1504285     1.69   0.091    -.0405008      .54941
Pennsylvania  |   .4823807   .1063629     4.54   0.000     .2738276    .6909337
Rhode Island  |   .9045343   .3493434     2.59   0.010     .2195529    1.589516
South Dakota  |   .0572526    .168981     0.34   0.735    -.2740801    .3885852
South Caro..  |   .4397047   .1442135     3.05   0.002     .1569354    .7224739
   Tennessee  |    .392278   .1303731     3.01   0.003     .1366465    .6479095
       Texas  |   .4675413   .1013435     4.61   0.000     .2688302    .6662524
        Utah  |   .0618915    .142253     0.44   0.664    -.2170336    .3408166
     Vermont  |   .5312229    .295633     1.80   0.072    -.0484448    1.110891
    Virginia  |   .5052866   .1306589     3.87   0.000     .2490948    .7614783
  Washington  |   .5774329   .1636831     3.53   0.000     .2564883    .8983775
West Virgi..  |   .5426778   .2221169     2.44   0.015     .1071581    .9781975
   Wisconsin  |   .5291192   .1277087     4.14   0.000      .278712    .7795265
     Wyoming  |   .4518299   .3490814     1.29   0.196    -.2326379    1.136298
              |
        _cons |  -1.097736    .074382   -14.76   0.000    -1.243582   -.9518899
-------------------------------------------------------------------------------

. est store col8

. reg zfed_univ_healthcare zluck_unfair_agree highinc higheduc female retirement
> _age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] if republ
> ican==1, robust
(sum of wgt is 2,822.90574199334)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      3,003
                                                F(58, 2944)       =       8.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1207
                                                Root MSE          =     .90701

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1652233   .0173643     9.52   0.000      .131176    .1992707
      highinc |  -.0891783   .0386233    -2.31   0.021    -.1649096   -.0134469
     higheduc |  -.0628662    .038617    -1.63   0.104    -.1385852    .0128529
       female |  -.0413796   .0365265    -1.13   0.257    -.1129998    .0302405
retirement~ge |  -.3260746    .039477    -8.26   0.000      -.40348   -.2486693
high_confir~d |   .5046085   .1295937     3.89   0.000      .250505    .7587121
        child |   .2070822    .047973     4.32   0.000     .1130183    .3011462
        alone |  -.0080345   .0495271    -0.16   0.871    -.1051457    .0890767
        urban |   .0847065   .0389016     2.18   0.030     .0084293    .1609837
              |
State_Recoded |
      Alaska  |   .6208534   .4767163     1.30   0.193    -.3138777    1.555584
     Arizona  |   .3155523   .1192828     2.65   0.008     .0816661    .5494384
    Arkansas  |   .4239941    .175022     2.42   0.015     .0808163     .767172
  California  |   .5959528   .1039413     5.73   0.000     .3921478    .7997579
    Colorado  |  -.0789798   .1592824    -0.50   0.620    -.3912961    .2333364
 Connecticut  |   .0925566   .2130648     0.43   0.664    -.3252146    .5103277
    Delaware  |   .0629103   .3265728     0.19   0.847    -.5774239    .7032445
District o..  |   .3474211   .4940717     0.70   0.482    -.6213399    1.316182
     Florida  |    .135292   .1278624     1.06   0.290    -.1154168    .3860008
     Georgia  |  -.0916159   .1470768    -0.62   0.533    -.3799997    .1967679
      Hawaii  |   .8235172   .3469467     2.37   0.018     .1432344      1.5038
       Idaho  |     .23082   .1864834     1.24   0.216    -.1348311     .596471
    Illinois  |   .1040164   .1460541     0.71   0.476    -.1823622    .3903949
     Indiana  |   .0438731   .1558014     0.28   0.778    -.2616176    .3493638
        Iowa  |   .2681405   .1585744     1.69   0.091    -.0427875    .5790684
      Kansas  |   .1570899   .1196879     1.31   0.189    -.0775906    .3917703
    Kentucky  |   .2521492   .1464505     1.72   0.085    -.0350067     .539305
   Louisiana  |   .1175613   .2147952     0.55   0.584    -.3036027    .5387253
       Maine  |   .3029665   .1834529     1.65   0.099    -.0567424    .6626754
    Maryland  |   .1365215   .2062476     0.66   0.508    -.2678826    .5409255
Massachuse~s  |   .0480733   .1923104     0.25   0.803    -.3290033    .4251498
    Michigan  |  -.2556079   .1405832    -1.82   0.069    -.5312592    .0200435
   Minnesota  |   .7704943   .1722335     4.47   0.000      .432784    1.108205
 Mississippi  |  -.3676343   .1706645    -2.15   0.031    -.7022682   -.0330004
    Missouri  |   .2601545   .1125422     2.31   0.021     .0394852    .4808239
     Montana  |  -.1358032   .1027211    -1.32   0.186    -.3372157    .0656094
    Nebraska  |   .1564891    .135584     1.15   0.249    -.1093599    .4223381
      Nevada  |   .1897195    .235564     0.81   0.421    -.2721675    .6516064
New Hampsh..  |   .2495726   .2117891     1.18   0.239     -.165697    .6648423
  New Jersey  |   .0609617   .1496994     0.41   0.684    -.2325643    .3544878
  New Mexico  |   .4105153   .2452008     1.67   0.094    -.0702671    .8912977
    New York  |   .2288725   .1336536     1.71   0.087    -.0331915    .4909366
North Dakota  |   .5588737   .4060362     1.38   0.169    -.2372699    1.355017
North Caro..  |   .4274548   .1232382     3.47   0.001      .185813    .6690965
        Ohio  |   .3858615   .1126188     3.43   0.001     .1650419    .6066811
    Oklahoma  |   .4721112   .1503105     3.14   0.002     .1773868    .7668355
      Oregon  |   .2527172   .1351992     1.87   0.062    -.0123774    .5178118
Pennsylvania  |  -.0073094   .1295971    -0.06   0.955    -.2614195    .2468008
Rhode Island  |   .3421452    .352201     0.97   0.331    -.3484399     1.03273
South Dakota  |   .0128741   .1821538     0.07   0.944    -.3442877    .3700359
South Caro..  |   .4253125   .1457173     2.92   0.004     .1395944    .7110307
   Tennessee  |  -.0766253   .1491226    -0.51   0.607    -.3690204    .2157698
       Texas  |   .4314833   .1002324     4.30   0.000     .2349505    .6280161
        Utah  |  -.4923943   .1688953    -2.92   0.004    -.8235591   -.1612294
     Vermont  |   .0671621   .2967109     0.23   0.821    -.5146198     .648944
    Virginia  |    .488852    .127939     3.82   0.000      .237993     .739711
  Washington  |   .0701648   .1719978     0.41   0.683    -.2670833    .4074129
West Virgi..  |   .4981549   .2432267     2.05   0.041     .0212433    .9750665
   Wisconsin  |          0  (omitted)
     Wyoming  |   .4215436   .3481454     1.21   0.226    -.2610895    1.104177
              |
        _cons |  -1.043428   .0845315   -12.34   0.000    -1.209175   -.8776816
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrhealthrep
> .tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree highi
> nc higheduc female retirement_age high_confirmed child alone urban _cons) ///
> label mtitle("Health care (std.)"  "Health care (std.)" "Health care (std.)" "
> Health care (std.)" "Health care (std.)" "Health care (std.)" "Health care (st
> d.)" "Health care (std.)" "Health care (std.)") ///
> b(3)
(output written to tables/corrhealthrep.tex)

. 
. *************************************************************************
. *ASSOCIATIONS, HEALTH CARE/MORAL VIEWS, non-republicans, Table S11
. *************************************************************************
. reg zfed_univ_healthcare zprior_soc_over_self [pw=Weightvar] if republican==0,
>  robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =       7.29
                                                Prob > F          =     0.0069
                                                R-squared         =     0.0023
                                                Root MSE          =     .79568

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0386905   .0143259     2.70   0.007     .0106042    .0667768
        _cons |   .3919851   .0136199    28.78   0.000     .3652831    .4186872
-------------------------------------------------------------------------------

. est store col1

. reg zfed_univ_healthcare zprior_soc_over_self i.State_Recoded [pw=Weightvar] i
> f republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       1.29
                                                Prob > F          =     0.0831
                                                R-squared         =     0.0198
                                                Root MSE          =     .79336

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0393692    .014215     2.77   0.006     .0115002    .0672382
              |
State_Recoded |
      Alaska  |    .029265   .3501481     0.08   0.933    -.6572111    .7157412
     Arizona  |   .2486694    .162581     1.53   0.126    -.0700756    .5674145
    Arkansas  |  -.2438193   .2304494    -1.06   0.290    -.6956225     .207984
  California  |   .2204704   .1494859     1.47   0.140    -.0726013    .5135422
    Colorado  |   .0749528    .186085     0.40   0.687    -.2898726    .4397782
 Connecticut  |   .2081054   .1788228     1.16   0.245    -.1424822     .558693
    Delaware  |  -.1765767   .3395013    -0.52   0.603    -.8421796    .4890261
District o..  |   .4018345   .1990348     2.02   0.044     .0116206    .7920484
     Florida  |    .189302   .1534062     1.23   0.217    -.1114557    .4900597
     Georgia  |   .0392607   .1756966     0.22   0.823    -.3051979    .3837193
      Hawaii  |   .0619539   .2784475     0.22   0.824    -.4839511    .6078589
       Idaho  |   -.136879    .301023    -0.45   0.649     -.727044    .4532861
    Illinois  |   .2677401   .1534193     1.75   0.081    -.0330432    .5685235
     Indiana  |   .1793348   .1711227     1.05   0.295    -.1561566    .5148262
        Iowa  |   .0766492   .1988086     0.39   0.700    -.3131212    .4664197
      Kansas  |  -.0475502   .2765999    -0.17   0.864    -.5898329    .4947325
    Kentucky  |   .1178473   .1856867     0.63   0.526    -.2461973    .4818919
   Louisiana  |   .0113128   .2381952     0.05   0.962    -.4556762    .4783018
       Maine  |   .3760842    .177447     2.12   0.034     .0281937    .7239746
    Maryland  |   .1932242   .1683593     1.15   0.251    -.1368495    .5232979
Massachuse~s  |   .1221989   .1735097     0.70   0.481    -.2179722      .46237
    Michigan  |    .193959   .1596191     1.22   0.224    -.1189792    .5068971
   Minnesota  |   .0913595   .1827267     0.50   0.617    -.2668818    .4496008
 Mississippi  |   .1336667    .255265     0.52   0.601    -.3667882    .6341216
    Missouri  |   .1271565   .1729309     0.74   0.462    -.2118799     .466193
     Montana  |   .0516427   .2886535     0.18   0.858    -.5142715    .6175569
    Nebraska  |   .1947762   .2318176     0.84   0.401    -.2597094    .6492619
      Nevada  |   .1096166   .1928085     0.57   0.570    -.2683904    .4876236
New Hampsh..  |   .1368223   .2139464     0.64   0.523    -.2826263    .5562709
  New Jersey  |   .1180907   .1655173     0.71   0.476    -.2064111    .4425925
  New Mexico  |   .0631209   .2535242     0.25   0.803    -.4339212     .560163
    New York  |   .2067161   .1519064     1.36   0.174    -.0911011    .5045333
North Dakota  |   .0967528   .4285307     0.23   0.821    -.7433949    .9369004
North Caro..  |   .2473015   .1592212     1.55   0.120    -.0648568    .5594597
        Ohio  |   .0639756   .1623498     0.39   0.694    -.2543163    .3822675
    Oklahoma  |  -.0290231   .2233343    -0.13   0.897    -.4668769    .4088306
      Oregon  |   .1766317   .1711909     1.03   0.302    -.1589934    .5122568
Pennsylvania  |   .2038444   .1548607     1.32   0.188    -.0997648    .5074536
Rhode Island  |   .2231285   .2485425     0.90   0.369    -.2641469    .7104038
South Dakota  |  -.0198168   .3165101    -0.06   0.950    -.6403447    .6007111
South Caro..  |  -.1638341   .2151885    -0.76   0.446     -.585718    .2580497
   Tennessee  |  -.0743106   .1892243    -0.39   0.695    -.4452908    .2966695
       Texas  |   .1740723   .1546652     1.13   0.260    -.1291536    .4772982
        Utah  |  -.4625711   .2674992    -1.73   0.084    -.9870116    .0618693
     Vermont  |   .3659807   .2043136     1.79   0.073    -.0345826    .7665439
    Virginia  |   .0925393   .1652928     0.56   0.576    -.2315223     .416601
  Washington  |   .0450511   .1693294     0.27   0.790    -.2869244    .3770266
West Virgi..  |   .1536442   .1938009     0.79   0.428    -.2263084    .5335969
   Wisconsin  |   .1416643   .1670996     0.85   0.397    -.1859396    .4692682
     Wyoming  |   .2041958   .2640982     0.77   0.439    -.3135769    .7219685
              |
        _cons |   .2432757   .1450244     1.68   0.094    -.0410491    .5276004
-------------------------------------------------------------------------------

. est store col2

. reg zfed_univ_healthcare zprior_soc_over_self highinc higheduc female retireme
> nt_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] if repu
> blican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       1.68
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0275
                                                Root MSE          =     .79092

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_soc_~f |   .0339423   .0142662     2.38   0.017     .0059729    .0619117
      highinc |  -.0763226   .0304242    -2.51   0.012    -.1359703   -.0166749
     higheduc |   .0937019   .0287243     3.26   0.001     .0373871    .1500167
       female |   .0363729    .027071     1.34   0.179    -.0167006    .0894464
retirement~ge |  -.0387273   .0368837    -1.05   0.294     -.111039    .0335844
high_confir~d |   .1401174   .1632833     0.86   0.391    -.1800048    .4602395
        child |  -.0754072   .0337815    -2.23   0.026    -.1416369   -.0091775
        alone |  -.0882654   .0352861    -2.50   0.012    -.1574449   -.0190858
        urban |   .0899946   .0377594     2.38   0.017     .0159662    .1640231
              |
State_Recoded |
      Alaska  |   .0370313   .3406219     0.11   0.913    -.6307688    .7048315
     Arizona  |    .245687    .159072     1.54   0.123    -.0661787    .5575528
    Arkansas  |  -.2525581   .2269639    -1.11   0.266     -.697528    .1924118
  California  |   .2091399   .1460159     1.43   0.152     -.077129    .4954088
    Colorado  |    -.08696   .1412335    -0.62   0.538    -.3638528    .1899328
 Connecticut  |   .0770592   .1354037     0.57   0.569     -.188404    .3425224
    Delaware  |  -.2996427   .3198364    -0.94   0.349    -.9266922    .3274068
District o..  |   .2275485   .1549843     1.47   0.142    -.0763032    .5314002
     Florida  |   .0335915   .0961355     0.35   0.727    -.1548853    .2220683
     Georgia  |   -.120014   .1286557    -0.93   0.351    -.3722476    .1322195
      Hawaii  |   .0627855   .2772933     0.23   0.821    -.4808568    .6064279
       Idaho  |   -.142931     .29627    -0.48   0.630    -.7237777    .4379158
    Illinois  |   .1256265   .0962587     1.31   0.192    -.0630917    .3143447
     Indiana  |   .0423935   .1221442     0.35   0.729    -.1970742    .2818611
        Iowa  |   .0913156   .1943183     0.47   0.638    -.2896516    .4722828
      Kansas  |  -.0327812   .2720658    -0.12   0.904    -.5661749    .5006124
    Kentucky  |   .1315457   .1809634     0.73   0.467    -.2232388    .4863302
   Louisiana  |  -.1252389   .2065081    -0.61   0.544    -.5301047    .2796268
       Maine  |   .3705621   .1785594     2.08   0.038     .0204906    .7206336
    Maryland  |   .0500832   .1191762     0.42   0.674    -.1835656    .2837319
Massachuse~s  |  -.0276826   .1256225    -0.22   0.826    -.2739694    .2186043
    Michigan  |   .0653888   .1057911     0.62   0.537     -.142018    .2727955
   Minnesota  |   .1052952   .1811844     0.58   0.561    -.2499227    .4605131
 Mississippi  |   .0186912   .2324239     0.08   0.936    -.4369832    .4743657
    Missouri  |    .116538   .1704084     0.68   0.494    -.2175532    .4506291
     Montana  |   .0703849   .2843344     0.25   0.805    -.4870617    .6278316
    Nebraska  |   .2026037   .2328391     0.87   0.384    -.2538848    .6590921
      Nevada  |  -.0586189   .1507456    -0.39   0.697    -.3541605    .2369228
New Hampsh..  |    .145308    .209106     0.69   0.487    -.2646511    .5552671
  New Jersey  |  -.0285502   .1139307    -0.25   0.802     -.251915    .1948145
  New Mexico  |   .0589511   .2467385     0.24   0.811    -.4247876    .5426898
    New York  |   .0615875   .0939029     0.66   0.512     -.122512    .2456871
North Dakota  |   .1010589   .4033521     0.25   0.802    -.6897258    .8918436
North Caro..  |   .2553251   .1558151     1.64   0.101    -.0501553    .5608056
        Ohio  |   .0636456   .1590562     0.40   0.689    -.2481893    .3754805
    Oklahoma  |  -.0364167    .218746    -0.17   0.868    -.4652753    .3924418
      Oregon  |   .1801701   .1684432     1.07   0.285    -.1500683    .5104084
Pennsylvania  |   .0577995   .0983337     0.59   0.557    -.1349869    .2505859
Rhode Island  |    .097751   .2122575     0.46   0.645    -.3183867    .5138886
South Dakota  |   .0058253   .3154647     0.02   0.985    -.6126533    .6243039
South Caro..  |  -.1847628   .2134127    -0.87   0.387    -.6031652    .2336396
   Tennessee  |  -.2035546   .1463739    -1.39   0.164    -.4905253    .0834161
       Texas  |   .1589647   .1509859     1.05   0.292    -.1370479    .4549774
        Utah  |  -.6280541   .2390402    -2.63   0.009      -1.0967   -.1594081
     Vermont  |   .3079574   .1624079     1.90   0.058    -.0104486    .6263633
    Virginia  |   .0905462   .1620969     0.56   0.576    -.2272499    .4083423
  Washington  |  -.0995397   .1202267    -0.83   0.408     -.335248    .1361687
West Virgi..  |   .1722735   .1920077     0.90   0.370    -.2041637    .5487107
   Wisconsin  |          0  (omitted)
     Wyoming  |   .1906053   .2616539     0.73   0.466    -.3223755    .7035861
              |
        _cons |   .1902239   .1472074     1.29   0.196     -.098381    .4788288
-------------------------------------------------------------------------------

. est store col3

. 
. reg zfed_univ_healthcare zprior_national_over_global [pw=Weightvar] if republi
> can==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =      19.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0059
                                                Root MSE          =     .79424

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0617679   .0140305    -4.40   0.000     -.089275   -.0342607
        _cons |   .3836915   .0138939    27.62   0.000      .356452    .4109309
-------------------------------------------------------------------------------

. est store col4

. reg zfed_univ_healthcare zprior_national_over_global i.State_Recoded [pw=Weigh
> tvar] if republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       1.61
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0236
                                                Root MSE          =     .79182

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |  -.0634633   .0139119    -4.56   0.000     -.090738   -.0361886
              |
State_Recoded |
      Alaska  |   .0221252   .3426311     0.06   0.949    -.6496138    .6938642
     Arizona  |   .2537538   .1626285     1.56   0.119    -.0650845    .5725921
    Arkansas  |    -.22338    .229322    -0.97   0.330     -.672973     .226213
  California  |    .223162    .150061     1.49   0.137    -.0710373    .5173612
    Colorado  |   .0815121   .1870338     0.44   0.663    -.2851734    .4481977
 Connecticut  |    .213402    .178043     1.20   0.231    -.1356567    .5624608
    Delaware  |  -.1699198   .3433117    -0.49   0.621    -.8429932    .5031535
District o..  |   .3826405   .2013841     1.90   0.057    -.0121794    .7774603
     Florida  |   .2027761   .1539933     1.32   0.188    -.0991325    .5046848
     Georgia  |   .0442543   .1757657     0.25   0.801    -.3003397    .3888484
      Hawaii  |   .0683517   .2808334     0.24   0.808    -.4822308    .6189343
       Idaho  |  -.1500204   .3068565    -0.49   0.625    -.7516222    .4515814
    Illinois  |   .2798017   .1539074     1.82   0.069    -.0219385     .581542
     Indiana  |   .2046357   .1711455     1.20   0.232    -.1309004    .5401717
        Iowa  |   .0817754    .199623     0.41   0.682    -.3095917    .4731425
      Kansas  |  -.0552141   .2695664    -0.20   0.838    -.5837074    .4732792
    Kentucky  |   .1370915     .18735     0.73   0.464     -.230214     .504397
   Louisiana  |   .0106752   .2447129     0.04   0.965    -.4690921    .4904425
       Maine  |   .3847807   .1782399     2.16   0.031     .0353358    .7342256
    Maryland  |   .1972263   .1686924     1.17   0.242    -.1335005    .5279531
Massachuse~s  |   .1294757   .1738475     0.74   0.456    -.2113577    .4703092
    Michigan  |   .2033149    .160415     1.27   0.205    -.1111837    .5178135
   Minnesota  |   .1065116   .1827618     0.58   0.560    -.2517986    .4648218
 Mississippi  |   .0825059    .259296     0.32   0.750    -.4258521    .5908638
    Missouri  |   .1367584   .1720311     0.79   0.427    -.2005139    .4740307
     Montana  |   .0956554    .289772     0.33   0.741    -.4724517    .6637624
    Nebraska  |   .2074112   .2315924     0.90   0.371    -.2466328    .6614552
      Nevada  |   .1279311   .1927047     0.66   0.507    -.2498724    .5057346
New Hampsh..  |   .1547439   .2147402     0.72   0.471     -.266261    .5757488
  New Jersey  |   .1230108   .1666625     0.74   0.461    -.2037362    .4497577
  New Mexico  |   .0613408   .2544651     0.24   0.810    -.4375459    .5602275
    New York  |   .2095898   .1526819     1.37   0.170    -.0897478    .5089275
North Dakota  |   .1376724   .4287771     0.32   0.748    -.7029585    .9783033
North Caro..  |   .2547979   .1594607     1.60   0.110    -.0578298    .5674256
        Ohio  |   .0764392   .1628711     0.47   0.639    -.2428747    .3957531
    Oklahoma  |  -.0232774   .2224209    -0.10   0.917    -.4593405    .4127857
      Oregon  |   .1910379   .1710392     1.12   0.264    -.1442899    .5263657
Pennsylvania  |   .2114593   .1557805     1.36   0.175    -.0939533    .5168719
Rhode Island  |   .2363255   .2493269     0.95   0.343    -.2524877    .7251387
South Dakota  |  -.0034789   .3079132    -0.01   0.991    -.6071522    .6001944
South Caro..  |  -.1689824   .2145379    -0.79   0.431    -.5895906    .2516258
   Tennessee  |  -.0673426   .1892846    -0.36   0.722    -.4384409    .3037556
       Texas  |   .1773322   .1553047     1.14   0.254    -.1271475     .481812
        Utah  |  -.4622301   .2680093    -1.72   0.085    -.9876707    .0632104
     Vermont  |   .3959974   .1981258     2.00   0.046     .0075655    .7844292
    Virginia  |   .1006037   .1663168     0.60   0.545    -.2254656    .4266731
  Washington  |   .0536431   .1702473     0.32   0.753    -.2801321    .3874183
West Virgi..  |   .1843709   .1943019     0.95   0.343     -.196564    .5653059
   Wisconsin  |   .1526682   .1675184     0.91   0.362    -.1757568    .4810933
     Wyoming  |   .2010651   .2565913     0.78   0.433    -.3019901    .7041203
              |
        _cons |   .2274037   .1456728     1.56   0.119    -.0581923    .5129998
-------------------------------------------------------------------------------

. est store col5

. reg zfed_univ_healthcare zprior_national_over_global highinc higheduc female r
> etirement_age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] 
> if republican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       2.02
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0314
                                                Root MSE          =     .78934

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zprior_nati~l |   -.060905   .0139211    -4.38   0.000    -.0881977   -.0336123
      highinc |  -.0733258   .0304084    -2.41   0.016    -.1329425   -.0137091
     higheduc |   .0907479   .0286506     3.17   0.002     .0345774    .1469184
       female |   .0447693   .0269588     1.66   0.097    -.0080844    .0976229
retirement~ge |  -.0315008   .0370541    -0.85   0.395    -.1041465    .0411449
high_confir~d |   .1498129   .1637269     0.92   0.360    -.1711789    .4708047
        child |  -.0776612   .0338613    -2.29   0.022    -.1440473    -.011275
        alone |  -.0906019   .0351974    -2.57   0.010    -.1596076   -.0215962
        urban |   .0896987   .0377541     2.38   0.018     .0156805    .1637169
              |
State_Recoded |
      Alaska  |   .0359983   .3327296     0.11   0.914    -.6163286    .6883253
     Arizona  |   .2509624   .1590683     1.58   0.115    -.0608962    .5628209
    Arkansas  |  -.2329731   .2259008    -1.03   0.302    -.6758589    .2099128
  California  |   .2125783    .146515     1.45   0.147     -.074669    .4998256
    Colorado  |  -.0896821   .1414572    -0.63   0.526    -.3670134    .1876492
 Connecticut  |   .0720671   .1336163     0.54   0.590    -.1898919     .334026
    Delaware  |  -.3026644   .3235103    -0.94   0.350    -.9369168     .331588
District o..  |    .200908   .1563285     1.29   0.199     -.105579     .507395
     Florida  |   .0377151   .0959724     0.39   0.694    -.1504418    .2258721
     Georgia  |  -.1228159   .1279848    -0.96   0.337    -.3737342    .1281024
      Hawaii  |   .0675101   .2795462     0.24   0.809    -.4805492    .6155694
       Idaho  |   -.158254   .3011861    -0.53   0.599    -.7487391     .432231
    Illinois  |   .1285233   .0959338     1.34   0.180     -.059558    .3166045
     Indiana  |   .0577892   .1214131     0.48   0.634    -.1802449    .2958234
        Iowa  |   .0960094    .194957     0.49   0.622      -.28621    .4782288
      Kansas  |  -.0417016   .2648629    -0.16   0.875    -.5609739    .4775707
    Kentucky  |   .1506905   .1825585     0.83   0.409    -.2072213    .5086024
   Louisiana  |  -.1333843   .2127767    -0.63   0.531    -.5505397    .2837712
       Maine  |    .379501   .1791196     2.12   0.034     .0283312    .7306707
    Maryland  |    .045173   .1187821     0.38   0.704     -.187703    .2780491
Massachuse~s  |  -.0294461    .125211    -0.24   0.814    -.2749262    .2160341
    Michigan  |   .0646008   .1057925     0.61   0.541    -.1428088    .2720105
   Minnesota  |    .119498   .1812181     0.66   0.510    -.2357859    .4747819
 Mississippi  |  -.0378142   .2357722    -0.16   0.873    -.5000532    .4244247
    Missouri  |   .1276874   .1695407     0.75   0.451    -.2047025    .4600773
     Montana  |   .1111988   .2864863     0.39   0.698    -.4504668    .6728644
    Nebraska  |   .2159908    .232242     0.93   0.352    -.2393271    .6713087
      Nevada  |  -.0506254    .150102    -0.34   0.736    -.3449052    .2436544
New Hampsh..  |    .161936   .2102033     0.77   0.441    -.2501744    .5740463
  New Jersey  |  -.0324932   .1144715    -0.28   0.777    -.2569183    .1919319
  New Mexico  |   .0538701   .2480304     0.22   0.828    -.4324015    .5401417
    New York  |   .0555705   .0938102     0.59   0.554    -.1283475    .2394884
North Dakota  |    .142503   .4040981     0.35   0.724    -.6497444    .9347503
North Caro..  |    .262113   .1560913     1.68   0.093     -.043909     .568135
        Ohio  |   .0750658   .1595579     0.47   0.638    -.2377527    .3878842
    Oklahoma  |  -.0289578   .2185417    -0.13   0.895    -.4574159    .3995003
      Oregon  |   .1928834   .1683703     1.15   0.252    -.1372118    .5229787
Pennsylvania  |   .0554877   .0984491     0.56   0.573     -.137525    .2485004
Rhode Island  |   .0995116   .2117983     0.47   0.638    -.3157258    .5147489
South Dakota  |   .0248175   .3075733     0.08   0.936    -.5781897    .6278248
South Caro..  |  -.1881703   .2127539    -0.88   0.377    -.6052812    .2289406
   Tennessee  |  -.2059793   .1456598    -1.41   0.157      -.49155    .0795914
       Texas  |   .1633842   .1515182     1.08   0.281     -.133672    .4604404
        Utah  |  -.6371328   .2387821    -2.67   0.008    -1.105273   -.1689928
     Vermont  |   .3263572   .1545201     2.11   0.035     .0234156    .6292988
    Virginia  |   .0991921   .1630069     0.61   0.543    -.2203881    .4187724
  Washington  |  -.1020706   .1204964    -0.85   0.397    -.3383076    .1341665
West Virgi..  |   .2038489   .1927727     1.06   0.290    -.1740881     .581786
   Wisconsin  |          0  (omitted)
     Wyoming  |   .1881204   .2553665     0.74   0.461    -.3125339    .6887747
              |
        _cons |   .1697725   .1484763     1.14   0.253    -.1213201    .4608652
-------------------------------------------------------------------------------

. est store col6

. 
. reg zfed_univ_healthcare zluck_unfair_agree [pw=Weightvar] if republican==0, r
> obust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(1, 4234)        =      76.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0233
                                                Root MSE          =     .78728

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1278148   .0146338     8.73   0.000     .0991247    .1565048
        _cons |   .3772756   .0139902    26.97   0.000     .3498475    .4047038
-------------------------------------------------------------------------------

. est store col7

. reg zfed_univ_healthcare zluck_unfair_agree i.State_Recoded [pw=Weightvar] if 
> republican==0, robust
(sum of wgt is 4,390.1489825745)

Linear regression                               Number of obs     =      4,236
                                                F(51, 4184)       =       2.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0403
                                                Root MSE          =     .78504

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1274425   .0146394     8.71   0.000     .0987415    .1561434
              |
State_Recoded |
      Alaska  |   .0460772   .3465812     0.13   0.894    -.6334062    .7255605
     Arizona  |   .2118593   .1590913     1.33   0.183     -.100044    .5237627
    Arkansas  |  -.2477685   .2318102    -1.07   0.285    -.7022396    .2067026
  California  |   .2046692   .1472758     1.39   0.165    -.0840695    .4934079
    Colorado  |   .0462841   .1833322     0.25   0.801    -.3131445    .4057127
 Connecticut  |   .1608513   .1761153     0.91   0.361    -.1844283    .5061309
    Delaware  |  -.2038334   .3190331    -0.64   0.523    -.8293078    .4216409
District o..  |   .3113971   .1946593     1.60   0.110    -.0702385    .6930328
     Florida  |   .1621669   .1510689     1.07   0.283    -.1340083    .4583421
     Georgia  |   .0220072   .1726422     0.13   0.899    -.3164632    .3604776
      Hawaii  |   .0240026   .2888437     0.08   0.934    -.5422845    .5902896
       Idaho  |  -.1436607   .3014083    -0.48   0.634    -.7345811    .4472596
    Illinois  |   .2489261   .1514275     1.64   0.100    -.0479523    .5458045
     Indiana  |   .2032273   .1682681     1.21   0.227    -.1266675    .5331221
        Iowa  |   .0702084   .1917799     0.37   0.714    -.3057821    .4461989
      Kansas  |  -.1338642   .2609122    -0.51   0.608    -.6453906    .3776622
    Kentucky  |   .1176874   .1847908     0.64   0.524    -.2446007    .4799756
   Louisiana  |  -.0316116   .2355055    -0.13   0.893    -.4933275    .4301042
       Maine  |   .3310753   .1784798     1.85   0.064    -.0188399    .6809904
    Maryland  |   .1552695   .1649756     0.94   0.347    -.1681703    .4787093
Massachuse~s  |   .0938171    .173298     0.54   0.588    -.2459391    .4335732
    Michigan  |   .1792599   .1575569     1.14   0.255    -.1296353    .4881551
   Minnesota  |   .1057901   .1789085     0.59   0.554    -.2449657    .4565458
 Mississippi  |    .098283   .2600346     0.38   0.705    -.4115229     .608089
    Missouri  |   .0937448   .1696866     0.55   0.581    -.2389312    .4264208
     Montana  |   .0954872   .2800931     0.34   0.733    -.4536441    .6446185
    Nebraska  |   .1656367   .2196571     0.75   0.451    -.2650078    .5962812
      Nevada  |   .1285764   .1945539     0.66   0.509    -.2528525    .5100054
New Hampsh..  |   .1149504   .2142837     0.54   0.592    -.3051595    .5350603
  New Jersey  |   .1045789   .1620284     0.65   0.519    -.2130828    .4222406
  New Mexico  |   .0807454   .2526619     0.32   0.749    -.4146061    .5760969
    New York  |   .1823994    .149901     1.22   0.224    -.1114863     .476285
North Dakota  |   .0568564   .4244645     0.13   0.893    -.7753195    .8890322
North Caro..  |   .2314667   .1566411     1.48   0.140     -.075633    .5385664
        Ohio  |   .0612469   .1604107     0.38   0.703    -.2532432     .375737
    Oklahoma  |  -.0282038   .2205854    -0.13   0.898    -.4606683    .4042608
      Oregon  |   .1423163   .1663941     0.86   0.392    -.1839045    .4685371
Pennsylvania  |   .1863836   .1521739     1.22   0.221     -.111958    .4847252
Rhode Island  |   .1399273   .2413329     0.58   0.562    -.3332134     .613068
South Dakota  |  -.0425114   .3178585    -0.13   0.894    -.6656829    .5806601
South Caro..  |  -.1879855     .21248    -0.88   0.376    -.6045592    .2285883
   Tennessee  |  -.1050131    .188206    -0.56   0.577    -.4739968    .2639705
       Texas  |   .1430885   .1527079     0.94   0.349    -.1563002    .4424771
        Utah  |  -.4896564   .2669689    -1.83   0.067    -1.013057    .0337445
     Vermont  |   .3433974   .2000266     1.72   0.086    -.0487609    .7355557
    Virginia  |   .0642656   .1631257     0.39   0.694    -.2555473    .3840785
  Washington  |   .0398388   .1662831     0.24   0.811    -.2861644     .365842
West Virgi..  |   .1138285   .1891599     0.60   0.547    -.2570253    .4846824
   Wisconsin  |   .1305915   .1654136     0.79   0.430    -.1937071    .4548901
     Wyoming  |   .2108146   .2585688     0.82   0.415    -.2961175    .7177467
              |
        _cons |   .2485019   .1427382     1.74   0.082    -.0313408    .5283446
-------------------------------------------------------------------------------

. est store col8

. reg zfed_univ_healthcare zluck_unfair_agree highinc higheduc female retirement
> _age high_confirmed child alone urban i.State_Recoded [pw=Weightvar] if republ
> ican==0, robust
(sum of wgt is 4,390.1489825745)
note: 50.State_Recoded omitted because of collinearity

Linear regression                               Number of obs     =      4,236
                                                F(58, 4177)       =       2.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0472
                                                Root MSE          =     .78286

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
zluck_unfai~e |   .1243544   .0146662     8.48   0.000     .0956009    .1531079
      highinc |  -.0576169   .0302322    -1.91   0.057     -.116888    .0016542
     higheduc |    .088202   .0283442     3.11   0.002     .0326323    .1437717
       female |   .0291885   .0267748     1.09   0.276    -.0233043    .0816814
retirement~ge |  -.0250511   .0371128    -0.67   0.500     -.097812    .0477098
high_confir~d |   .1292956   .1621443     0.80   0.425    -.1885935    .4471847
        child |  -.0886253   .0336166    -2.64   0.008    -.1545316   -.0227189
        alone |    -.08739    .034838    -2.51   0.012     -.155691    -.019089
        urban |   .0825539   .0377799     2.19   0.029     .0084852    .1566226
              |
State_Recoded |
      Alaska  |   .0484277   .3382045     0.14   0.886     -.614633    .7114884
     Arizona  |    .210245   .1561213     1.35   0.178    -.0958359    .5163259
    Arkansas  |  -.2547443   .2287592    -1.11   0.266     -.703234    .1937454
  California  |   .1914287   .1444899     1.32   0.185    -.0918484    .4747058
    Colorado  |  -.1045446   .1402384    -0.75   0.456    -.3794865    .1703972
 Connecticut  |   .0384819   .1343789     0.29   0.775    -.2249722     .301936
    Delaware  |  -.3213113   .2995814    -1.07   0.284    -.9086502    .2660277
District o..  |   .1476966   .1516282     0.97   0.330    -.1495753    .4449686
     Florida  |   .0184665   .0962186     0.19   0.848    -.1701732    .2071061
     Georgia  |  -.1245469   .1272201    -0.98   0.328     -.373966    .1248722
      Hawaii  |    .022272   .2877094     0.08   0.938    -.5417916    .5863355
       Idaho  |  -.1510594   .2984831    -0.51   0.613    -.7362451    .4341264
    Illinois  |   .1164568   .0969885     1.20   0.230    -.0736923    .3066059
     Indiana  |   .0781468   .1213687     0.64   0.520    -.1598005     .316094
        Iowa  |   .0855691    .188336     0.45   0.650    -.2836697    .4548078
      Kansas  |  -.1177127   .2569797    -0.46   0.647    -.6215296    .3861042
    Kentucky  |   .1312391    .181236     0.72   0.469    -.2240798    .4865581
   Louisiana  |  -.1483969   .2041798    -0.73   0.467    -.5486979    .2519042
       Maine  |   .3273155   .1792337     1.83   0.068     -.024078     .678709
    Maryland  |   .0228776   .1174588     0.19   0.846     -.207404    .2531593
Massachuse~s  |      -.045   .1281937    -0.35   0.726    -.2963279    .2063278
    Michigan  |   .0591759   .1061396     0.56   0.577    -.1489142     .267266
   Minnesota  |   .1157373   .1781533     0.65   0.516     -.233538    .4650125
 Mississippi  |  -.0004873   .2383542    -0.00   0.998    -.4677884    .4668138
    Missouri  |   .0826472   .1677504     0.49   0.622    -.2462328    .4115273
     Montana  |   .1064231   .2782583     0.38   0.702    -.4391112    .6519575
    Nebraska  |   .1725763   .2210256     0.78   0.435    -.2607515    .6059041
      Nevada  |  -.0283289   .1555532    -0.18   0.855    -.3332959    .2766381
New Hampsh..  |   .1174978   .2094984     0.56   0.575    -.2932306    .5282262
  New Jersey  |  -.0325145   .1122411    -0.29   0.772    -.2525667    .1875378
  New Mexico  |   .0711773   .2468234     0.29   0.773    -.4127278    .5550824
    New York  |   .0478521   .0946537     0.51   0.613    -.1377196    .2334237
North Dakota  |   .0649179   .4015315     0.16   0.872    -.7222974    .8521333
North Caro..  |   .2405043    .153915     1.56   0.118    -.0612511    .5422597
        Ohio  |   .0594103   .1576752     0.38   0.706     -.249717    .3685376
    Oklahoma  |  -.0312741   .2165765    -0.14   0.885    -.4558794    .3933311
      Oregon  |   .1453505   .1642523     0.88   0.376    -.1766715    .4673724
Pennsylvania  |   .0494114   .0979914     0.50   0.614    -.1427038    .2415267
Rhode Island  |   .0252511   .2064227     0.12   0.903    -.3794472    .4299494
South Dakota  |  -.0174611   .3147246    -0.06   0.956    -.6344888    .5995665
South Caro..  |  -.2056441   .2113955    -0.97   0.331    -.6200918    .2088036
   Tennessee  |  -.2215424   .1474541    -1.50   0.133    -.5106308     .067546
       Texas  |    .130319   .1497098     0.87   0.384     -.163192    .4238299
        Utah  |  -.6427661   .2395677    -2.68   0.007    -1.112446   -.1730859
     Vermont  |   .2836208   .1623186     1.75   0.081    -.0346099    .6018515
    Virginia  |   .0619533   .1605878     0.39   0.700    -.2528843    .3767908
  Washington  |  -.0964665   .1187017    -0.81   0.416     -.329185     .136252
West Virgi..  |    .132868   .1872788     0.71   0.478     -.234298     .500034
   Wisconsin  |          0  (omitted)
     Wyoming  |   .2033951   .2582317     0.79   0.431    -.3028763    .7096666
              |
        _cons |   .2005539   .1456046     1.38   0.168    -.0849085    .4860163
-------------------------------------------------------------------------------

. est store col9

. 
. esttab col1 col2 col3 col4 col5 col6 col7 col8 col9 using tables/corrhealthnon
> rep.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(zprior_soc_over_self zprior_national_over_global zluck_unfair_agree highi
> nc higheduc female retirement_age high_confirmed child alone urban _cons) ///
> label mtitle("Health care (std.)"  "Health care (std.)" "Health care (std.)" "
> Health care (std.)" "Health care (std.)" "Health care (std.)" "Health care (st
> d.)" "Health care (std.)" "Health care (std.)") ///
> b(3)
(output written to tables/corrhealthnonrep.tex)

. 
. *************************************************************************
. *PRIMING EFFECTS, POLICY, Table S12
. *************************************************************************
. reg zgov_reduce_inequality_agree corona_prime [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.04
                                                Prob > F          =     0.8498
                                                R-squared         =     0.0000
                                                Root MSE          =     1.0001

------------------------------------------------------------------------------
             |               Robust
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0045489   .0240247     0.19   0.850    -.0425457    .0516434
       _cons |  -.0022573   .0171562    -0.13   0.895     -.035888    .0313733
------------------------------------------------------------------------------

. est store col1

. reg zgov_reduce_inequality_agree corona_prime republican highinc higheduc fema
> le retirement_age high_confirmed child alone urban northeast midwest south [pw
> =Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     134.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2320
                                                Root MSE          =     .89056

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |    .014019   .0226937     0.62   0.537    -.0304672    .0585052
   republican |   -.939283   .0249714   -37.61   0.000    -.9882342   -.8903318
      highinc |  -.1038592   .0253658    -4.09   0.000    -.1535836   -.0541348
     higheduc |  -.0405158   .0248374    -1.63   0.103    -.0892043    .0081727
       female |  -.0056397   .0229268    -0.25   0.806    -.0505829    .0393035
retirement~ge |  -.2137786   .0306601    -6.97   0.000    -.2738814   -.1536759
high_confir~d |   -.046768    .025887    -1.81   0.071    -.0975141    .0039781
        child |   .1092784   .0287341     3.80   0.000     .0529512    .1656057
        alone |   .0041066    .029008     0.14   0.887    -.0527577    .0609709
        urban |   .0706627   .0271363     2.60   0.009     .0174677    .1238577
    northeast |     .10439   .0390417     2.67   0.008     .0278568    .1809231
      midwest |  -.0215477   .0353913    -0.61   0.543    -.0909249    .0478296
        south |  -.0321335   .0313922    -1.02   0.306    -.0936715    .0294045
        _cons |   .3962536    .041247     9.61   0.000     .3153975    .4771097
-------------------------------------------------------------------------------

. est store col2

. 
. reg zfed_univ_healthcare corona_prime [pw=Weightvar], robust
(sum of wgt is 8,035.83568177922)

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.53
                                                Prob > F          =     0.4683
                                                R-squared         =     0.0001
                                                Root MSE          =          1

------------------------------------------------------------------------------
             |               Robust
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0174038   .0239932    -0.73   0.468    -.0644365     .029629
       _cons |   .0086364   .0170199     0.51   0.612     -.024727    .0419998
------------------------------------------------------------------------------

. est store col3

. reg zfed_univ_healthcare corona_prime republican highinc higheduc female retir
> ement_age high_confirmed child alone urban northeast midwest south [pw=Weightv
> ar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     186.67
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2724
                                                Root MSE          =     .85678

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0014453   .0219025    -0.07   0.947    -.0443807    .0414901
   republican |  -1.016063   .0239181   -42.48   0.000     -1.06295   -.9691769
      highinc |  -.0689636   .0242206    -2.85   0.004    -.1164431   -.0214842
     higheduc |   .0324024   .0234709     1.38   0.167    -.0136075    .0784122
       female |   .0076935   .0221605     0.35   0.728    -.0357476    .0511346
retirement~ge |   -.188329   .0272094    -6.92   0.000    -.2416673   -.1349907
high_confir~d |   .0395086   .0251664     1.57   0.116    -.0098249     .088842
        child |   .0567416   .0282814     2.01   0.045     .0013019    .1121813
        alone |   -.037972   .0286968    -1.32   0.186    -.0942262    .0182822
        urban |   .1230772   .0263215     4.68   0.000     .0714795     .174675
    northeast |   .0496806    .038033     1.31   0.192    -.0248752    .1242364
      midwest |  -.0300412   .0336002    -0.89   0.371    -.0959075    .0358251
        south |  -.0386578   .0303835    -1.27   0.203    -.0982184    .0209028
        _cons |   .3210737   .0411256     7.81   0.000     .2404556    .4016919
-------------------------------------------------------------------------------

. est store col4

. 
. esttab col1 col2 col3 col4 using tables/primingpolicy.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime retirement_age female highinc republican higheduc child alon
> e urban high_confirmed northeast midwest south _cons) ///
> label mtitle("Redistr. (std.)" "Redistr (std.)" "Healthcare (std.)"  "Healthca
> re (std.)") ///
> b(3)
(output written to tables/primingpolicy.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, REDISTRIBUTION, Table S13
. *************************************************************************
. reg zgov_reduce_inequality_agree corona_prime  republicanXcorona_prime republi
> can highinc higheduc female retirement_age high_confirmed child alone urban no
> rtheast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2328
                                                Root MSE          =     .89017

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0318379   .0263885    -1.21   0.228     -.083567    .0198911
republicanX~e |   .1170432   .0487533     2.40   0.016     .0214725    .2126138
   republican |  -.9974006    .034701   -28.74   0.000    -1.065425   -.9293765
      highinc |  -.1055696   .0253638    -4.16   0.000    -.1552901   -.0558492
     higheduc |  -.0385001   .0248215    -1.55   0.121    -.0871575    .0101573
       female |  -.0055433   .0229113    -0.24   0.809    -.0504561    .0393695
retirement~ge |  -.2131062   .0306318    -6.96   0.000    -.2731536   -.1530588
high_confir~d |  -.0463762   .0258795    -1.79   0.073    -.0971076    .0043552
        child |   .1087771   .0287218     3.79   0.000     .0524739    .1650802
        alone |   .0026146   .0290253     0.09   0.928    -.0542834    .0595126
        urban |   .0700608   .0270944     2.59   0.010      .016948    .1231737
    northeast |   .1064837   .0389903     2.73   0.006     .0300512    .1829161
      midwest |   -.019898   .0353665    -0.56   0.574    -.0892266    .0494307
        south |  -.0309705   .0313634    -0.99   0.323    -.0924519    .0305109
        _cons |    .417756   .0414726    10.07   0.000     .3364575    .4990544
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0852052   .0409529     2.08   0.038     .0049255    .1654849
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .08520522

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04095291

. est store col1

. 
. reg zgov_reduce_inequality_agree corona_prime highincXcorona_prime republican 
> highinc higheduc female retirement_age high_confirmed child alone urban northe
> ast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2322
                                                Root MSE          =     .89051

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0415654   .0277152     1.50   0.134    -.0127644    .0958953
highincXcor~e |  -.0558924   .0455089    -1.23   0.219    -.1451032    .0333183
   republican |  -.9389599   .0249812   -37.59   0.000    -.9879304   -.8899894
      highinc |  -.0761196   .0334235    -2.28   0.023    -.1416395   -.0105997
     higheduc |  -.0408785   .0248252    -1.65   0.100    -.0895431    .0077861
       female |  -.0057442   .0229245    -0.25   0.802    -.0506829    .0391945
retirement~ge |  -.2129459    .030658    -6.95   0.000    -.2730445   -.1528474
high_confir~d |  -.0471193   .0258869    -1.82   0.069    -.0978652    .0036266
        child |   .1095799   .0287258     3.81   0.000      .053269    .1658908
        alone |   .0046532   .0289972     0.16   0.873    -.0521898    .0614962
        urban |   .0708575   .0271302     2.61   0.009     .0176744    .1240407
    northeast |    .104299   .0390617     2.67   0.008     .0277266    .1808714
      midwest |  -.0204892   .0354264    -0.58   0.563    -.0899353    .0489569
        south |  -.0309745   .0314163    -0.99   0.324    -.0925595    .0306106
        _cons |   .3815547   .0421968     9.04   0.000     .2988366    .4642728
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.014327   .0361234    -0.40   0.692    -.0851393    .0564853
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.014327

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03612335

. est store col2

. 
. reg zgov_reduce_inequality_agree corona_prime higheducXcorona_prime republican
>  highinc higheduc female retirement_age high_confirmed child alone urban north
> east midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2320
                                                Root MSE          =     .89062

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0143889   .0301399     0.48   0.633     -.044694    .0734719
higheducXco~e |  -.0007884   .0455893    -0.02   0.986    -.0901567    .0885799
   republican |  -.9392927   .0249774   -37.61   0.000    -.9882557   -.8903297
      highinc |  -.1038618   .0253668    -4.09   0.000    -.1535882   -.0541354
     higheduc |  -.0401263   .0331814    -1.21   0.227    -.1051716    .0249191
       female |  -.0056387   .0229286    -0.25   0.806    -.0505854     .039308
retirement~ge |  -.2137783   .0306619    -6.97   0.000    -.2738847    -.153672
high_confir~d |  -.0467742   .0258882    -1.81   0.071    -.0975226    .0039742
        child |   .1092823   .0287309     3.80   0.000     .0529614    .1656032
        alone |   .0041121   .0290073     0.14   0.887    -.0527507    .0609749
        urban |   .0706569   .0271294     2.60   0.009     .0174754    .1238385
    northeast |   .1044033   .0390559     2.67   0.008     .0278423    .1809643
      midwest |  -.0215406   .0353848    -0.61   0.543    -.0909051    .0478239
        south |  -.0321253   .0313867    -1.02   0.306    -.0936524    .0294018
        _cons |   .3960752   .0422742     9.37   0.000     .3132054    .4789449
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0136005   .0342534     0.40   0.691    -.0535461    .0807472
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01360054

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03425339

. est store col3

. 
. reg zgov_reduce_inequality_agree corona_prime femaleXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2320
                                                Root MSE          =     .89062

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0124436     .03411     0.36   0.715     -.054422    .0793091
femaleXcoro~e |   .0030833   .0454066     0.07   0.946     -.085927    .0920936
   republican |  -.9392785   .0249743   -37.61   0.000    -.9882355   -.8903215
      highinc |  -.1038475   .0253675    -4.09   0.000    -.1535752   -.0541198
     higheduc |  -.0405266   .0248393    -1.63   0.103     -.089219    .0081657
       female |   -.007154    .031595    -0.23   0.821    -.0690895    .0547815
retirement~ge |  -.2137639   .0306741    -6.97   0.000     -.273894   -.1536338
high_confir~d |  -.0468022   .0258803    -1.81   0.071    -.0975351    .0039308
        child |   .1092401    .028724     3.80   0.000     .0529326    .1655476
        alone |    .004105   .0290105     0.14   0.887    -.0527641    .0609741
        urban |   .0706864   .0271503     2.60   0.009     .0174638     .123909
    northeast |   .1044509   .0390158     2.68   0.007     .0279684    .1809333
      midwest |  -.0214987   .0353716    -0.61   0.543    -.0908374    .0478399
        south |  -.0321104   .0313954    -1.02   0.306    -.0936545    .0294337
        _cons |   .3969938    .042677     9.30   0.000     .3133345    .4806531
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0155269   .0300459     0.52   0.605    -.0433719    .0744257
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01552688

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03004591

. est store col4

. 
. reg zgov_reduce_inequality_agree corona_prime retirement_ageXcorona_prime repu
> blican highinc higheduc female retirement_age high_confirmed child alone urban
>  northeast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2322
                                                Root MSE          =      .8905

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0003574   .0250409     0.01   0.989    -.0487301     .049445
retirement~me |   .0774874   .0591915     1.31   0.191    -.0385453    .1935201
   republican |  -.9389264   .0249769   -37.59   0.000    -.9878885   -.8899643
      highinc |  -.1046413    .025381    -4.12   0.000    -.1543954   -.0548871
     higheduc |  -.0401615    .024842    -1.62   0.106     -.088859     .008536
       female |  -.0053005   .0229353    -0.23   0.817    -.0502604    .0396594
retirement~ge |  -.2518707   .0416675    -6.04   0.000    -.3335512   -.1701902
high_confir~d |  -.0474559   .0258712    -1.83   0.067    -.0981709    .0032591
        child |   .1099153   .0287156     3.83   0.000     .0536244    .1662062
        alone |   .0042387    .029002     0.15   0.884    -.0526137    .0610912
        urban |   .0705415   .0271333     2.60   0.009     .0173524    .1237307
    northeast |   .1044701    .039065     2.67   0.008     .0278912    .1810491
      midwest |  -.0222202   .0353903    -0.63   0.530    -.0915954    .0471551
        south |  -.0325269   .0313743    -1.04   0.300    -.0940297    .0289759
        _cons |    .403377   .0414545     9.73   0.000     .3221141      .48464
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0778449   .0536374     1.45   0.147    -.0273001    .1829898
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .07784486

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .05363738

. est store col5

. 
. reg zgov_reduce_inequality_agree corona_prime high_confirmedXcorona_prime repu
> blican highinc higheduc female retirement_age high_confirmed child alone urban
>  northeast midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     126.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2323
                                                Root MSE          =     .89042

-------------------------------------------------------------------------------
              |               Robust
zgov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0250316   .0328652    -0.76   0.446    -.0894571    .0393939
high_confir~e |   .0769643    .045334     1.70   0.090    -.0119037    .1658322
   republican |  -.9385656   .0249779   -37.58   0.000    -.9875295   -.8896016
      highinc |  -.1032068   .0253662    -4.07   0.000     -.152932   -.0534816
     higheduc |  -.0405155   .0248357    -1.63   0.103    -.0892008    .0081698
       female |  -.0059088   .0229191    -0.26   0.797     -.050837    .0390194
retirement~ge |  -.2149445   .0307049    -7.00   0.000    -.2751351    -.154754
high_confir~d |  -.0849897    .033859    -2.51   0.012    -.1513633   -.0186161
        child |   .1095581   .0287122     3.82   0.000     .0532737    .1658424
        alone |   .0048847    .029029     0.17   0.866    -.0520206      .06179
        urban |   .0708261   .0271421     2.61   0.009     .0176197    .1240326
    northeast |   .1054618   .0390269     2.70   0.007     .0289577    .1819659
      midwest |  -.0218446   .0353752    -0.62   0.537    -.0911904    .0475012
        south |  -.0318613   .0313901    -1.02   0.310     -.093395    .0296724
        _cons |   .4148436   .0425651     9.75   0.000     .3314035    .4982838
-------------------------------------------------------------------------------

. lincom corona_prime + high_confirmedXcorona_prime

 ( 1)  corona_prime + high_confirmedXcorona_prime = 0

------------------------------------------------------------------------------
zgov_reduc~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0519327   .0312785     1.66   0.097    -.0093824    .1132478
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .05193267

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03127854

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/heterogeneity_zredistr.tex, 
> ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder+ Interaction)" "Observations" "
> \(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime high_confirmedXcorona_p
> rime _cons) ///
> label mtitle("Redistribution (std.)" "Redistribution (std.)" "Redistribution (
> std.)" "Redistribution (std.)" "Redistribution (std.)" "Redistribution (std.)"
> ) ///
> b(3)
(output written to tables/heterogeneity_zredistr.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, HEALTHCARE, Table S14
. *************************************************************************
. reg zfed_univ_healthcare corona_prime  republicanXcorona_prime republican high
> inc higheduc female retirement_age high_confirmed child alone urban northeast 
> midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2724
                                                Root MSE          =     .85684

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0015721    .026878    -0.06   0.953    -.0542608    .0511166
republicanX~e |   .0003237   .0459039     0.01   0.994    -.0896613    .0903088
   republican |  -1.016224   .0333246   -30.49   0.000     -1.08155    -.950898
      highinc |  -.0689684   .0242288    -2.85   0.004    -.1164639   -.0214728
     higheduc |   .0324079   .0234712     1.38   0.167    -.0136025    .0784183
       female |   .0076937   .0221622     0.35   0.728    -.0357506     .051138
retirement~ge |  -.1883272   .0272183    -6.92   0.000     -.241683   -.1349713
high_confir~d |   .0395096   .0251746     1.57   0.117      -.00984    .0888593
        child |   .0567402   .0282766     2.01   0.045     .0013097    .1121707
        alone |  -.0379761   .0287016    -1.32   0.186    -.0942396    .0182874
        urban |   .1230756   .0263239     4.68   0.000     .0714731     .174678
    northeast |   .0496864   .0380119     1.31   0.191    -.0248281    .1242008
      midwest |  -.0300366    .033565    -0.89   0.371    -.0958338    .0357606
        south |  -.0386546   .0303625    -1.27   0.203    -.0981739    .0208648
        _cons |   .3211332   .0419344     7.66   0.000     .2389294     .403337
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0012484   .0372118    -0.03   0.973    -.0741944    .0716977
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.00124838

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03721182

. est store col1

. 
. reg zfed_univ_healthcare corona_prime highincXcorona_prime republican highinc 
> higheduc female retirement_age high_confirmed child alone urban northeast midw
> est south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2724
                                                Root MSE          =     .85684

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0048311   .0277573    -0.17   0.862    -.0592435    .0495813
highincXcor~e |   .0068699   .0439615     0.16   0.876    -.0793075    .0930473
   republican |  -1.016103   .0239175   -42.48   0.000    -1.062988   -.9692178
      highinc |  -.0723732   .0327951    -2.21   0.027    -.1366612   -.0080851
     higheduc |   .0324469    .023464     1.38   0.167    -.0135493    .0784432
       female |   .0077063   .0221625     0.35   0.728    -.0357387    .0511514
retirement~ge |  -.1884314   .0272194    -6.92   0.000    -.2417894   -.1350734
high_confir~d |   .0395517   .0251755     1.57   0.116    -.0097997    .0889032
        child |   .0567045   .0282774     2.01   0.045     .0012726    .1121365
        alone |  -.0380392   .0287012    -1.33   0.185     -.094302    .0182237
        urban |   .1230533   .0263161     4.68   0.000      .071466    .1746405
    northeast |   .0496918   .0380334     1.31   0.191    -.0248648    .1242483
      midwest |  -.0301713   .0335922    -0.90   0.369    -.0960219    .0356793
        south |  -.0388003   .0303777    -1.28   0.202    -.0983493    .0207488
        _cons |   .3228804    .041742     7.74   0.000      .241054    .4047069
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0020388   .0340701     0.06   0.952    -.0647485    .0688261
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .00203881

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03407008

. est store col2

. 
. reg zfed_univ_healthcare corona_prime higheducXcorona_prime republican highinc
>  higheduc female retirement_age high_confirmed child alone urban northeast mid
> west south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.57
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =      .8568

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0147875   .0297394     0.50   0.619    -.0435103    .0730854
higheducXco~e |   -.034595    .043975    -0.79   0.431    -.1207989     .051609
   republican |  -1.016491   .0239235   -42.49   0.000    -1.063388   -.9695942
      highinc |  -.0690793   .0242179    -2.85   0.004    -.1165535   -.0216051
     higheduc |   .0494942   .0322123     1.54   0.124    -.0136514    .1126398
       female |   .0077371   .0221597     0.35   0.727    -.0357024    .0511765
retirement~ge |  -.1883152   .0272205    -6.92   0.000    -.2416753   -.1349551
high_confir~d |   .0392378    .025175     1.56   0.119    -.0101125    .0885882
        child |   .0569133   .0282739     2.01   0.044     .0014882    .1123384
        alone |  -.0377304   .0286971    -1.31   0.189    -.0939852    .0185244
        urban |   .1228241   .0263336     4.66   0.000     .0712026    .1744456
    northeast |   .0502648   .0380347     1.32   0.186    -.0242943    .1248238
      midwest |   -.029732   .0335825    -0.89   0.376    -.0955635    .0360995
        south |  -.0382967    .030375    -1.26   0.207    -.0978406    .0212472
        _cons |   .3132449   .0418393     7.49   0.000     .2312276    .3952621
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0198074   .0323796    -0.61   0.541    -.0832809     .043666
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.01980745

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03237956

. est store col3

. 
. reg zfed_univ_healthcare corona_prime femaleXcorona_prime republican highinc h
> igheduc female retirement_age high_confirmed child alone urban northeast midwe
> st south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =     .85682

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   -.015707   .0324237    -0.48   0.628    -.0792669    .0478529
femaleXcoro~e |   .0279119   .0438525     0.64   0.524    -.0580519    .1138757
   republican |  -1.016023   .0239195   -42.48   0.000    -1.062912   -.9691334
      highinc |  -.0688577    .024219    -2.84   0.004    -.1163341   -.0213813
     higheduc |   .0323041   .0234641     1.38   0.169    -.0136923    .0783005
       female |  -.0060147     .03124    -0.19   0.847    -.0672543     .055225
retirement~ge |  -.1881956   .0272184    -6.91   0.000    -.2415517   -.1348396
high_confir~d |   .0391994   .0251597     1.56   0.119     -.010121    .0885199
        child |   .0563947   .0282694     1.99   0.046     .0009784     .111811
        alone |  -.0379868    .028688    -1.32   0.186    -.0942237    .0182501
        urban |    .123292   .0263274     4.68   0.000     .0716825    .1749015
    northeast |    .050232   .0380288     1.32   0.187    -.0243156    .1247796
      midwest |  -.0295982   .0335815    -0.88   0.378    -.0954278    .0362313
        south |  -.0384484   .0303926    -1.27   0.206    -.0980268    .0211299
        _cons |   .3277749   .0425468     7.70   0.000     .2443706    .4111791
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0122049   .0295508     0.41   0.680    -.0457234    .0701332
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .0122049

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02955085

. est store col4

. 
. reg zfed_univ_healthcare corona_prime retirement_ageXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.55
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =     .85678

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0113768   .0247588    -0.46   0.646    -.0599113    .0371576
retirement~me |   .0563312   .0519704     1.08   0.278     -.045546    .1582084
   republican |  -1.015804    .023921   -42.47   0.000    -1.062696    -.968912
      highinc |  -.0695322    .024242    -2.87   0.004    -.1170536   -.0220108
     higheduc |   .0326599   .0234752     1.39   0.164    -.0133584    .0786782
       female |     .00794   .0221654     0.36   0.720    -.0355105    .0513906
retirement~ge |  -.2160209   .0372625    -5.80   0.000    -.2890663   -.1429755
high_confir~d |   .0390085   .0251572     1.55   0.121    -.0103069    .0883239
        child |   .0572046   .0282837     2.02   0.043     .0017603    .1126489
        alone |  -.0378759    .028692    -1.32   0.187    -.0941207    .0183689
        urban |   .1229892    .026319     4.67   0.000     .0713963    .1745821
    northeast |   .0497389   .0380433     1.31   0.191    -.0248372    .1243149
      midwest |  -.0305301   .0336374    -0.91   0.364    -.0964692     .035409
        south |  -.0389438   .0303964    -1.28   0.200    -.0985296     .020642
        _cons |   .3262523   .0416349     7.84   0.000     .2446357    .4078689
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0449544   .0456267     0.99   0.325    -.0444873    .1343961
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .04495438

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04562671

. est store col5

. 
. reg zfed_univ_healthcare corona_prime high_confirmedXcorona_prime republican h
> ighinc higheduc female retirement_age high_confirmed child alone urban northea
> st midwest south [pw=Weightvar], robust
(sum of wgt is 7,213.05472456784)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     175.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2731
                                                Root MSE          =     .85644

-------------------------------------------------------------------------------
              |               Robust
zfed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0547172   .0313203    -1.75   0.081    -.1161141    .0066797
high_confir~e |   .1049929    .043905     2.39   0.017     .0189263    .1910595
   republican |  -1.015085   .0239061   -42.46   0.000    -1.061948   -.9682218
      highinc |  -.0680736   .0242315    -2.81   0.005    -.1155744   -.0205729
     higheduc |   .0324028   .0234629     1.38   0.167    -.0135914     .078397
       female |   .0073264   .0221454     0.33   0.741    -.0360851    .0507379
retirement~ge |  -.1899195   .0272291    -6.97   0.000    -.2432966   -.1365424
high_confir~d |  -.0126326   .0334524    -0.38   0.706    -.0782091    .0529439
        child |   .0571231   .0282514     2.02   0.043     .0017421    .1125041
        alone |  -.0369105   .0286998    -1.29   0.198    -.0931706    .0193496
        urban |   .1233002   .0263377     4.68   0.000     .0716707    .1749298
    northeast |   .0511428   .0379926     1.35   0.178    -.0233338    .1256194
      midwest |  -.0304463   .0335536    -0.91   0.364    -.0962212    .0353286
        south |  -.0382864   .0303909    -1.26   0.208    -.0978615    .0212887
        _cons |   .3464339   .0423777     8.17   0.000     .2633612    .4295066
-------------------------------------------------------------------------------

. lincom corona_prime + high_confirmedXcorona_prime

 ( 1)  corona_prime + high_confirmedXcorona_prime = 0

------------------------------------------------------------------------------
zfed_univ_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0502757   .0306864     1.64   0.101    -.0098785    .1104299
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .0502757

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03068636

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/heterogeneity_zhealth.tex, /
> //
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder+ Interac.)" "Observations" "\(R
> ^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime high_confirmedXcorona_p
> rime _cons) ///
> label mtitle("Health care (std.)" "Health care (std.)" "Health care (std.)" "H
> ealth care (std.)" "Health care (std.)" "Health care (std.)") ///
> b(3)
(output written to tables/heterogeneity_zhealth.tex)

. 
. *****************************************
. *Multiple hypothesis testing, Table S15
. ********************************************
. *Change of names because of STATA restrictions on variable length
. gen znational=zprior_national_over_global
(3,303 missing values generated)

. gen cp=corona_prime
(3,303 missing values generated)

. 
. *rwolf zluck_unfair_agree zluck_determ_agree zprior_soc_over_self zcompassion_
> agree znational znoborders_agree [pw=Weightvar], indepvar(cp) method(regress) 
> controls(retirement_age female highinc republican higheduc child alone urban h
> igh_confirmed northeast midwest south) reps(9999)
. 
end of do-file

. do "/home/sameos/Documents/gits/mmnyt/supplementary_information_C.do"

. capture log close
