--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/sameos/Documents/gits/mmnyt/supplementary_information_C.log
  log type:  text
 opened on:  11 May 2020, 13:32:10

. 
. /* 
> Need to have "esttab" and rwolf installed: 
> net install st0085_2.pkg        
> ssc install rwolf
> */ 
. 
. *Loading data:  
. insheet using data/corona_status_March-26.csv, clear
(5 vars, 51 obs)

. tempfile coronastat26

. save `coronastat26'
file /tmp/St10681.000001 saved

. 
. use data/processed/final_ipsos_cleaned.dta, clear

. merge m:1 state using `coronastat26'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,419  (_merge==3)
    -----------------------------------------

. 
. est clear

. 
. ******************
. *Extra variables
. ******************
. gen prior_soc_over_self=10-prior_self_over_soc
(3,303 missing values generated)

. gen prior_global_over_national=10-prior_national_over_global
(3,303 missing values generated)

. 
. label variable corona_prime "COVID-19 reminder"

. ******************
. *Interactions
. *****************
. gen republicanXcorona_prime=republican*corona_prime
(4,180 missing values generated)

. label variable republicanXcorona_prime "Republican $\times$"

. gen highincXcorona_prime=highinc*corona_prime
(3,303 missing values generated)

. label variable highincXcorona_prime "High inc. $\times$"

. gen higheducXcorona_prime=higheduc*corona_prime
(3,303 missing values generated)

. label variable higheducXcorona_prime "High educ. $\times$"

. gen retirement_ageXcorona_prime=retirement_age*corona_prime
(3,303 missing values generated)

. label variable retirement_ageXcorona_prime "Retirement age $\times$"

. gen femaleXcorona_prime=female*corona_prime
(3,303 missing values generated)

. label variable femaleXcorona_prime "Female $\times$"

. 
. ********************
. *Standardisations
. ********************
. sum luck_unfair_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT3. To what extent do you agree with the
               following statement:"It is unf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            2              1       Obs               8,116
25%            3              1       Sum of Wgt.  8,035.8357

50%            4                      Mean            3.65935
                        Largest       Std. Dev.      1.117576
75%            5              5
90%            5              5       Variance       1.248976
95%            5              5       Skewness      -.5172679
99%            5              5       Kurtosis       2.574561

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  3.659350339828534
                r(Var) =  1.248976195432858
                 r(sd) =  1.117576035638228
           r(skewness) =  -.517267890422173
           r(kurtosis) =  2.574560592286538
                r(sum) =  29405.93803292505
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  2
                r(p10) =  2
                r(p25) =  3
                r(p50) =  4
                r(p75) =  5
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen zluck_unfair_agree=(luck_unfair_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum luck_determ_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT4. To what extent do you agree with the
               following statement:"Luck is a
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            2              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.868432
                        Largest       Std. Dev.      1.193501
75%            4              5
90%            4              5       Variance       1.424444
95%            5              5       Skewness      -.0373368
99%            5              5       Kurtosis       2.030352

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.868431773921706
                r(Var) =  1.424444343189724
                 r(sd) =  1.193500876912005
           r(skewness) =  -.0373367939207467
           r(kurtosis) =  2.030352251060175
                r(sum) =  23050.24639962931
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  2
                r(p50) =  3
                r(p75) =  4
                r(p90) =  4
                r(p95) =  5
                r(p99) =  5

. gen zluck_determ_agree=(luck_determ_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum prior_soc_over_self [weight=Weightvar], detail
(analytic weights assumed)

                     prior_soc_over_self
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            2              0       Sum of Wgt.  8,035.8357

50%            4                      Mean           3.565212
                        Largest       Std. Dev.      2.322689
75%            5             10
90%            6             10       Variance       5.394886
95%            7             10       Skewness       .2848072
99%           10             10       Kurtosis       2.920235

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  3.565212042720057
                r(Var) =  5.394885880631241
                 r(sd) =  2.322689363783121
           r(skewness) =  .2848072472458314
           r(kurtosis) =  2.920234987032756
                r(sum) =  28649.45814599882
                r(min) =  0
                r(max) =  10
                 r(p1) =  0
                 r(p5) =  0
                r(p10) =  0
                r(p25) =  2
                r(p50) =  4
                r(p75) =  5
                r(p90) =  6
                r(p95) =  7
                r(p99) =  10

. gen zprior_soc_over_self=(prior_soc_over_self-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum compassion_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT6. To what extent do you agree with the
               following statement:"Compassio
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            3              1       Obs               8,116
25%            4              1       Sum of Wgt.  8,035.8357

50%            4                      Mean            4.03994
                        Largest       Std. Dev.      .8809639
75%            5              5
90%            5              5       Variance       .7760974
95%            5              5       Skewness      -.8567095
99%            5              5       Kurtosis       3.672765

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  4.039940188427707
                r(Var) =  .7760973717213281
                 r(sd) =  .8809638878644959
           r(skewness) =  -.8567095462010427
           r(kurtosis) =  3.672765447417161
                r(sum) =  32464.29551842124
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  2
                r(p10) =  3
                r(p25) =  4
                r(p50) =  4
                r(p75) =  5
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen zcompassion_agree=(compassion_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum prior_global_over_national [weight=Weightvar], detail
(analytic weights assumed)

                 prior_global_over_national
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            1              0       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.938087
                        Largest       Std. Dev.      2.383245
75%            5             10
90%            6             10       Variance       5.679856
95%            7             10       Skewness       .6560286
99%           10             10       Kurtosis       3.148516

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.938087021908494
                r(Var) =  5.67985588568293
                 r(sd) =  2.383244822858728
           r(skewness) =  .6560285519746358
           r(kurtosis) =  3.148515786195783
                r(sum) =  23609.98452682473
                r(min) =  0
                r(max) =  10
                 r(p1) =  0
                 r(p5) =  0
                r(p10) =  0
                r(p25) =  1
                r(p50) =  3
                r(p75) =  5
                r(p90) =  6
                r(p95) =  7
                r(p99) =  10

. gen zprior_global_over_national=(prior_global_over_national-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum noborders_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT8. To what extent do you agree with the
               following statement:"I wish th
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            1              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.697935
                        Largest       Std. Dev.      1.341706
75%            4              5
90%            5              5       Variance       1.800174
95%            5              5       Skewness       .2083494
99%            5              5       Kurtosis       1.857193

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.69793468998817
                r(Var) =  1.800174168875804
                 r(sd) =  1.341705693837439
           r(skewness) =  .2083494317119766
           r(kurtosis) =  1.857192804806353
                r(sum) =  21680.1598489169
                r(min) =  1
                r(max) =  5
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  1
                r(p50) =  3
                r(p75) =  4
                r(p90) =  5
                r(p95) =  5
                r(p99) =  5

. gen znoborders_agree=(noborders_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum gov_reduce_inequality_agree [weight=Weightvar], detail
(analytic weights assumed)

      QTREATMENT9. To what extent do you agree with the
               following statement:"In the US
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               8,116
25%            2              1       Sum of Wgt.  8,035.8357

50%            3                      Mean           2.362846
                        Largest       Std. Dev.      .7762263
75%            3              3
90%            3              3       Variance       .6025273
95%            3              3       Skewness      -.7286359
99%            3              3       Kurtosis       2.026137

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  2.362845904246193
                r(Var) =  .6025273234795642
                 r(sd) =  .7762263352138757
           r(skewness) =  -.7286358840747073
           r(kurtosis) =  2.026137364766178
                r(sum) =  18987.44142788745
                r(min) =  1
                r(max) =  3
                 r(p1) =  1
                 r(p5) =  1
                r(p10) =  1
                r(p25) =  2
                r(p50) =  3
                r(p75) =  3
                r(p90) =  3
                r(p95) =  3
                r(p99) =  3

. gen zgov_reduce_inequality_agree=(gov_reduce_inequality_agree-r(mean))/r(sd)
(3,303 missing values generated)

. 
. sum fed_univ_healthcare [weight=Weightvar], detail
(analytic weights assumed)

           QGDW5A. Is it the federal government's
          responsibility to make sure all Americans
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               8,116
25%            0              0       Sum of Wgt.  8,035.8357

50%            1                      Mean           .6270628
                        Largest       Std. Dev.      .4836154
75%            1              1
90%            1              1       Variance       .2338839
95%            1              1       Skewness      -.5255027
99%            1              1       Kurtosis       1.276153

. return list

scalars:
                  r(N) =  8116
              r(sum_w) =  8035.835681779222
               r(mean) =  .6270627681621332
                r(Var) =  .2338838705751888
                 r(sd) =  .4836154159817373
           r(skewness) =  -.5255026725971071
           r(kurtosis) =  1.276153058906696
                r(sum) =  5038.973367112522
                r(min) =  0
                r(max) =  1
                 r(p1) =  0
                 r(p5) =  0
                r(p10) =  0
                r(p25) =  0
                r(p50) =  1
                r(p75) =  1
                r(p90) =  1
                r(p95) =  1
                r(p99) =  1

. gen zfed_univ_healthcare=(fed_univ_healthcare-r(mean))/r(sd)
(3,303 missing values generated)

. 
. ********************
. *Indexes
. ********************
. *Hyp 1 and 2:
. gen luck_unfair_determines_index=zluck_unfair_agree+zluck_determ_agree
(3,303 missing values generated)

. 
. *Hyp 3:
. gen redistribution_healthcare_index=zgov_reduce_inequality_agree+zfed_univ_hea
> lthcare
(3,303 missing values generated)

. 
. *Hyp 4:
. gen solidarity_compassion_index=zcompassion_agree+zprior_soc_over_self
(3,303 missing values generated)

. 
. *Hyp 5:
. gen noborders_globalprior_index=znoborders_agree+zprior_global_over_national
(3,303 missing values generated)

. 
. *****************
. *Confirmed Covid-19 infected state per person*100, March 26th
. *****************
. gen infected=(confirmed/pop2019)*100

. label variable infected "Confirmed cases"

. 
. sum infected [weight=Weightvar], detail
(analytic weights assumed)

                       Confirmed cases
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0038255       .0029015
 5%     .0053904       .0029015
10%     .0053904       .0029015       Obs              11,419
25%     .0074257       .0029015       Sum of Wgt.      11,419

50%     .0100757                      Mean           .0259085
                        Largest       Std. Dev.      .0454917
75%     .0162962       .1947047
90%     .0495612       .1947047       Variance       .0020695
95%     .1947047       .1947047       Skewness       3.167026
99%     .1947047       .1947047       Kurtosis       11.80898

. return list

scalars:
                  r(N) =  11419
              r(sum_w) =  11419.00000000001
               r(mean) =  .0259084632794623
                r(Var) =  .0020694979062797
                 r(sd) =  .0454917344830875
           r(skewness) =  3.167026459749059
           r(kurtosis) =  11.80898036725776
                r(sum) =  295.8487421881802
                r(min) =  .002901547588408
                r(max) =  .1947047114372253
                 r(p1) =  .0038254598621279
                 r(p5) =  .0053904210217297
                r(p10) =  .0053904210217297
                r(p25) =  .0074257212691009
                r(p50) =  .0100756706669927
                r(p75) =  .0162962265312672
                r(p90) =  .0495612397789955
                r(p95) =  .1947047114372253
                r(p99) =  .1947047114372253

. *Weighted median confirmed cases, 0.01007567
. gen high_confirmed26=0

. replace high_confirmed26=1 if infected>0.01007567
(5,961 real changes made)

. 
. label variable high_confirmed26 "High confirmed 26"

. gen high_confirmed26Xcorona_prime=high_confirmed26*corona_prime
(3,303 missing values generated)

. label variable high_confirmed26Xcorona_prime "High confirmed 26*Corona Prime"

. 
. *************************************************************************
. *PRIMING EFFECTS, HYPOTHESES 1 AND 2 - LUCK, Table S21
. *************************************************************************
. reg luck_unfair_agree corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =      14.56
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0018
                                                Root MSE          =     1.1122

------------------------------------------------------------------------------
             |               Robust
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0942229   .0246937    -3.82   0.000    -.1426288   -.0458169
       _cons |   3.714498    .017792   208.77   0.000     3.679621    3.749375
------------------------------------------------------------------------------

. est store col1

. reg luck_unfair_agree corona_prime republican highinc higheduc female age infe
> cted child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      29.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0598
                                                Root MSE          =     1.0945

------------------------------------------------------------------------------
             |               Robust
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0927782   .0283281    -3.28   0.001    -.1483095    -.037247
  republican |   -.350365   .0301782   -11.61   0.000     -.409523    -.291207
     highinc |  -.1328098   .0313456    -4.24   0.000    -.1942563   -.0713633
    higheduc |   .0293656   .0304412     0.96   0.335    -.0303081    .0890394
      female |   .0908848   .0284766     3.19   0.001     .0350623    .1467073
         age |  -.0077909   .0008484    -9.18   0.000     -.009454   -.0061277
    infected |   .4635241   .3734082     1.24   0.215    -.2684651    1.195513
       child |   .0937349   .0357484     2.62   0.009     .0236575    .1638122
       alone |   .0393318   .0380435     1.03   0.301    -.0352446    .1139082
       urban |   .0615768   .0340464     1.81   0.071    -.0051641    .1283176
   northeast |   .1080638   .0511782     2.11   0.035     .0077395     .208388
     midwest |  -.0349337   .0423391    -0.83   0.409    -.1179307    .0480633
       south |   .0561101   .0387882     1.45   0.148    -.0199261    .1321464
       _cons |   4.100269   .0653417    62.75   0.000      3.97218    4.228358
------------------------------------------------------------------------------

. est store col2

. 
. reg luck_determ_agree corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.74
                                                Prob > F          =     0.3885
                                                R-squared         =     0.0001
                                                Root MSE          =     1.1888

------------------------------------------------------------------------------
             |               Robust
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0227602   .0263944    -0.86   0.389    -.0744999    .0289796
       _cons |   2.866403   .0188988   151.67   0.000     2.829356    2.903449
------------------------------------------------------------------------------

. est store col3

. reg luck_determ_agree corona_prime republican highinc higheduc female age infe
> cted child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      23.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0448
                                                Root MSE          =      1.178

------------------------------------------------------------------------------
             |               Robust
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0106333   .0304416    -0.35   0.727    -.0703078    .0490412
  republican |  -.1959023   .0317188    -6.18   0.000    -.2580803   -.1337242
     highinc |   .0496256   .0334916     1.48   0.138    -.0160277     .115279
    higheduc |   .1374955   .0327108     4.20   0.000     .0733727    .2016183
      female |  -.2482338    .030975    -8.01   0.000    -.3089539   -.1875137
         age |  -.0084997   .0009444    -9.00   0.000     -.010351   -.0066484
    infected |   .0439094    .420115     0.10   0.917    -.7796388    .8674577
       child |   -.036794   .0390758    -0.94   0.346    -.1133939     .039806
       alone |    .088796   .0409108     2.17   0.030     .0085989    .1689931
       urban |   .0434982   .0356675     1.22   0.223    -.0264205    .1134169
   northeast |   .1444063   .0560068     2.58   0.010     .0346165     .254196
     midwest |   -.003515   .0447098    -0.08   0.937    -.0911594    .0841293
       south |  -.0608019   .0418907    -1.45   0.147    -.1429199    .0213161
       _cons |   3.356917   .0721069    46.55   0.000     3.215567    3.498268
------------------------------------------------------------------------------

. est store col4

. 
. reg luck_unfair_determines_index corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       9.83
                                                Prob > F          =     0.0017
                                                R-squared         =     0.0012
                                                Root MSE          =     1.4854

------------------------------------------------------------------------------
             |               Robust
luck_unfai~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.1033801   .0329786    -3.13   0.002    -.1680266   -.0387336
       _cons |   .0476455    .023526     2.03   0.043     .0015285    .0937626
------------------------------------------------------------------------------

. est store col5

. reg luck_unfair_determines_index corona_prime republican highinc higheduc fema
> le age infected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      37.86
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0711
                                                Root MSE          =     1.4705

------------------------------------------------------------------------------
             |               Robust
luck_unfai~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0919267   .0383548    -2.40   0.017    -.1671134   -.0167401
  republican |  -.4776453    .040576   -11.77   0.000    -.5571861   -.3981044
     highinc |  -.0772575   .0421819    -1.83   0.067    -.1599464    .0054315
    higheduc |   .1414797   .0410198     3.45   0.001     .0610689    .2218906
      female |  -.1266648   .0386914    -3.27   0.001    -.2025111   -.0508184
         age |  -.0140929   .0011553   -12.20   0.000    -.0163576   -.0118282
    infected |   .4515489   .5078361     0.89   0.374    -.5439583    1.447056
       child |   .0530448   .0492105     1.08   0.281    -.0434222    .1495117
       alone |   .1095935   .0521798     2.10   0.036     .0073058    .2118811
       urban |   .0915444   .0457798     2.00   0.046     .0018026    .1812862
   northeast |   .2176886   .0696893     3.12   0.002     .0810772       .3543
     midwest |  -.0342036   .0573511    -0.60   0.551    -.1466286    .0782214
       south |  -.0007372   .0524454    -0.01   0.989    -.1035455    .1020711
       _cons |   .8038193   .0898059     8.95   0.000     .6277736     .979865
------------------------------------------------------------------------------

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/hyp1hyp2.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime age female highinc republican higheduc child alone urban inf
> ected northeast midwest south _cons) ///
> label mtitle("Ineq avers" "Ineq avers" "Luck determines" "Luck determines" "In
> dex of std" "Index of std") ///
> b(3)
(note: file tables/hyp1hyp2.tex not found)
(output written to tables/hyp1hyp2.tex)

. 
. *************************************************************************
. *PRIMING EFFECTS, HYPOTHESIS 3 - REDISTRIBTUION AND HEALTH CARE, Table S22
. *************************************************************************
. reg gov_reduce_inequality_agree corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.46
                                                Prob > F          =     0.4965
                                                R-squared         =     0.0001
                                                Root MSE          =     .77909

------------------------------------------------------------------------------
             |               Robust
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0117634   .0172974     0.68   0.496    -.0221438    .0456707
       _cons |   2.346116   .0123686   189.68   0.000      2.32187    2.370361
------------------------------------------------------------------------------

. est store col1

. reg gov_reduce_inequality_agree corona_prime republican highinc higheduc femal
> e age infected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     136.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2343
                                                Root MSE          =     .69021

------------------------------------------------------------------------------
             |               Robust
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0111626     .01761     0.63   0.526    -.0233581    .0456833
  republican |  -.7172244   .0195148   -36.75   0.000    -.7554792   -.6789697
     highinc |   -.068793   .0197525    -3.48   0.000    -.1075136   -.0300724
    higheduc |  -.0279479   .0192518    -1.45   0.147     -.065687    .0097913
      female |    .002451   .0177861     0.14   0.890    -.0324149     .037317
         age |  -.0045072   .0005464    -8.25   0.000    -.0055783   -.0034362
    infected |   .5774244    .233634     2.47   0.013     .1194335    1.035415
       child |   .0694259    .022327     3.11   0.002     .0256585    .1131934
       alone |   .0114007   .0227243     0.50   0.616    -.0331456     .055947
       urban |   .0390838   .0210139     1.86   0.063    -.0021097    .0802772
   northeast |   .0159037   .0323456     0.49   0.623    -.0475033    .0793106
     midwest |  -.0192733   .0266419    -0.72   0.469    -.0714992    .0329526
       south |  -.0259904   .0241344    -1.08   0.282    -.0733009    .0213202
       _cons |     2.8346    .039924    71.00   0.000     2.756337    2.912863
------------------------------------------------------------------------------

. est store col2

. 
. reg fed_univ_healthcare corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.82
                                                Prob > F          =     0.3658
                                                R-squared         =     0.0001
                                                Root MSE          =     .48679

------------------------------------------------------------------------------
             |               Robust
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0097732   .0108067    -0.90   0.366     -.030957    .0114107
       _cons |   .6192479   .0076385    81.07   0.000     .6042745    .6342213
------------------------------------------------------------------------------

. est store col3

. reg fed_univ_healthcare corona_prime republican highinc higheduc female age in
> fected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     191.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2762
                                                Root MSE          =     .41329

------------------------------------------------------------------------------
             |               Robust
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0004507   .0105669    -0.04   0.966     -.021165    .0202635
  republican |  -.4830622   .0116945   -41.31   0.000    -.5059867   -.4601376
     highinc |  -.0246495   .0117234    -2.10   0.036    -.0476307   -.0016683
    higheduc |   .0179579   .0113057     1.59   0.112    -.0042047    .0401204
      female |   .0082329   .0106794     0.77   0.441    -.0127018    .0291676
         age |  -.0028098   .0003231    -8.70   0.000    -.0034431   -.0021764
    infected |   .2630204   .1426105     1.84   0.065    -.0165378    .5425786
       child |   .0160515   .0137251     1.17   0.242    -.0108537    .0429566
       alone |  -.0122023   .0140245    -0.87   0.384    -.0396944    .0152897
       urban |   .0528151   .0127384     4.15   0.000     .0278442     .077786
   northeast |   .0196986   .0191934     1.03   0.305     -.017926    .0573233
     midwest |  -.0039867   .0157265    -0.25   0.800    -.0348153    .0268419
       south |  -.0121981   .0144632    -0.84   0.399    -.0405503     .016154
       _cons |   .8954696   .0249003    35.96   0.000     .8466578    .9442814
------------------------------------------------------------------------------

. est store col4

. 
. reg redistribution_healthcare_index corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.02
                                                Prob > F          =     0.8965
                                                R-squared         =     0.0000
                                                Root MSE          =     1.7502

------------------------------------------------------------------------------
             |               Robust
redistribu~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0050539    .038857    -0.13   0.897    -.0812236    .0711158
       _cons |  -.0377124   .0276443    -1.36   0.173    -.0919023    .0164775
------------------------------------------------------------------------------

. est store col5

. reg redistribution_healthcare_index corona_prime republican highinc higheduc f
> emale age infected child alone urban northeast midwest south [pw=weight], robu
> st
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     225.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3299
                                                Root MSE          =     1.4507

------------------------------------------------------------------------------
             |               Robust
redistribu~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0134486   .0372929     0.36   0.718    -.0596565    .0865537
  republican |  -1.922845   .0413443   -46.51   0.000    -2.003892   -1.841798
     highinc |  -.1395942   .0416145    -3.35   0.001    -.2211707   -.0580177
    higheduc |   .0011277   .0405257     0.03   0.978    -.0783145      .08057
      female |   .0201813   .0377028     0.54   0.592    -.0537272    .0940897
         age |  -.0116165   .0011323   -10.26   0.000    -.0138363   -.0093968
    infected |   1.287749   .4945964     2.60   0.009     .3181958    2.257303
       child |   .1226309   .0477613     2.57   0.010     .0290048     .216257
       alone |  -.0105441    .048309    -0.22   0.827     -.105244    .0841557
       urban |   .1595598   .0435933     3.66   0.000     .0741043    .2450153
   northeast |   .0612205   .0677513     0.90   0.366    -.0715918    .1940328
     midwest |   -.033073   .0563662    -0.59   0.557    -.1435672    .0774212
       south |  -.0587058   .0507822    -1.16   0.248    -.1582538    .0408422
       _cons |   1.162754   .0843115    13.79   0.000     .9974788    1.328029
------------------------------------------------------------------------------

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/hyp3.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime age female highinc republican higheduc child alone urban inf
> ected northeast midwest south _cons) ///
> label mtitle("Redistribution" "Redistribution" "Healthcare" "Healthcare" "Inde
> x of std" "Index of std") ///
> b(3)
(note: file tables/hyp3.tex not found)
(output written to tables/hyp3.tex)

. 
. *************************************************************************
. *PRIMING EFFECTS, HYPOTHESIS 4 - SELFISHNESS, Table S23
. *************************************************************************
. reg prior_soc_over_self corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =      10.89
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0013
                                                Root MSE          =      2.321

------------------------------------------------------------------------------
             |               Robust
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .1700578   .0515264     3.30   0.001     .0690528    .2710627
       _cons |   3.474518   .0363835    95.50   0.000     3.403197    3.545838
------------------------------------------------------------------------------

. est store col1

. reg prior_soc_over_self corona_prime republican highinc higheduc female age in
> fected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      18.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0383
                                                Root MSE          =     2.2616

------------------------------------------------------------------------------
             |               Robust
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .1502388   .0583529     2.57   0.010       .03585    .2646275
  republican |  -.6723651   .0605322   -11.11   0.000    -.7910259   -.5537044
     highinc |   .0167633   .0654479     0.26   0.798    -.1115338    .1450604
    higheduc |   .1941646   .0617988     3.14   0.002     .0730209    .3153083
      female |   .2533135   .0589403     4.30   0.000     .1377732    .3688538
         age |  -.0116853   .0018781    -6.22   0.000    -.0153669   -.0080036
    infected |   .1772081   .8460656     0.21   0.834    -1.481328    1.835744
       child |  -.2742232    .074499    -3.68   0.000    -.4202631   -.1281833
       alone |   -.013294   .0816299    -0.16   0.871    -.1733126    .1467246
       urban |   .0173924   .0708589     0.25   0.806    -.1215118    .1562966
   northeast |  -.0138091   .1076832    -0.13   0.898    -.2248996    .1972814
     midwest |   .0746351   .0857135     0.87   0.384    -.0933884    .2426585
       south |  -.0861008   .0777682    -1.11   0.268    -.2385492    .0663477
       _cons |   4.137153   .1421033    29.11   0.000     3.858589    4.415717
------------------------------------------------------------------------------

. est store col2

. 
. reg compassion_agree corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       2.38
                                                Prob > F          =     0.1226
                                                R-squared         =     0.0003
                                                Root MSE          =     .87517

------------------------------------------------------------------------------
             |               Robust
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |    .030001    .019428     1.54   0.123    -.0080829    .0680849
       _cons |   4.024245   .0136686   294.42   0.000     3.997452    4.051039
------------------------------------------------------------------------------

. est store col3

. reg compassion_agree corona_prime republican highinc higheduc female age infec
> ted child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      16.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0346
                                                Root MSE          =     .86738

------------------------------------------------------------------------------
             |               Robust
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .0356614    .022397     1.59   0.111    -.0082432    .0795661
  republican |  -.2631984   .0231957   -11.35   0.000    -.3086688    -.217728
     highinc |  -.0144375   .0252602    -0.57   0.568    -.0639548    .0350799
    higheduc |  -.0083145   .0241885    -0.34   0.731    -.0557311     .039102
      female |   .1674678   .0227383     7.37   0.000     .1228942    .2120415
         age |   .0023603   .0007308     3.23   0.001     .0009278    .0037928
    infected |     .24195   .3138428     0.77   0.441    -.3732736    .8571735
       child |   .0213537   .0286132     0.75   0.456    -.0347365     .077444
       alone |  -.0830444    .031714    -2.62   0.009    -.1452132   -.0208757
       urban |   .0265804   .0267375     0.99   0.320    -.0258328    .0789937
   northeast |   .0427032   .0417674     1.02   0.307    -.0391731    .1245795
     midwest |   .0235262   .0325205     0.72   0.469    -.0402235    .0872759
       south |   .0838731   .0301124     2.79   0.005      .024844    .1429023
       _cons |   3.887717    .053562    72.58   0.000      3.78272    3.992714
------------------------------------------------------------------------------

. est store col4

. 
. reg solidarity_compassion_index corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =      10.77
                                                Prob > F          =     0.0010
                                                R-squared         =     0.0013
                                                Root MSE          =     1.4726

------------------------------------------------------------------------------
             |               Robust
solidarity~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .1072707   .0326925     3.28   0.001      .043185    .1713563
       _cons |  -.0568626   .0230865    -2.46   0.014    -.1021181   -.0116072
------------------------------------------------------------------------------

. est store col5

. reg solidarity_compassion_index corona_prime republican highinc higheduc femal
> e age infected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      26.62
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0550
                                                Root MSE          =     1.4353

------------------------------------------------------------------------------
             |               Robust
solidarity~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |   .1051631   .0367871     2.86   0.004     .0330496    .1772766
  republican |  -.5882389   .0376627   -15.62   0.000    -.6620688   -.5144089
     highinc |  -.0091711   .0415823    -0.22   0.825    -.0906846    .0723424
    higheduc |   .0741567    .039688     1.87   0.062    -.0036434    .1519569
      female |   .2991566   .0371664     8.05   0.000     .2262995    .3720137
         age |  -.0023517   .0011627    -2.02   0.043    -.0046309   -.0000724
    infected |   .3509367   .5382588     0.65   0.514    -.7042079    1.406081
       child |  -.0938237   .0467201    -2.01   0.045    -.1854088   -.0022387
       alone |   -.099989   .0509699    -1.96   0.050     -.199905    -.000073
       urban |     .03766   .0440135     0.86   0.392    -.0486193    .1239394
   northeast |   .0425279   .0706959     0.60   0.547    -.0960567    .1811125
     midwest |   .0588381   .0544255     1.08   0.280    -.0478519    .1655281
       south |   .0581366   .0494298     1.18   0.240    -.0387602    .1550335
       _cons |   .0734488    .086758     0.85   0.397    -.0966224    .2435199
------------------------------------------------------------------------------

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/hyp4.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime age female highinc republican higheduc child alone urban inf
> ected northeast midwest south _cons) ///
> label mtitle("Solidarity" "Solidarity" "Compassion" "Compassion" "Index of std
> " "Index of std") ///
> b(3)
(note: file tables/hyp4.tex not found)
(output written to tables/hyp4.tex)

. 
. *************************************************************************
. *PRIMING EFFECTS, HYPOTHESIS 5 - NATIONALISM, Table S24
. *************************************************************************
. reg prior_global_over_national corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.19
                                                Prob > F          =     0.6624
                                                R-squared         =     0.0000
                                                Root MSE          =     2.3665

------------------------------------------------------------------------------
             |               Robust
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0229389   .0525376    -0.44   0.662    -.1259261    .0800482
       _cons |   2.889164    .037163    77.74   0.000     2.816315    2.962013
------------------------------------------------------------------------------

. est store col1

. reg prior_global_over_national corona_prime republican highinc higheduc female
>  age infected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      64.53
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1142
                                                Root MSE          =     2.2178

------------------------------------------------------------------------------
             |               Robust
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0121711   .0574659    -0.21   0.832     -.124821    .1004788
  republican |  -1.232235   .0582396   -21.16   0.000    -1.346402   -1.118069
     highinc |  -.0302516    .064098    -0.47   0.637    -.1559025    .0953993
    higheduc |   .2211873   .0616611     3.59   0.000     .1003135    .3420612
      female |  -.0862505   .0582315    -1.48   0.139    -.2004012    .0279002
         age |  -.0245918   .0018524   -13.28   0.000    -.0282231   -.0209604
    infected |   1.110621    .820473     1.35   0.176    -.4977463    2.718988
       child |  -.1554795   .0738978    -2.10   0.035    -.3003408   -.0106182
       alone |   .1585909   .0788747     2.01   0.044     .0039735    .3132083
       urban |   .0244117   .0681749     0.36   0.720    -.1092311    .1580546
   northeast |  -.1058341    .102701    -1.03   0.303    -.3071581    .0954898
     midwest |  -.1121696   .0829745    -1.35   0.176     -.274824    .0504847
       south |  -.0912183   .0781627    -1.17   0.243    -.2444401    .0620036
       _cons |   4.549914   .1443398    31.52   0.000     4.266966    4.832862
------------------------------------------------------------------------------

. est store col2

. 
. reg noborders_agree corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       1.15
                                                Prob > F          =     0.2838
                                                R-squared         =     0.0001
                                                Root MSE          =      1.336

------------------------------------------------------------------------------
             |               Robust
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0317933   .0296613    -1.07   0.284    -.0899371    .0263505
       _cons |   2.672687   .0210623   126.89   0.000     2.631399    2.713974
------------------------------------------------------------------------------

. est store col3

. reg noborders_agree corona_prime republican highinc higheduc female age infect
> ed child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =      95.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1586
                                                Root MSE          =      1.239

------------------------------------------------------------------------------
             |               Robust
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0257358   .0322252    -0.80   0.425    -.0889066     .037435
  republican |  -.9751978   .0338005   -28.85   0.000    -1.041457    -.908939
     highinc |  -.0720349   .0356395    -2.02   0.043    -.1418987   -.0021712
    higheduc |  -.0095587   .0349054    -0.27   0.784    -.0779835    .0588661
      female |   -.162194   .0323666    -5.01   0.000    -.2256419    -.098746
         age |  -.0074955   .0009984    -7.51   0.000    -.0094527   -.0055383
    infected |   .8618324   .4596628     1.87   0.061    -.0392411    1.762906
       child |    .154564   .0420056     3.68   0.000     .0722207    .2369072
       alone |   .0256699   .0411892     0.62   0.533    -.0550729    .1064126
       urban |   .0699111   .0372441     1.88   0.061    -.0030982    .1429204
   northeast |  -.0369365   .0579604    -0.64   0.524    -.1505558    .0766828
     midwest |  -.1045226   .0478772    -2.18   0.029    -.1983759   -.0106694
       south |  -.0848493   .0438947    -1.93   0.053    -.1708958    .0011972
       _cons |   3.483824   .0755997    46.08   0.000     3.335627    3.632022
------------------------------------------------------------------------------

. est store col4

. 
. reg noborders_globalprior_index corona_prime, robust

Linear regression                               Number of obs     =      8,116
                                                F(1, 8114)        =       0.89
                                                Prob > F          =     0.3460
                                                R-squared         =     0.0001
                                                Root MSE          =     1.5925

------------------------------------------------------------------------------
             |               Robust
noborders_~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0333213   .0353568    -0.94   0.346    -.1026296    .0359871
       _cons |  -.0393458   .0253197    -1.55   0.120    -.0889789    .0102873
------------------------------------------------------------------------------

. est store col5

. reg noborders_globalprior_index corona_prime republican highinc higheduc femal
> e age infected child alone urban northeast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(13, 7225)       =     134.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2048
                                                Root MSE          =     1.4253

------------------------------------------------------------------------------
             |               Robust
noborders_~x |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
corona_prime |  -.0242884   .0367854    -0.66   0.509    -.0963985    .0478217
  republican |  -1.243875   .0381259   -32.63   0.000    -1.318613   -1.169138
     highinc |  -.0663825   .0406496    -1.63   0.103    -.1460676    .0133025
    higheduc |    .085685   .0394007     2.17   0.030     .0084481     .162922
      female |  -.1570768   .0371204    -4.23   0.000    -.2298436   -.0843099
         age |  -.0159052   .0011704   -13.59   0.000    -.0181995   -.0136108
    infected |   1.108353   .5185949     2.14   0.033     .0917551    2.124951
       child |    .049961   .0468606     1.07   0.286    -.0418994    .1418215
       alone |   .0856764   .0493285     1.74   0.082    -.0110219    .1823747
       urban |   .0623492   .0432767     1.44   0.150    -.0224857    .1471842
   northeast |  -.0719371     .06597    -1.09   0.276    -.2012575    .0573833
     midwest |  -.1249687   .0542392    -2.30   0.021    -.2312933   -.0186441
       south |  -.1015147    .050311    -2.02   0.044     -.200139   -.0028904
       _cons |   1.262055   .0880847    14.33   0.000     1.089384    1.434727
------------------------------------------------------------------------------

. est store col6

. 
. esttab col1 col2 col3 col4 col5 col6 using tables/hyp5.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(N r2, layout(@ @) labe
> ls("Observations" "\(R^{2}\)")) /// ///
> keep(corona_prime age female highinc republican higheduc child alone urban inf
> ected northeast midwest south _cons) ///
> label mtitle("Glob over nat." "Glob over nat." "No borders" "No borders" "Inde
> x of std" "Index of std") ///
> b(3)
(note: file tables/hyp5.tex not found)
(output written to tables/hyp5.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, UNFAIR LUCK, Table S25
. *************************************************************************
. reg luck_unfair_agree corona_prime republicanXcorona_prime republican highinc 
> higheduc female retirement_age infected child alone urban northeast midwest so
> uth [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0513
                                                Root MSE          =     1.0995

-------------------------------------------------------------------------------
              |               Robust
luck_unfair~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.1458829    .035927    -4.06   0.000    -.2163103   -.0754555
republicanX~e |   .1345532   .0589622     2.28   0.023     .0189699    .2501364
   republican |  -.4453011   .0429645   -10.36   0.000    -.5295241   -.3610781
      highinc |  -.1589055    .031496    -5.05   0.000    -.2206469   -.0971641
     higheduc |   .0242011   .0306433     0.79   0.430    -.0358687    .0842708
       female |   .0808052   .0286366     2.82   0.005      .024669    .1369413
retirement~ge |  -.1576087   .0364264    -4.33   0.000    -.2290151   -.0862023
     infected |   .4408093   .3747166     1.18   0.239    -.2937449    1.175363
        child |   .1421693   .0357176     3.98   0.000     .0721524    .2121863
        alone |   .0182862   .0380271     0.48   0.631    -.0562579    .0928303
        urban |   .0829037   .0341565     2.43   0.015      .015947    .1498605
    northeast |   .1071379   .0513415     2.09   0.037     .0064936    .2077822
      midwest |  -.0473751    .042499    -1.11   0.265    -.1306855    .0359354
        south |   .0532263   .0391433     1.36   0.174    -.0235059    .1299586
        _cons |   3.792392   .0544454    69.66   0.000     3.685664    3.899121
-------------------------------------------------------------------------------

. lincom corona_prime + republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0113298   .0466954    -0.24   0.808    -.1028664    .0802069
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.01132978

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0466954

. est store col1

. 
. reg luck_unfair_agree corona_prime highincXcorona_prime republican highinc hig
> heduc female retirement_age infected child alone urban northeast midwest south
>  [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0509
                                                Root MSE          =     1.0998

-------------------------------------------------------------------------------
              |               Robust
luck_unfair~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0463407   .0362961    -1.28   0.202    -.1174916    .0248102
highincXcor~e |  -.0950025   .0571367    -1.66   0.096    -.2070072    .0170023
   republican |  -.3779401   .0301218   -12.55   0.000    -.4369877   -.3188925
      highinc |  -.1098177   .0430449    -2.55   0.011    -.1941984   -.0254371
     higheduc |   .0212543   .0306274     0.69   0.488    -.0387843     .081293
       female |   .0805181   .0286421     2.81   0.005     .0243712     .136665
retirement~ge |  -.1569854   .0364355    -4.31   0.000    -.2284096   -.0855613
     infected |   .4521571   .3747543     1.21   0.228    -.2824709    1.186785
        child |   .1432108   .0357472     4.01   0.000     .0731359    .2132856
        alone |   .0209036    .038053     0.55   0.583    -.0536914    .0954986
        urban |   .0837988    .034183     2.45   0.014     .0167901    .1508076
    northeast |   .1029979   .0514542     2.00   0.045     .0021325    .2038632
      midwest |  -.0477717   .0424964    -1.12   0.261    -.1310771    .0355337
        south |   .0537064   .0391382     1.37   0.170    -.0230159    .1304288
        _cons |   3.742405   .0551819    67.82   0.000     3.634233    3.850578
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1413432   .0441193    -3.20   0.001    -.2278299   -.0548564
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.14134318

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04411932

. est store col2

. 
. reg luck_unfair_agree corona_prime higheducXcorona_prime republican highinc hi
> gheduc female retirement_age infected child alone urban northeast midwest sout
> h [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0509
                                                Root MSE          =     1.0998

-------------------------------------------------------------------------------
              |               Robust
luck_unfair~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0509302   .0383798    -1.33   0.185    -.1261659    .0243054
higheducXco~e |  -.0900009   .0571936    -1.57   0.116     -.202117    .0221153
   republican |  -.3796019   .0301375   -12.60   0.000    -.4386803   -.3205235
      highinc |  -.1572717   .0315252    -4.99   0.000    -.2190703   -.0954732
     higheduc |   .0663318   .0424077     1.56   0.118    -.0167997    .1494633
       female |   .0808122   .0286472     2.82   0.005     .0246553    .1369691
retirement~ge |   -.158366    .036409    -4.35   0.000    -.2297383   -.0869936
     infected |   .4558189   .3747689     1.22   0.224    -.2788378    1.190476
        child |   .1431331   .0357625     4.00   0.000      .073028    .2132381
        alone |   .0205978   .0380285     0.54   0.588    -.0539492    .0951448
        urban |   .0827848   .0342016     2.42   0.016     .0157395      .14983
    northeast |   .1043237   .0514832     2.03   0.043     .0034017    .2052458
      midwest |  -.0487964   .0424996    -1.15   0.251    -.1321081    .0345154
        south |   .0526689   .0391426     1.35   0.178     -.024062    .1293999
        _cons |   3.746969    .054759    68.43   0.000     3.639625    3.854312
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1409311   .0424317    -3.32   0.001    -.2241096   -.0577526
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.14093111

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04243168

. est store col3

. 
. reg luck_unfair_agree corona_prime femaleXcorona_prime republican highinc high
> educ female retirement_age infected child alone urban northeast midwest south 
> [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0505
                                                Root MSE          =        1.1

-------------------------------------------------------------------------------
              |               Robust
luck_unfair~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0737961   .0426982    -1.73   0.084    -.1574971     .009905
femaleXcoro~e |  -.0378908   .0571454    -0.66   0.507    -.1499125    .0741308
   republican |  -.3785381   .0301274   -12.56   0.000    -.4375965   -.3194796
      highinc |  -.1570844   .0315159    -4.98   0.000    -.2188647    -.095304
     higheduc |   .0219945   .0306375     0.72   0.473     -.038064     .082053
       female |    .099325   .0408586     2.43   0.015     .0192301    .1794199
retirement~ge |  -.1585573    .036442    -4.35   0.000    -.2299944   -.0871203
     infected |    .459089   .3751543     1.22   0.221    -.2763231    1.194501
        child |   .1431642   .0357703     4.00   0.000     .0730439    .2132845
        alone |   .0200025   .0380573     0.53   0.599     -.054601     .094606
        urban |   .0832196   .0342287     2.43   0.015     .0161213    .1503179
    northeast |   .1025935   .0514797     1.99   0.046     .0016781    .2035088
      midwest |  -.0498765   .0425041    -1.17   0.241    -.1331969    .0334439
        south |   .0516642   .0391613     1.32   0.187    -.0251033    .1284317
        _cons |   3.758392   .0558597    67.28   0.000     3.648891    3.867893
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1116869   .0379719    -2.94   0.003    -.1861229   -.0372509
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.11168691

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03797187

. est store col4

. 
. reg luck_unfair_agree corona_prime retirement_ageXcorona_prime republican high
> inc higheduc female retirement_age infected child alone urban northeast midwes
> t south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      23.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0505
                                                Root MSE          =        1.1

-------------------------------------------------------------------------------
              |               Robust
luck_unfair~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0864325   .0319725    -2.70   0.007    -.1491078   -.0237571
retirement~me |   -.038153   .0697355    -0.55   0.584    -.1748549    .0985489
   republican |  -.3786603   .0301206   -12.57   0.000    -.4377055   -.3196151
      highinc |  -.1565575   .0315338    -4.96   0.000    -.2183731    -.094742
     higheduc |   .0216925   .0306443     0.71   0.479    -.0383793    .0817643
       female |   .0805425    .028666     2.81   0.005     .0243489    .1367362
retirement~ge |  -.1396239   .0527258    -2.65   0.008     -.242982   -.0362659
     infected |     .45448   .3749995     1.21   0.226    -.2806287    1.189589
        child |   .1423916   .0357731     3.98   0.000      .072266    .2125173
        alone |   .0199208   .0380516     0.52   0.601    -.0546714    .0945131
        urban |   .0835856   .0342097     2.44   0.015     .0165246    .1506466
    northeast |    .103591   .0514493     2.01   0.044     .0027353    .2044467
      midwest |  -.0489687   .0425348    -1.15   0.250    -.1323495     .034412
        south |   .0521109   .0391695     1.33   0.183    -.0246728    .1288946
        _cons |   3.764013   .0542378    69.40   0.000     3.657692    3.870335
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
luck_unfai~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1245855   .0619516    -2.01   0.044    -.2460288   -.0031422
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.12458546

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .06195162

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_unfairluck.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Luck unfair" "Luck unfair" "Luck unfair" "Luck unfair" "Luck unf
> air") ///
> b(3)
(note: file tables/het_unfairluck.tex not found)
(output written to tables/het_unfairluck.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, LUCK DETERMINES, Table S26
. *************************************************************************
. reg luck_determ_agree corona_prime republicanXcorona_prime republican highinc 
> higheduc female retirement_age infected child alone urban northeast midwest so
> uth [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0337
                                                Root MSE          =     1.1849

-------------------------------------------------------------------------------
              |               Robust
luck_determ~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0340501   .0404366    -0.84   0.400    -.1133176    .0452174
republicanX~e |   .0584449   .0620334     0.94   0.346    -.0631586    .1800485
   republican |  -.2587575    .044603    -5.80   0.000    -.3461925   -.1713225
      highinc |   .0216252   .0336335     0.64   0.520    -.0443062    .0875567
     higheduc |   .1302096   .0329969     3.95   0.000      .065526    .1948932
       female |  -.2588117   .0311191    -8.32   0.000    -.3198142   -.1978091
retirement~ge |  -.1193402   .0376537    -3.17   0.002    -.1931523    -.045528
     infected |   .0304379    .423268     0.07   0.943    -.7992911     .860167
        child |   .0270815   .0388013     0.70   0.485    -.0489804    .1031435
        alone |   .0656223   .0412706     1.59   0.112      -.01528    .1465247
        urban |   .0686771   .0358988     1.91   0.056    -.0016949    .1390492
    northeast |   .1409465   .0563764     2.50   0.012     .0304324    .2514606
      midwest |  -.0188398   .0450368    -0.42   0.676    -.1071251    .0694455
        south |  -.0640188   .0422746    -1.51   0.130    -.1468893    .0188517
        _cons |   2.992739   .0585381    51.12   0.000     2.877987     3.10749
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0243948   .0469534     0.52   0.603    -.0676475    .1164371
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .02439483

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04695335

. est store col1

. 
. reg luck_determ_agree corona_prime highincXcorona_prime republican highinc hig
> heduc female retirement_age infected child alone urban northeast midwest south
>  [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.89
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0336
                                                Root MSE          =      1.185

-------------------------------------------------------------------------------
              |               Robust
luck_determ~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   -.001353   .0392786    -0.03   0.973    -.0783506    .0756445
highincXcor~e |  -.0198776   .0615963    -0.32   0.747    -.1406244    .1008692
   republican |  -.2296213   .0316834    -7.25   0.000    -.2917301   -.1675125
      highinc |   .0323358    .046008     0.70   0.482    -.0578533     .122525
     higheduc |   .1290676   .0329839     3.91   0.000     .0644096    .1937256
       female |  -.2588941   .0311235    -8.32   0.000    -.3199051    -.197883
retirement~ge |  -.1193849   .0376963    -3.17   0.002    -.1932807   -.0454892
     infected |    .035978   .4233057     0.08   0.932    -.7938249     .865781
        child |   .0274187   .0387901     0.71   0.480    -.0486212    .1034587
        alone |   .0665514   .0413036     1.61   0.107    -.0144157    .1475185
        urban |   .0689985   .0359124     1.92   0.055    -.0014004    .1393974
    northeast |    .139231    .056347     2.47   0.013     .0287744    .2496876
      midwest |  -.0193781    .045032    -0.43   0.667     -.107654    .0688978
        south |  -.0642268   .0422795    -1.52   0.129    -.1471069    .0186533
        _cons |   2.976667   .0586642    50.74   0.000     2.861668    3.091666
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0212306   .0474032    -0.45   0.654    -.1141547    .0716935
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.02123061

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04740316

. est store col2

. 
. reg luck_determ_agree corona_prime higheducXcorona_prime republican highinc hi
> gheduc female retirement_age infected child alone urban northeast midwest sout
> h [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      16.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0338
                                                Root MSE          =     1.1849

-------------------------------------------------------------------------------
              |               Robust
luck_determ~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0382561   .0399245    -0.96   0.338    -.1165197    .0400076
higheducXco~e |   .0577714    .061936     0.93   0.351    -.0636413    .1791841
   republican |  -.2290191    .031698    -7.23   0.000    -.2911564   -.1668818
      highinc |   .0226793   .0336377     0.67   0.500    -.0432604     .088619
     higheduc |   .1006537   .0455341     2.21   0.027     .0113936    .1899138
       female |  -.2589229   .0311161    -8.32   0.000    -.3199195   -.1979264
retirement~ge |  -.1196916    .037657    -3.18   0.001    -.1935103   -.0458728
     infected |   .0359376   .4231761     0.08   0.932    -.7936114    .8654865
        child |   .0270332   .0387762     0.70   0.486    -.0489795     .103046
        alone |   .0659621   .0412824     1.60   0.110    -.0149635    .1468876
        urban |   .0693945   .0359383     1.93   0.054    -.0010552    .1398441
    northeast |   .1386927   .0563283     2.46   0.014     .0282727    .2491127
      midwest |  -.0201042   .0450199    -0.45   0.655    -.1083563    .0681479
        south |  -.0651357     .04222    -1.54   0.123    -.1478992    .0176278
        _cons |   2.995063   .0579023    51.73   0.000     2.881558    3.108569
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0195153   .0473178     0.41   0.680    -.0732413     .112272
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01951533

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04731778

. est store col3

. 
. reg luck_determ_agree corona_prime femaleXcorona_prime republican highinc high
> educ female retirement_age infected child alone urban northeast midwest south 
> [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      16.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     1.1847

-------------------------------------------------------------------------------
              |               Robust
luck_determ~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0457518   .0461336     0.99   0.321    -.0446836    .1361872
femaleXcoro~e |   -.111344    .061557    -1.81   0.071    -.2320136    .0093257
   republican |  -.2298886   .0316677    -7.26   0.000    -.2919666   -.1678106
      highinc |   .0220842   .0336392     0.66   0.512    -.0438586    .0880269
     higheduc |    .129571   .0329669     3.93   0.000     .0649462    .1941959
       female |   -.204142   .0437237    -4.67   0.000    -.2898531   -.1184308
retirement~ge |   -.120179   .0376464    -3.19   0.001     -.193977   -.0463811
     infected |   .0489403   .4217667     0.12   0.908    -.7778457    .8757263
        child |   .0286781   .0387705     0.74   0.460    -.0473234    .1046796
        alone |   .0664229   .0412997     1.61   0.108    -.0145366    .1473823
        urban |   .0681139   .0358974     1.90   0.058    -.0022556    .1384834
    northeast |   .1370397   .0562701     2.44   0.015     .0267339    .2473455
      midwest |  -.0211257   .0449851    -0.47   0.639    -.1093096    .0670582
        south |  -.0651778   .0422145    -1.54   0.123    -.1479306    .0175749
        _cons |   2.955259   .0595077    49.66   0.000     2.838607    3.071912
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0655922   .0407059    -1.61   0.107    -.1453876    .0142033
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.06559217

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0407059

. est store col4

. 
. reg luck_determ_agree corona_prime retirement_ageXcorona_prime republican high
> inc higheduc female retirement_age infected child alone urban northeast midwes
> t south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0337
                                                Root MSE          =     1.1849

-------------------------------------------------------------------------------
              |               Robust
luck_determ~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0238515   .0347377    -0.69   0.492    -.0919475    .0442445
retirement~me |   .0720413   .0719143     1.00   0.316    -.0689318    .2130144
   republican |  -.2294062   .0316876    -7.24   0.000    -.2915231   -.1672893
      highinc |   .0217295   .0336636     0.65   0.519     -.044261      .08772
     higheduc |   .1295249    .032976     3.93   0.000     .0648824    .1941674
       female |  -.2585461   .0311217    -8.31   0.000    -.3195538   -.1975383
retirement~ge |  -.1551067   .0536984    -2.89   0.004    -.2603713   -.0498421
     infected |   .0372845   .4231662     0.09   0.930    -.7922449     .866814
        child |   .0278925   .0387854     0.72   0.472    -.0481382    .1039233
        alone |    .066471   .0412974     1.61   0.108    -.0144839    .1474259
        urban |   .0687729   .0359032     1.92   0.055    -.0016079    .1391537
    northeast |   .1388818    .056335     2.47   0.014     .0284487    .2493149
      midwest |   -.020528   .0450187    -0.46   0.648    -.1087779    .0677218
        south |  -.0650951   .0422572    -1.54   0.123    -.1479316    .0177415
        _cons |    2.98842   .0579443    51.57   0.000     2.874832    3.102007
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
luck_deter~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0481897   .0629407     0.77   0.444    -.0751924    .1715719
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .04818973

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .06294067

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_luck_determ.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Luck determines" "Luck determines" "Luck determines" "Luck deter
> mines" "Luck determines") ///
> b(3)
(note: file tables/het_luck_determ.tex not found)
(output written to tables/het_luck_determ.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, REDISTRIBUTION, Table S27
. *************************************************************************
. reg gov_reduce_inequality_agree corona_prime republicanXcorona_prime republica
> n highinc higheduc female retirement_age infected child alone urban northeast 
> midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     126.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2329
                                                Root MSE          =     .69089

-------------------------------------------------------------------------------
              |               Robust
gov_reduce_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0242222   .0204971    -1.18   0.237    -.0644024    .0159581
republicanX~e |   .0900995   .0378201     2.38   0.017     .0159611    .1642379
   republican |  -.7737865   .0269577   -28.70   0.000    -.8266315   -.7209414
      highinc |  -.0829212   .0196735    -4.21   0.000    -.1214869   -.0443554
     higheduc |  -.0305557   .0192551    -1.59   0.113    -.0683013    .0071899
       female |  -.0040539   .0177712    -0.23   0.820    -.0388906    .0307828
retirement~ge |  -.1660224   .0237939    -6.98   0.000    -.2126653   -.1193794
     infected |   .5600735   .2314256     2.42   0.016     .1064117    1.013735
        child |   .0823279   .0223079     3.69   0.000     .0385979    .1260579
        alone |   .0009406    .022536     0.04   0.967    -.0432366    .0451178
        urban |   .0492235   .0209646     2.35   0.019     .0081268    .0903201
    northeast |   .0156729   .0321804     0.49   0.626    -.0474101    .0787558
      midwest |  -.0256896    .026597    -0.97   0.334    -.0778275    .0264482
        south |  -.0287031   .0241788    -1.19   0.235    -.0761006    .0186944
        _cons |   2.675566   .0321864    83.13   0.000     2.612471    2.738661
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0658774   .0317549     2.07   0.038     .0036284    .1281263
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .06587737

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03175492

. est store col1

. 
. reg gov_reduce_inequality_agree corona_prime highincXcorona_prime republican h
> ighinc higheduc female retirement_age infected child alone urban northeast mid
> west south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     126.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2323
                                                Root MSE          =     .69116

-------------------------------------------------------------------------------
              |               Robust
gov_reduce_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0319562    .021528     1.48   0.138     -.010245    .0741575
highincXcor~e |   -.042356   .0353125    -1.20   0.230    -.1115788    .0268667
   republican |  -.7288023   .0193855   -37.60   0.000    -.7668035   -.6908011
      highinc |  -.0605986    .025938    -2.34   0.020    -.1114446   -.0097526
     higheduc |  -.0323918   .0192578    -1.68   0.093    -.0701426     .005359
       female |  -.0042041   .0177814    -0.24   0.813    -.0390609    .0306527
retirement~ge |  -.1659186   .0238137    -6.97   0.000    -.2126004   -.1192369
     infected |   .5682796   .2319821     2.45   0.014     .1135269    1.023032
        child |   .0829108   .0223126     3.72   0.000     .0391715      .12665
        alone |   .0024867   .0225152     0.11   0.912    -.0416496     .046623
        urban |   .0497558    .020994     2.37   0.018     .0086015    .0909102
    northeast |   .0129829    .032239     0.40   0.687    -.0502151    .0761809
      midwest |   -.026319   .0266444    -0.99   0.323    -.0785498    .0259118
        south |  -.0287957   .0242213    -1.19   0.235    -.0762765    .0186851
        _cons |   2.647701   .0327087    80.95   0.000     2.583582    2.711819
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0103998   .0280182    -0.37   0.711    -.0653236     .044524
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.0103998

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02801818

. est store col2

. 
. reg gov_reduce_inequality_agree corona_prime higheducXcorona_prime republican 
> highinc higheduc female retirement_age infected child alone urban northeast mi
> dwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     125.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2322
                                                Root MSE          =     .69124

-------------------------------------------------------------------------------
              |               Robust
gov_reduce_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0110013   .0233967     0.47   0.638    -.0348631    .0568658
higheducXco~e |   .0001728   .0353765     0.00   0.996    -.0691755    .0695211
   republican |  -.7290435   .0193819   -37.61   0.000    -.7670378   -.6910492
      highinc |  -.0816123   .0196766    -4.15   0.000    -.1201841   -.0430404
     higheduc |  -.0322041   .0257655    -1.25   0.211    -.0827119    .0183037
       female |  -.0041205   .0177846    -0.23   0.817    -.0389836    .0307425
retirement~ge |  -.1665435   .0238181    -6.99   0.000    -.2132339   -.1198531
     infected |   .5694878   .2319236     2.46   0.014     .1148498    1.024126
        child |   .0826819    .022316     3.71   0.000     .0389359    .1264278
        alone |   .0020739   .0225225     0.09   0.927    -.0420768    .0462247
        urban |   .0496237   .0209917     2.36   0.018     .0084738    .0907735
    northeast |   .0131449   .0322463     0.41   0.684    -.0500672     .076357
      midwest |  -.0270451   .0266167    -1.02   0.310    -.0792215    .0251314
        south |  -.0296222   .0242026    -1.22   0.221    -.0770664     .017822
        _cons |   2.658911   .0327616    81.16   0.000     2.594689    2.723133
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0111741   .0265765     0.42   0.674    -.0409235    .0632718
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01117412

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02657647

. est store col3

. 
. reg gov_reduce_inequality_agree corona_prime femaleXcorona_prime  republican h
> ighinc higheduc female retirement_age infected child alone urban northeast mid
> west south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     126.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2322
                                                Root MSE          =     .69124

-------------------------------------------------------------------------------
              |               Robust
gov_reduce_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |    .011113     .02646     0.42   0.675    -.0407563    .0629822
femaleXcoro~e |  -.0000598   .0352511    -0.00   0.999    -.0691622    .0690426
   republican |  -.7290457   .0193798   -37.62   0.000    -.7670358   -.6910557
      highinc |  -.0816131   .0196776    -4.15   0.000     -.120187   -.0430392
     higheduc |  -.0321185   .0192689    -1.67   0.096    -.0698911    .0056541
       female |  -.0040909   .0245324    -0.17   0.868    -.0521816    .0439998
retirement~ge |  -.1665437   .0238255    -6.99   0.000    -.2132488   -.1198387
     infected |   .5694963   .2319162     2.46   0.014     .1148728     1.02412
        child |   .0826834   .0223112     3.71   0.000      .038947    .1264198
        alone |   .0020752   .0225255     0.09   0.927    -.0420814    .0462317
        urban |   .0496218   .0210093     2.36   0.018     .0084374    .0908063
    northeast |   .0131455   .0322177     0.41   0.683    -.0500105    .0763015
      midwest |  -.0270447   .0266093    -1.02   0.309    -.0792066    .0251172
        south |  -.0296209   .0242086    -1.22   0.221    -.0770769     .017835
        _cons |   2.658857   .0330825    80.37   0.000     2.594006    2.723709
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0110532   .0233425     0.47   0.636    -.0347049    .0568112
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01105316

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02334247

. est store col4

. 
. reg gov_reduce_inequality_agree corona_prime retirement_ageXcorona_prime repub
> lican highinc higheduc female retirement_age infected child alone urban northe
> ast midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     126.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2324
                                                Root MSE          =     .69115

-------------------------------------------------------------------------------
              |               Robust
gov_reduce_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0007566   .0194281     0.04   0.969    -.0373282    .0388413
retirement~me |   .0585624    .046013     1.27   0.203    -.0316367    .1487614
   republican |   -.728778   .0193821   -37.60   0.000    -.7667725   -.6907835
      highinc |   -.082218   .0196877    -4.18   0.000    -.1208117   -.0436242
     higheduc |  -.0318512   .0192704    -1.65   0.098    -.0696269    .0059245
       female |  -.0038694   .0177894    -0.22   0.828    -.0387417     .031003
retirement~ge |  -.1953433   .0323389    -6.04   0.000    -.2587371   -.1319495
     infected |   .5700901   .2322279     2.45   0.014     .1148555    1.025325
        child |   .0831548   .0223049     3.73   0.000     .0394307     .126879
        alone |   .0021668   .0225197     0.10   0.923    -.0419785     .046312
        urban |   .0494898   .0209968     2.36   0.018     .0083299    .0906498
    northeast |   .0128004   .0322545     0.40   0.691    -.0504278    .0760285
      midwest |  -.0277022   .0266175    -1.04   0.298    -.0798802    .0244759
        south |  -.0300117   .0241903    -1.24   0.215    -.0774318    .0174083
        _cons |   2.664164   .0321361    82.90   0.000     2.601168     2.72716
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
gov_reduce~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0593189   .0417121     1.42   0.155     -.022449    .1410868
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .05931893

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0417121

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_gov_reduce_inequality.tex, //
> /
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Redistr" "Redistr" "Redistr" "Redistr" "Redistr") ///
> b(3)
(note: file tables/het_gov_reduce_inequality.tex not found)
(output written to tables/het_gov_reduce_inequality.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, HEALTHCARE, Table S28
. *************************************************************************
. reg fed_univ_healthcare corona_prime republicanXcorona_prime republican highin
> c higheduc female retirement_age infected child alone urban northeast midwest 
> south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2724
                                                Root MSE          =     .41438

-------------------------------------------------------------------------------
              |               Robust
fed_univ_he~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0002958   .0129919    -0.02   0.982    -.0257637    .0251722
republicanX~e |  -.0005865   .0221893    -0.03   0.979    -.0440839     .042911
   republican |  -.4909268   .0161077   -30.48   0.000    -.5225025    -.459351
      highinc |  -.0328356   .0117117    -2.80   0.005    -.0557939   -.0098773
     higheduc |    .015318    .011352     1.35   0.177    -.0069352    .0375712
       female |   .0042567   .0107169     0.40   0.691    -.0167516    .0252649
retirement~ge |  -.0905767   .0131747    -6.88   0.000    -.1164029   -.0647505
     infected |   .2586532   .1433854     1.80   0.071    -.0224241    .5397306
        child |   .0269832   .0136895     1.97   0.049     .0001477    .0538187
        alone |  -.0183391   .0138865    -1.32   0.187    -.0455607    .0088825
        urban |   .0597665   .0127221     4.70   0.000     .0348274    .0847056
    northeast |   .0179704   .0192166     0.94   0.350    -.0196998    .0556406
      midwest |  -.0089452   .0156763    -0.57   0.568    -.0396754     .021785
        south |  -.0142604   .0144806    -0.98   0.325    -.0426466    .0141257
        _cons |   .7828404   .0202398    38.68   0.000     .7431645    .8225164
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0008822   .0179936    -0.05   0.961    -.0361548    .0343904
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.00088221

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .01799356

. est store col1

. 
. reg fed_univ_healthcare corona_prime highincXcorona_prime republican highinc h
> igheduc female retirement_age infected child alone urban northeast midwest sou
> th [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =     .41437

-------------------------------------------------------------------------------
              |               Robust
fed_univ_he~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0020444   .0134186    -0.15   0.879    -.0283488    .0242601
highincXcor~e |   .0030819   .0212542     0.15   0.885    -.0385825    .0447463
   republican |  -.4912357   .0115691   -42.46   0.000    -.5139145   -.4685569
      highinc |  -.0343731   .0158462    -2.17   0.030    -.0654363     -.00331
     higheduc |    .015348   .0113485     1.35   0.176    -.0068983    .0375943
       female |   .0042632   .0107171     0.40   0.691    -.0167455    .0252718
retirement~ge |  -.0906188   .0131748    -6.88   0.000    -.1164453   -.0647923
     infected |     .25868   .1434383     1.80   0.071     -.022501    .5398609
        child |   .0269643   .0136896     1.97   0.049     .0001287    .0537999
        alone |  -.0183764   .0138866    -1.32   0.186    -.0455983    .0088455
        urban |   .0597542   .0127187     4.70   0.000     .0348218    .0846866
    northeast |   .0179988   .0192269     0.94   0.349    -.0196917    .0556892
      midwest |  -.0089892   .0156858    -0.57   0.567    -.0397379    .0217595
        south |  -.0143145   .0144854    -0.99   0.323    -.0427101    .0140812
        _cons |   .7837619   .0201425    38.91   0.000     .7442766    .8232472
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0010375   .0164755     0.06   0.950    -.0312592    .0333343
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .00103752

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .01647548

. est store col2

. 
. reg fed_univ_healthcare corona_prime higheducXcorona_prime republican highinc 
> higheduc female retirement_age infected child alone urban northeast midwest so
> uth [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =     .41435

-------------------------------------------------------------------------------
              |               Robust
fed_univ_he~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0075688   .0143867     0.53   0.599    -.0206335     .035771
higheducXco~e |  -.0172509   .0212601    -0.81   0.417    -.0589268    .0244251
   republican |  -.4914319   .0115723   -42.47   0.000     -.514117   -.4687467
      highinc |  -.0329054   .0117074    -2.81   0.005    -.0558554   -.0099555
     higheduc |    .023851    .015571     1.53   0.126    -.0066727    .0543746
       female |   .0042775   .0107156     0.40   0.690    -.0167283    .0252832
retirement~ge |  -.0905693   .0131756    -6.87   0.000    -.1163974   -.0647412
     infected |   .2587736   .1434071     1.80   0.071    -.0223463    .5398935
        child |    .027064    .013688     1.98   0.048     .0002315    .0538966
        alone |  -.0182281   .0138846    -1.31   0.189     -.045446    .0089898
        urban |   .0596269   .0127286     4.68   0.000     .0346751    .0845788
    northeast |   .0181705   .0192206     0.95   0.345    -.0195074    .0558485
      midwest |  -.0088212   .0156839    -0.56   0.574    -.0395662    .0219238
        south |  -.0140987   .0144863    -0.97   0.330    -.0424961    .0142988
        _cons |   .7790212   .0201932    38.58   0.000     .7394367    .8186057
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0096821   .0156478    -0.62   0.536    -.0403564    .0209921
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.00968211

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .01564779

. est store col3

. 
. reg fed_univ_healthcare corona_prime femaleXcorona_prime republican highinc hi
> gheduc female retirement_age infected child alone urban northeast midwest sout
> h [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.21
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2725
                                                Root MSE          =     .41436

-------------------------------------------------------------------------------
              |               Robust
fed_univ_he~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0074879   .0156824    -0.48   0.633    -.0382299    .0232542
femaleXcoro~e |   .0136239   .0212125     0.64   0.521    -.0279588    .0552065
   republican |  -.4911992   .0115703   -42.45   0.000    -.5138804   -.4685181
      highinc |  -.0327964   .0117081    -2.80   0.005    -.0557477   -.0098451
     higheduc |   .0152822   .0113485     1.35   0.178    -.0069641    .0375286
       female |  -.0024375   .0151025    -0.16   0.872    -.0320429    .0271679
retirement~ge |   -.090512   .0131743    -6.87   0.000    -.1163376   -.0646865
     infected |   .2570754   .1434132     1.79   0.073    -.0240564    .5382071
        child |   .0268137   .0136859     1.96   0.050    -.0000147    .0536421
        alone |  -.0183544   .0138805    -1.32   0.186    -.0455641    .0088554
        urban |   .0598645   .0127244     4.70   0.000     .0349209     .084808
    northeast |   .0182644   .0192251     0.95   0.342    -.0194225    .0559512
      midwest |  -.0087642   .0156851    -0.56   0.576    -.0395116    .0219831
        south |  -.0141855   .0144938    -0.98   0.328    -.0425975    .0142266
        _cons |     .78621   .0205337    38.29   0.000     .7459579    .8264621
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .006136   .0142911     0.43   0.668    -.0218786    .0341507
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .00613602

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .01429106

. est store col4

. 
. reg fed_univ_healthcare corona_prime retirement_ageXcorona_prime republican hi
> ghinc higheduc female retirement_age infected child alone urban northeast midw
> est south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =     173.49
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2726
                                                Root MSE          =     .41434

-------------------------------------------------------------------------------
              |               Robust
fed_univ_he~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0055043   .0119685    -0.46   0.646    -.0289661    .0179574
retirement~me |   .0282368   .0251712     1.12   0.262    -.0211062    .0775798
   republican |  -.4910889   .0115709   -42.44   0.000    -.5137713   -.4684066
      highinc |  -.0331359   .0117195    -2.83   0.005    -.0561095   -.0101622
     higheduc |   .0154572   .0113537     1.36   0.173    -.0067994    .0377138
       female |   .0043781   .0107184     0.41   0.683    -.0166331    .0253893
retirement~ge |  -.1044596   .0180413    -5.79   0.000    -.1398259   -.0690933
     infected |   .2588814   .1434513     1.80   0.071    -.0223251     .540088
        child |   .0272085   .0136927     1.99   0.047     .0003667    .0540503
        alone |  -.0183023   .0138821    -1.32   0.187    -.0455153    .0089107
        urban |      .0597   .0127199     4.69   0.000     .0347652    .0846348
    northeast |   .0178198   .0192415     0.93   0.354    -.0198991    .0555388
      midwest |  -.0092538   .0157139    -0.59   0.556    -.0400577      .02155
        south |   -.014443   .0144965    -1.00   0.319    -.0428603    .0139743
        _cons |   .7855008   .0200837    39.11   0.000     .7461308    .8248708
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
fed_univ_h~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0227324   .0221106     1.03   0.304    -.0206109    .0660758
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .02273244

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02211065

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_healthcare.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Health care" "Health care" "Health care" "Health care" "Health c
> are") ///
> b(3)
(note: file tables/het_healthcare.tex not found)
(output written to tables/het_healthcare.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, SOLIDARITY, Table S29
. *************************************************************************
. reg prior_soc_over_self corona_prime  republicanXcorona_prime republican highi
> nc higheduc female retirement_age infected child alone urban northeast midwest
>  south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0337
                                                Root MSE          =     2.2672

-------------------------------------------------------------------------------
              |               Robust
prior_soc_o~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .1222294   .0768984     1.59   0.112     -.028514    .2729728
republicanX~e |   .0701601    .118002     0.59   0.552    -.1611583    .3014786
   republican |  -.7476628   .0832667    -8.98   0.000    -.9108899   -.5844356
      highinc |  -.0200216    .065391    -0.31   0.759    -.1482071    .1081638
     higheduc |   .1841993   .0622064     2.96   0.003     .0622566    .3061419
       female |   .2378344   .0590861     4.03   0.000     .1220083    .3536605
retirement~ge |  -.2661147   .0745469    -3.57   0.000    -.4122485   -.1199809
     infected |   .1557652   .8478018     0.18   0.854    -1.506174    1.817705
        child |  -.2068859   .0731426    -2.83   0.005    -.3502668   -.0635051
        alone |  -.0424789   .0819948    -0.52   0.604    -.2032126    .1182548
        urban |   .0491337   .0710362     0.69   0.489    -.0901181    .1883854
    northeast |   -.018904   .1079319    -0.18   0.861    -.2304821    .1926741
      midwest |   .0542267   .0856154     0.63   0.527    -.1136046    .2220579
        south |  -.0922188   .0779099    -1.18   0.237    -.2449449    .0605073
        _cons |   3.657485   .1123266    32.56   0.000     3.437292    3.877678
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1923896   .0895295     2.15   0.032     .0168855    .3678937
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .19238958

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08952955

. est store col1

. 
. reg prior_soc_over_self corona_prime highincXcorona_prime republican highinc h
> igheduc female retirement_age infected child alone urban northeast midwest sou
> th [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0339
                                                Root MSE          =      2.267

-------------------------------------------------------------------------------
              |               Robust
prior_soc_o~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0859091   .0797603     1.08   0.281    -.0704445    .2422627
highincXcor~e |   .1294835   .1169837     1.11   0.268    -.0998388    .3588058
   republican |  -.7135672   .0603921   -11.82   0.000    -.8319534    -.595181
      highinc |  -.0832441   .0862613    -0.97   0.335    -.2523415    .0858532
     higheduc |   .1838169   .0621432     2.96   0.003      .061998    .3056358
       female |   .2380388   .0590701     4.03   0.000     .1222441    .3538334
retirement~ge |  -.2684306    .074481    -3.60   0.000    -.4144351    -.122426
     infected |   .1667966   .8474732     0.20   0.844    -1.494499    1.828092
        child |  -.2073068   .0731387    -2.83   0.005      -.35068   -.0639336
        alone |  -.0428536   .0820135    -0.52   0.601     -.203624    .1179168
        urban |    .049036   .0710301     0.69   0.490    -.0902037    .1882757
    northeast |  -.0203703   .1078804    -0.19   0.850    -.2318474    .1911069
      midwest |   .0509561   .0856254     0.60   0.552    -.1168947    .2188068
        south |  -.0954552   .0779331    -1.22   0.221    -.2482269    .0573166
        _cons |   3.678635   .1139723    32.28   0.000     3.455216    3.902054
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2153926   .0856133     2.52   0.012     .0475655    .3832197
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .21539262

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08561329

. est store col2

. 
. reg prior_soc_over_self corona_prime higheducXcorona_prime republican highinc 
> higheduc female retirement_age infected child alone urban northeast midwest so
> uth [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.77
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0339
                                                Root MSE          =      2.267

-------------------------------------------------------------------------------
              |               Robust
prior_soc_o~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .2138064   .0811435     2.63   0.008     .0547414    .3728714
higheducXco~e |  -.1365811   .1167711    -1.17   0.242    -.3654866    .0923245
   republican |  -.7145168   .0604482   -11.82   0.000    -.8330129   -.5960208
      highinc |  -.0194885   .0654149    -0.30   0.766    -.1477209    .1087439
     higheduc |   .2504601   .0835237     3.00   0.003     .0867292     .414191
       female |   .2379439   .0590704     4.03   0.000     .1221485    .3537392
retirement~ge |  -.2664888   .0745237    -3.58   0.000    -.4125771   -.1204005
     infected |   .1645357   .8474702     0.19   0.846    -1.496754    1.825825
        child |  -.2059512   .0731269    -2.82   0.005    -.3493013   -.0626011
        alone |  -.0406587   .0820325    -0.50   0.620    -.2014664    .1201489
        urban |   .0483599    .071028     0.68   0.496    -.0908757    .1875954
    northeast |  -.0194166   .1077596    -0.18   0.857     -.230657    .1918237
      midwest |   .0540844   .0855981     0.63   0.528    -.1137128    .2218817
        south |  -.0916998   .0778249    -1.18   0.239    -.2442594    .0608598
        _cons |   3.613387    .112463    32.13   0.000     3.392926    3.833847
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0772253   .0841041     0.92   0.359    -.0876434     .242094
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .07722532

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08410415

. est store col3

. 
. reg prior_soc_over_self corona_prime femaleXcorona_prime republican highinc hi
> gheduc female retirement_age infected child alone urban northeast midwest sout
> h [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0337
                                                Root MSE          =     2.2673

-------------------------------------------------------------------------------
              |               Robust
prior_soc_o~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |    .148801   .0858408     1.73   0.083     -.019472     .317074
femaleXcoro~e |   .0018002   .1172922     0.02   0.988    -.2281267    .2317271
   republican |  -.7128208   .0604258   -11.80   0.000    -.8312731   -.5943685
      highinc |  -.0189966   .0654357    -0.29   0.772    -.1472697    .1092765
     higheduc |   .1829761    .062162     2.94   0.003     .0611204    .3048318
       female |   .2368981   .0816613     2.90   0.004      .076818    .3969782
retirement~ge |  -.2665124   .0745157    -3.58   0.000    -.4125849   -.1204399
     infected |   .1628971   .8479162     0.19   0.848    -1.499267    1.825061
        child |  -.2066317   .0731775    -2.82   0.005    -.3500809   -.0631825
        alone |  -.0415965   .0820931    -0.51   0.612    -.2025229    .1193299
        urban |   .0494575   .0711011     0.70   0.487    -.0899214    .1888364
    northeast |  -.0208344   .1079316    -0.19   0.847     -.232412    .1907432
      midwest |   .0531948   .0857293     0.62   0.535    -.1148598    .2212494
        south |  -.0929242   .0779028    -1.19   0.233    -.2456365    .0597882
        _cons |   3.644916   .1126495    32.36   0.000      3.42409    3.865742
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1506012   .0797911     1.89   0.059    -.0058127     .307015
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .15060119

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .07979108

. est store col4

. 
. reg prior_soc_over_self corona_prime retirement_ageXcorona_prime republican hi
> ghinc higheduc female retirement_age infected child alone urban northeast midw
> est south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      15.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0340
                                                Root MSE          =     2.2669

-------------------------------------------------------------------------------
              |               Robust
prior_soc_o~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |    .110964   .0656407     1.69   0.091    -.0177109    .2396389
retirement~me |   .2198079   .1419998     1.55   0.122    -.0585533    .4981691
   republican |  -.7118187   .0603958   -11.79   0.000    -.8302122   -.5934252
      highinc |  -.0212741   .0654689    -0.32   0.745    -.1496122     .107064
     higheduc |   .1839865   .0621675     2.96   0.003     .0621201    .3058529
       female |   .2387245   .0590664     4.04   0.000     .1229372    .3545119
retirement~ge |  -.3746178   .1001919    -3.74   0.000    -.5710233   -.1782124
     infected |   .1653511   .8475776     0.20   0.845    -1.496149    1.826851
        child |  -.2048375    .073141    -2.80   0.005    -.3482152   -.0614598
        alone |  -.0412516   .0820985    -0.50   0.615    -.2021886    .1196855
        urban |    .048947   .0710092     0.69   0.491    -.0902518    .1881459
    northeast |  -.0221711   .1078128    -0.21   0.837    -.2335158    .1891736
      midwest |   .0507015   .0856534     0.59   0.554    -.1172042    .2186071
        south |  -.0944012   .0778626    -1.21   0.225    -.2470347    .0582323
        _cons |   3.664349   .1110428    33.00   0.000     3.446672    3.882025
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
prior_soc_~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3307718   .1259117     2.63   0.009      .083948    .5775957
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .33077184

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .12591174

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/heterogeneitysol.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "Reminder + Interaction)" "Observations" "
> \(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Society over self" "Society over self" "Society over self" "Soci
> ety over self" "Society over self") ///
> b(3)
(note: file tables/heterogeneitysol.tex not found)
(output written to tables/heterogeneitysol.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, COMPASSION, Table S30
. *************************************************************************
. reg compassion_agree corona_prime  republicanXcorona_prime republican highinc 
> higheduc female retirement_age infected child alone urban northeast midwest so
> uth [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      14.33
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0329
                                                Root MSE          =     .86819

-------------------------------------------------------------------------------
              |               Robust
compassion_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0192548   .0292712     0.66   0.511    -.0381253    .0766348
republicanX~e |   .0423743   .0455257     0.93   0.352    -.0468693    .1316179
   republican |   -.273134   .0322944    -8.46   0.000    -.3364404   -.2098276
      highinc |  -.0070717   .0250493    -0.28   0.778    -.0561756    .0420322
     higheduc |  -.0052102   .0242454    -0.21   0.830    -.0527383    .0423178
       female |   .1701858   .0227171     7.49   0.000     .1256538    .2147179
retirement~ge |   .0046593   .0279996     0.17   0.868    -.0502281    .0595466
     infected |   .2384396   .3144983     0.76   0.448     -.378069    .8549482
        child |  -.0024126   .0284968    -0.08   0.933    -.0582748    .0534495
        alone |  -.0766279   .0315845    -2.43   0.015    -.1385428    -.014713
        urban |   .0185041   .0267524     0.69   0.489    -.0339385    .0709467
    northeast |   .0452921   .0419228     1.08   0.280    -.0368888     .127473
      midwest |   .0288924   .0324768     0.89   0.374    -.0347716    .0925564
        south |   .0849134   .0300968     2.82   0.005     .0259148     .143912
        _cons |   4.006172    .041924    95.56   0.000     3.923989    4.088356
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0616291    .034849     1.77   0.077    -.0066851    .1299433
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .06162908

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03484898

. est store col1

. 
. reg compassion_agree corona_prime highincXcorona_prime republican highinc high
> educ female retirement_age infected child alone urban northeast midwest south 
> [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      14.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0331
                                                Root MSE          =     .86813

-------------------------------------------------------------------------------
              |               Robust
compassion_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0065835   .0295031     0.22   0.823    -.0512512    .0644183
highincXcor~e |   .0594035   .0448612     1.32   0.185    -.0285375    .1473446
   republican |  -.2524335   .0231261   -10.92   0.000    -.2977673   -.2070996
      highinc |  -.0359286   .0331193    -1.08   0.278    -.1008521     .028995
     higheduc |  -.0055624    .024245    -0.23   0.819    -.0530898     .041965
       female |   .1702721   .0227166     7.50   0.000     .1257409    .2148033
retirement~ge |   .0035379   .0279898     0.13   0.899    -.0513302     .058406
     infected |   .2445651   .3144634     0.78   0.437    -.3718752    .8610054
        child |  -.0025656   .0285115    -0.09   0.928    -.0584564    .0533252
        alone |  -.0766715   .0315925    -2.43   0.015     -.138602   -.0147411
        urban |   .0185044   .0267682     0.69   0.489    -.0339691    .0709778
    northeast |   .0443338   .0418227     1.06   0.289     -.037651    .1263186
      midwest |   .0272388   .0324351     0.84   0.401    -.0363434     .090821
        south |   .0833249   .0301026     2.77   0.006      .024315    .1423348
        _cons |   4.013988   .0425355    94.37   0.000     3.930606     4.09737
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0659871   .0338445     1.95   0.051     -.000358    .1323322
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .06598709

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0338445

. est store col2

. 
. reg compassion_agree corona_prime higheducXcorona_prime republican highinc hig
> heduc female retirement_age infected child alone urban northeast midwest south
>  [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      14.43
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0328
                                                Root MSE          =     .86825

-------------------------------------------------------------------------------
              |               Robust
compassion_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0408659   .0307575     1.33   0.184    -.0194277    .1011595
higheducXco~e |  -.0106715   .0448428    -0.24   0.812    -.0985764    .0772335
   republican |  -.2522245   .0231214   -10.91   0.000    -.2975492   -.2068997
      highinc |  -.0064943   .0250408    -0.26   0.795    -.0555816    .0425929
     higheduc |  -.0006731   .0325694    -0.02   0.984    -.0645187    .0631725
       female |   .1701672    .022712     7.49   0.000     .1256451    .2146893
retirement~ge |   .0044167   .0279981     0.16   0.875    -.0504677    .0593011
     infected |   .2429804   .3144171     0.77   0.440    -.3733691      .85933
        child |  -.0021943    .028504    -0.08   0.939    -.0580704    .0536818
        alone |  -.0760212   .0316107    -2.40   0.016    -.1379875   -.0140548
        urban |    .018607    .026775     0.69   0.487    -.0338799    .0710938
    northeast |   .0442177   .0418419     1.06   0.291    -.0378047      .12624
      midwest |   .0283267   .0324514     0.87   0.383    -.0352874    .0919409
        south |   .0845783   .0300842     2.81   0.005     .0256043    .1435522
        _cons |   3.995891   .0422007    94.69   0.000     3.913165    4.078617
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0301944   .0327036     0.92   0.356    -.0339142    .0943031
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .03019442

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .03270362

. est store col3

. 
. reg compassion_agree corona_prime femaleXcorona_prime republican highinc highe
> duc female retirement_age infected child alone urban northeast midwest south [
> pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      14.36
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0328
                                                Root MSE          =     .86825

-------------------------------------------------------------------------------
              |               Robust
compassion_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0305819   .0338429     0.90   0.366    -.0357601     .096924
femaleXcoro~e |   .0103256   .0449714     0.23   0.818    -.0778314    .0984826
   republican |   -.252078   .0231315   -10.90   0.000    -.2974224   -.2067335
      highinc |  -.0064203   .0250474    -0.26   0.798    -.0555205      .04268
     higheduc |  -.0059802   .0242447    -0.25   0.805    -.0535068    .0415465
       female |   .1650808   .0313058     5.27   0.000     .1037123    .2264492
retirement~ge |   .0044606   .0280122     0.16   0.873    -.0504514    .0593727
     infected |   .2417186   .3142498     0.77   0.442    -.3743028    .8577401
        child |  -.0023725   .0285306    -0.08   0.934    -.0583007    .0535558
        alone |  -.0761003   .0316028    -2.41   0.016    -.1380511   -.0141496
        urban |   .0187679    .026766     0.70   0.483    -.0337012     .071237
    northeast |   .0443144   .0418105     1.06   0.289    -.0376464    .1262751
      midwest |    .028386   .0324691     0.87   0.382     -.035263    .0920349
        south |   .0845342    .030089     2.81   0.005      .025551    .1435174
        _cons |   4.000792   .0427924    93.49   0.000     3.916907    4.084678
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0409075   .0296237     1.38   0.167    -.0171635    .0989786
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .04090754

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .02962368

. est store col4

. 
. reg compassion_agree corona_prime retirement_ageXcorona_prime republican highi
> nc higheduc female retirement_age infected child alone urban northeast midwest
>  south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      14.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     .86766

-------------------------------------------------------------------------------
              |               Robust
compassion_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0060649   .0252548     0.24   0.810    -.0434418    .0555716
retirement~me |   .1689738   .0536747     3.15   0.002     .0637556     .274192
   republican |  -.2513199   .0231083   -10.88   0.000     -.296619   -.2060208
      highinc |  -.0082024   .0250179    -0.33   0.743    -.0572447      .04084
     higheduc |  -.0051733   .0242344    -0.21   0.831    -.0526799    .0423333
       female |   .1708786   .0227124     7.52   0.000     .1263558    .2154015
retirement~ge |  -.0786839   .0396709    -1.98   0.047    -.1564505   -.0009173
     infected |   .2446005   .3141903     0.78   0.436    -.3713044    .8605054
        child |  -.0008834   .0285028    -0.03   0.975    -.0567573    .0549904
        alone |    -.07583   .0315784    -2.40   0.016    -.1377329    -.013927
        urban |   .0183095   .0267568     0.68   0.494    -.0341416    .0707605
    northeast |   .0431047   .0418414     1.03   0.303    -.0389168    .1251261
      midwest |   .0263562   .0323971     0.81   0.416    -.0371516    .0898641
        south |   .0833535   .0300578     2.77   0.006     .0244313    .1422756
        _cons |   4.013591   .0417158    96.21   0.000     3.931815    4.095366
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
compassion~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1750387    .047354     3.70   0.000     .0822109    .2678665
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .17503869

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04735404

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_compassion.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Compassion" "Compassion" "Compassion" "Compassion" "Compassion")
>  ///
> b(3)
(note: file tables/het_compassion.tex not found)
(output written to tables/het_compassion.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, GLOBAL FIRST, Table S31
. *************************************************************************
. reg prior_global_over_national corona_prime  republicanXcorona_prime republica
> n highinc higheduc female retirement_age infected child alone urban northeast 
> midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0931
                                                Root MSE          =     2.2443

-------------------------------------------------------------------------------
              |               Robust
prior_globa~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0723557   .0799963    -0.90   0.366    -.2291717    .0844604
republicanX~e |   .1505177   .1141681     1.32   0.187    -.0732851    .3743206
   republican |  -1.395797   .0795765   -17.54   0.000     -1.55179   -1.239804
      highinc |  -.1086551   .0647487    -1.68   0.093    -.2355815    .0182714
     higheduc |   .2001265    .062773     3.19   0.001     .0770732    .3231799
       female |  -.1182604   .0590803    -2.00   0.045     -.234075   -.0024458
retirement~ge |  -.4981387   .0701126    -7.10   0.000      -.63558   -.3606974
     infected |   1.067614   .8260587     1.29   0.196    -.5517027    2.686931
        child |  -.0013288     .07308    -0.02   0.985    -.1445871    .1419294
        alone |   .0955902   .0801436     1.19   0.233    -.0615147    .2526951
        urban |   .0929704     .06866     1.35   0.176    -.0416233     .227564
    northeast |   -.116444   .1034713    -1.13   0.260    -.3192779      .08639
      midwest |  -.1555696   .0845647    -1.84   0.066     -.321341    .0102019
        south |  -.1030987   .0792542    -1.30   0.193    -.2584601    .0522628
        _cons |   3.527091    .112942    31.23   0.000     3.305692    3.748491
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0781621    .081396     0.96   0.337    -.0813979     .237722
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .07816206

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08139601

. est store col1

. 
. reg prior_global_over_national corona_prime highincXcorona_prime republican hi
> ghinc higheduc female retirement_age infected child alone urban northeast midw
> est south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0929
                                                Root MSE          =     2.2446

-------------------------------------------------------------------------------
              |               Robust
prior_globa~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0038753   .0801563     0.05   0.961    -.1532545    .1610051
highincXcor~e |  -.0350072   .1164792    -0.30   0.764    -.2633406    .1933262
   republican |  -1.320853   .0584167   -22.61   0.000    -1.435367   -1.206339
      highinc |  -.0891012    .085934    -1.04   0.300    -.2575569    .0793545
     higheduc |   .1972897   .0627856     3.14   0.002     .0742115    .3203679
       female |  -.1184406   .0590874    -2.00   0.045    -.2342692    -.002612
retirement~ge |  -.4984928   .0700974    -7.11   0.000    -.6359042   -.3610813
     infected |   1.082344    .826628     1.31   0.190    -.5380884    2.702777
        child |  -.0005476   .0730905    -0.01   0.994    -.1438263    .1427312
        alone |   .0978257   .0802203     1.22   0.223    -.0594296     .255081
        urban |    .093747   .0686728     1.37   0.172    -.0408717    .2283656
    northeast |  -.1207995   .1033846    -1.17   0.243    -.3234635    .0818645
      midwest |  -.1572329    .084472    -1.86   0.063    -.3228227    .0083569
        south |  -.1039496   .0792424    -1.31   0.190    -.2592879    .0513886
        _cons |   3.489969   .1137502    30.68   0.000     3.266986    3.712953
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0311319   .0844506    -0.37   0.712    -.1966798    .1344161
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.03113186

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08445064

. est store col2

. 
. reg prior_global_over_national corona_prime higheducXcorona_prime republican h
> ighinc higheduc female retirement_age infected child alone urban northeast mid
> west south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0930
                                                Root MSE          =     2.2443

-------------------------------------------------------------------------------
              |               Robust
prior_globa~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0488563   .0814742     0.60   0.549     -.110857    .2085696
higheducXco~e |  -.1326335   .1162591    -1.14   0.254    -.3605354    .0952683
   republican |  -1.322699   .0584116   -22.64   0.000    -1.437203   -1.208195
      highinc |   -.106941    .064751    -1.65   0.099    -.2338718    .0199898
     higheduc |    .263043   .0837228     3.14   0.002     .0989218    .4271642
       female |  -.1182148   .0590787    -2.00   0.045    -.2340263   -.0024034
retirement~ge |  -.4989784   .0701168    -7.12   0.000    -.6364279   -.3615289
     infected |   1.084741   .8262706     1.31   0.189     -.534991    2.704473
        child |  -.0000967   .0730849    -0.00   0.999    -.1433644    .1431711
        alone |   .0983952   .0801704     1.23   0.220    -.0587622    .2555526
        urban |   .0925836    .068636     1.35   0.177    -.0419631    .2271302
    northeast |  -.1192517   .1033029    -1.15   0.248    -.3217556    .0832522
      midwest |  -.1569461   .0845079    -1.86   0.063    -.3226062    .0087141
        south |  -.1034336   .0791976    -1.31   0.192    -.2586842    .0518169
        _cons |   3.469002    .114248    30.36   0.000     3.245043    3.692962
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0837772   .0828949    -1.01   0.312    -.2462753     .078721
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.08377719

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .08289486

. est store col3

. 
. reg prior_global_over_national corona_prime femaleXcorona_prime republican hig
> hinc higheduc female retirement_age infected child alone urban northeast midwe
> st south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0929
                                                Root MSE          =     2.2446

-------------------------------------------------------------------------------
              |               Robust
prior_globa~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |   .0027408   .0870101     0.03   0.975    -.1678245    .1733061
femaleXcoro~e |  -.0315392   .1166849    -0.27   0.787    -.2602757    .1971973
   republican |  -1.321098   .0584174   -22.61   0.000    -1.435613   -1.206582
      highinc |  -.1065799   .0647579    -1.65   0.100    -.2335243    .0203646
     higheduc |   .1976217   .0627587     3.15   0.002     .0745964     .320647
       female |  -.1028735   .0812153    -1.27   0.205    -.2620793    .0563323
retirement~ge |  -.4991511   .0701047    -7.12   0.000    -.6365768   -.3617253
     infected |   1.086855    .826317     1.32   0.188    -.5329678    2.706678
        child |   -.000349   .0731036    -0.00   0.996    -.1436535    .1429555
        alone |   .0975039   .0802057     1.22   0.224    -.0597228    .2547305
        urban |   .0934038   .0687115     1.36   0.174    -.0412909    .2280985
    northeast |  -.1213066   .1032687    -1.17   0.240    -.3237435    .0811304
      midwest |  -.1582307    .084499    -1.87   0.061    -.3238735     .007412
        south |  -.1047912   .0792149    -1.32   0.186    -.2600756    .0504932
        _cons |   3.491653   .1143392    30.54   0.000     3.267515    3.715792
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0287983   .0776625    -0.37   0.711    -.1810396    .1234429
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.02879835

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .0776625

. est store col4

. 
. reg prior_global_over_national corona_prime retirement_ageXcorona_prime republ
> ican highinc higheduc female retirement_age infected child alone urban northea
> st midwest south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      49.28
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0932
                                                Root MSE          =     2.2442

-------------------------------------------------------------------------------
              |               Robust
prior_globa~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0530402   .0659997    -0.80   0.422    -.1824188    .0763385
retirement~me |    .224948   .1334778     1.69   0.092    -.0367075    .4866035
   republican |  -1.320026     .05839   -22.61   0.000    -1.434488   -1.205565
      highinc |  -.1087938   .0647248    -1.68   0.093    -.2356733    .0180858
     higheduc |   .1985432    .062724     3.17   0.002     .0755859    .3215005
       female |  -.1174075   .0590844    -1.99   0.047    -.2332302   -.0015847
retirement~ge |  -.6096344   .0942169    -6.47   0.000    -.7943271   -.4249417
     infected |   1.085651   .8258428     1.31   0.189    -.5332428    2.704544
        child |   .0010775   .0730659     0.01   0.988     -.142153    .1443081
        alone |   .0978375   .0801995     1.22   0.223    -.0593769    .2550519
        urban |   .0931278   .0686568     1.36   0.175    -.0414597    .2277153
    northeast |  -.1219945   .1032664    -1.18   0.237     -.324427    .0804379
      midwest |  -.1603604    .084452    -1.90   0.058    -.3259111    .0051903
        south |  -.1061337   .0791787    -1.34   0.180    -.2613472    .0490798
        _cons |    3.51953   .1111017    31.68   0.000     3.301738    3.737322
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
prior_glob~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1719079   .1161465     1.48   0.139    -.0557732    .3995889
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .17190786

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .11614647

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/heterogeneity_prior_global.tex, /
> //
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("Global" "Global" "Global" "Global" "Global") ///
> b(3)
(note: file tables/heterogeneity_prior_global.tex not found)
(output written to tables/heterogeneity_prior_global.tex)

. 
. *************************************************************************
. *PRIMING EFFECT, HETEROGENEITY, NO BORDERS, Table S32
. *************************************************************************
. reg noborders_agree corona_prime republicanXcorona_prime republican highinc hi
> gheduc female retirement_age infected child alone urban northeast midwest sout
> h [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      84.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1534
                                                Root MSE          =     1.2429

-------------------------------------------------------------------------------
              |               Robust
noborders_a~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0530371    .042322    -1.25   0.210    -.1360006    .0299264
republicanX~e |   .0688694   .0652327     1.06   0.291    -.0590059    .1967446
   republican |  -1.034821   .0460765   -22.46   0.000    -1.125145   -.9444979
      highinc |  -.0958413   .0355073    -2.70   0.007    -.1654459   -.0262367
     higheduc |  -.0155171   .0349522    -0.44   0.657    -.0840338    .0529995
       female |  -.1721863   .0324614    -5.30   0.000    -.2358202   -.1085525
retirement~ge |   -.179435   .0394906    -4.54   0.000    -.2568482   -.1020219
     infected |   .8452368   .4616556     1.83   0.067    -.0597432    1.750217
        child |   .1958783   .0417194     4.70   0.000      .114096    .2776606
        alone |   .0068701   .0412182     0.17   0.868    -.0739295    .0876698
        urban |   .0899119   .0372874     2.41   0.016     .0168177    .1630062
    northeast |  -.0395401   .0580229    -0.68   0.496    -.1532818    .0742017
      midwest |  -.1171842   .0480328    -2.44   0.015    -.2113425   -.0230258
        south |  -.0886692   .0440158    -2.01   0.044    -.1749531   -.0023854
        _cons |   3.182554   .0603142    52.77   0.000     3.064321    3.300788
-------------------------------------------------------------------------------

. lincom corona_prime +  republicanXcorona_prime

 ( 1)  corona_prime + republicanXcorona_prime = 0

------------------------------------------------------------------------------
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0158323   .0497166     0.32   0.750    -.0816268    .1132915
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .01583231

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04971664

. est store col1

. 
. reg noborders_agree corona_prime highincXcorona_prime republican highinc highe
> duc female retirement_age infected child alone urban northeast midwest south [
> pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      84.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1532
                                                Root MSE          =      1.243

-------------------------------------------------------------------------------
              |               Robust
noborders_a~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0218377   .0404632    -0.54   0.589    -.1011574     .057482
highincXcor~e |    -.00855   .0648088    -0.13   0.895    -.1355943    .1184943
   republican |  -1.000574   .0335257   -29.84   0.000    -1.066294   -.9348535
      highinc |  -.0905993   .0471832    -1.92   0.055    -.1830923    .0018936
     higheduc |   -.016767   .0349832    -0.48   0.632    -.0853443    .0518103
       female |   -.172254   .0324664    -5.31   0.000    -.2358976   -.1086104
retirement~ge |  -.1797072   .0394957    -4.55   0.000    -.2571303   -.1022841
     infected |     .85219   .4618117     1.85   0.065     -.053096    1.757476
        child |   .1961956   .0417412     4.70   0.000     .1143706    .2780205
        alone |   .0078204   .0412765     0.19   0.850    -.0730935    .0887344
        urban |   .0902437   .0372841     2.42   0.016      .017156    .1633314
    northeast |  -.0415041   .0580309    -0.72   0.475    -.1552616    .0722535
      midwest |   -.118073    .048044    -2.46   0.014    -.2122533   -.0238928
        south |   -.089204   .0440407    -2.03   0.043    -.1755368   -.0028713
        _cons |   3.167539   .0606391    52.24   0.000     3.048668    3.286409
-------------------------------------------------------------------------------

. lincom corona_prime + highincXcorona_prime

 ( 1)  corona_prime + highincXcorona_prime = 0

------------------------------------------------------------------------------
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0303877   .0506308    -0.60   0.548    -.1296389    .0688634
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.03038773

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .05063079

. est store col2

. 
. reg noborders_agree corona_prime higheducXcorona_prime  republican highinc hig
> heduc female retirement_age infected child alone urban northeast midwest south
>  [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      84.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1532
                                                Root MSE          =      1.243

-------------------------------------------------------------------------------
              |               Robust
noborders_a~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0391713   .0429812    -0.91   0.362     -.123427    .0450844
higheducXco~e |   .0279618    .064868     0.43   0.666    -.0991984     .155122
   republican |  -1.000276    .033524   -29.84   0.000    -1.065993   -.9345592
      highinc |  -.0947419   .0355296    -2.67   0.008    -.1643902   -.0250935
     higheduc |  -.0305264   .0468947    -0.65   0.515    -.1224538     .061401
       female |  -.1722701   .0324643    -5.31   0.000    -.2359097   -.1086305
retirement~ge |  -.1798398   .0394543    -4.56   0.000    -.2571818   -.1024978
     infected |   .8521398   .4618172     1.85   0.065     -.053157    1.757437
        child |   .1960147   .0417293     4.70   0.000     .1142131    .2778163
        alone |   .0075456   .0412573     0.18   0.855    -.0733308     .088422
        urban |   .0904388   .0373191     2.42   0.015     .0172824    .1635951
    northeast |  -.0417688   .0580492    -0.72   0.472    -.1555621    .0720246
      midwest |  -.1184061   .0480472    -2.46   0.014    -.2125927   -.0242196
        south |  -.0896231   .0440041    -2.04   0.042     -.175884   -.0033622
        _cons |    3.17616   .0604754    52.52   0.000     3.057611     3.29471
-------------------------------------------------------------------------------

. lincom corona_prime + higheducXcorona_prime

 ( 1)  corona_prime + higheducXcorona_prime = 0

------------------------------------------------------------------------------
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0112095   .0486658    -0.23   0.818    -.1066088    .0841897
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.01120954

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04866581

. est store col3

. 
. reg noborders_agree corona_prime femaleXcorona_prime republican highinc highed
> uc female retirement_age infected child alone urban northeast midwest south [p
> w=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      84.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1532
                                                Root MSE          =      1.243

-------------------------------------------------------------------------------
              |               Robust
noborders_a~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0399764   .0499403    -0.80   0.423     -.137874    .0579212
femaleXcoro~e |   .0272486    .064829     0.42   0.674    -.0998352    .1543325
   republican |  -1.000585   .0335278   -29.84   0.000     -1.06631   -.9348611
      highinc |  -.0947459   .0355332    -2.67   0.008    -.1644013   -.0250905
     higheduc |  -.0168037   .0349892    -0.48   0.631    -.0853927    .0517853
       female |  -.1856267   .0449317    -4.13   0.000     -.273706   -.0975473
retirement~ge |  -.1797108   .0394675    -4.55   0.000    -.2570786   -.1023429
     infected |    .849401   .4616814     1.84   0.066    -.0556296    1.754432
        child |   .1958151   .0417551     4.69   0.000      .113963    .2776673
        alone |   .0077216   .0412727     0.19   0.852     -.073185    .0886281
        urban |   .0904179   .0372864     2.42   0.015     .0173257    .1635101
    northeast |  -.0409159   .0580375    -0.70   0.481    -.1546864    .0728546
      midwest |  -.1178749    .048027    -2.45   0.014    -.2120219   -.0237279
        south |  -.0892326   .0440277    -2.03   0.043    -.1755397   -.0029255
        _cons |   3.176316   .0616871    51.49   0.000     3.055391     3.29724
-------------------------------------------------------------------------------

. lincom corona_prime + femaleXcorona_prime

 ( 1)  corona_prime + femaleXcorona_prime = 0

------------------------------------------------------------------------------
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0127277   .0413687    -0.31   0.758    -.0938225     .068367
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  -.01272773

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .04136869

. est store col4

. 
. reg noborders_agree corona_prime retirement_ageXcorona_prime republican highin
> c higheduc female retirement_age infected child alone urban northeast midwest 
> south [pw=weight], robust
(sum of wgt is 7,213.05472266674)

Linear regression                               Number of obs     =      7,239
                                                F(14, 7224)       =      85.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1544
                                                Root MSE          =     1.2421

-------------------------------------------------------------------------------
              |               Robust
noborders_a~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
 corona_prime |  -.0700111   .0365963    -1.91   0.056    -.1417506    .0017285
retirement~me |   .2493149   .0750056     3.32   0.001      .102282    .3963479
   republican |  -.9994835   .0334886   -29.85   0.000    -1.065131   -.9338361
      highinc |  -.0974174   .0354865    -2.75   0.006    -.1669813   -.0278535
     higheduc |  -.0155727   .0349353    -0.45   0.656    -.0840562    .0529108
       female |  -.1711688   .0324317    -5.28   0.000    -.2347444   -.1075932
retirement~ge |  -.3024417   .0536196    -5.64   0.000    -.4075518   -.1973316
     infected |   .8549904   .4627932     1.85   0.065    -.0522197      1.7622
        child |   .1981596   .0417044     4.75   0.000     .1164068    .2799123
        alone |   .0081274   .0412253     0.20   0.844    -.0726861     .088941
        urban |   .0896528   .0372637     2.41   0.016      .016605    .1627007
    northeast |  -.0429456   .0580616    -0.74   0.460    -.1567632    .0708721
      midwest |  -.1210216   .0479566    -2.52   0.012    -.2150306   -.0270126
        south |  -.0910355   .0439294    -2.07   0.038    -.1771499   -.0049211
        _cons |   3.192324   .0597453    53.43   0.000     3.075206    3.309442
-------------------------------------------------------------------------------

. lincom corona_prime + retirement_ageXcorona_prime

 ( 1)  corona_prime + retirement_ageXcorona_prime = 0

------------------------------------------------------------------------------
noborders_~e |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1793039   .0654248     2.74   0.006     .0510522    .3075555
------------------------------------------------------------------------------

. estadd scalar Wint1 r(estimate)

added scalar:
              e(Wint1) =  .17930388

. estadd scalar sd1 r(se)

added scalar:
                e(sd1) =  .06542476

. est store col5

. 
. esttab col1 col2 col3 col4 col5 using tables/het_noborders.tex, ///
> replace star(* 0.10 ** 0.05 *** 0.01) booktabs se stats(Wint1 sd1 N r2, layout
> (@ (@)) labels("Linear combination" "(Reminder + Interaction)" "Observations" 
> "\(R^{2}\)")) /// ///
> keep(corona_prime republicanXcorona_prime retirement_ageXcorona_prime femaleXc
> orona_prime higheducXcorona_prime highincXcorona_prime retirement_age female h
> ighinc republican higheduc child alone urban infected northeast midwest south 
> _cons) ///
> label mtitle("No borders" "No borders" "No borders" "No borders" "No borders")
>  ///
> b(3)
(note: file tables/het_noborders.tex not found)
(output written to tables/het_noborders.tex)

. 
end of do-file

