--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/sameos/Documents/gits/mmnyt/data/scripts/cleaning_ipsos_mmnyt
> _release.log
  log type:  text
 opened on:  11 May 2020, 13:50:19

.         
. *Loading data:  
. use ../raw/ipsos_mmnyt_release, clear

. est clear

. 
. *Cleaning dataset
. drop ReturnCode IDType MRK_SMPGRP MRK_SMPSRC

. drop MRK_STATUS_GDW MRK_DIFF_TIME_GDW QUOTA_GDW QUOTA_CAN_GENDER_GDW QUOTA_CAN
> _AGERANGE_GDW QUOTA_CAN_REGION_GDW

. drop MRK_ROT_GDW_1 MRK_ROT_GDW_2 QMRK_TREAT_GDW_2

. 
. rename USHOU1 house

. rename QTREATMENT1_1 prime_affected

. rename QTREATMENT1_2 prime_weeks

. rename QTREATMENT3 luck_unfair_agree

. rename QTREATMENT4 luck_determ_agree

. rename QTREATMENT5 prior_self_over_soc

. rename QTREATMENT6 compassion_agree

. rename QTREATMENT7 prior_national_over_global

. rename QTREATMENT8 noborders_agree

. rename QTREATMENT9 gov_reduce_inequality_agree

. rename QGDW5A fed_univ_healthcare

. 
. rename resp_age age

. 
. decode State_Recoded, generate(state)

. 
. gen corona=1

. gen weight=Weightvar

. 
. gen corona_prime=0 if luck_unfair_agree!=.
(3,303 missing values generated)

. replace corona_prime=1 if prime_affected<11 
(4,074 real changes made)

. label variable corona_prime "Covid-19"

. 
. label define labels54 5 "Strongly agree" 4 "Somewhat agree" 3 "Neither agree n
> or disagree" 2 "Somewhat disagree" 1 "Strongly disagree", replace

. 
. replace luck_unfair_agree=6-luck_unfair_agree if luck_unfair_agree!=.
(5,783 real changes made)

. replace luck_determ_agree=6-luck_determ_agree if luck_determ_agree!=.
(5,855 real changes made)

. replace compassion_agree=6-compassion_agree if compassion_agree!=.
(6,718 real changes made)

. replace noborders_agree=6-noborders_agree if noborders_agree!=.
(6,178 real changes made)

. replace gov_reduce_inequality_agree=4-gov_reduce_inequality_agree if gov_reduc
> e_inequality_agree!=.
(5,931 real changes made)

. 
. label values luck_determ_agree labels54

. label values compassion_agree labels54

. label values noborders_agree labels54

. label define labels60 3 "Generally agree" 2 "Neither agree nor disagree" 1 "Ge
> nerally disagree", replace

. 
. replace fed_univ_healthcare=0 if fed_univ_healthcare==1
(3,130 real changes made)

. replace fed_univ_healthcare=1 if fed_univ_healthcare==2
(4,986 real changes made)

. label define labels61 2 "", modify

. label define labels61 1 "Yes, government is responsible", modify

. label define labels61 0 "No, government is not responsible", add

. 
. *Generating income variable from USHHI2
. gen income=.
(11,419 missing values generated)

. replace income=5000 if USHHI2==1
(440 real changes made)

. replace income=7500 if USHHI2==2
(274 real changes made)

. replace income=12500 if USHHI2==3
(475 real changes made)

. replace income=17500 if USHHI2==4
(445 real changes made)

. replace income=22500 if USHHI2==5
(566 real changes made)

. replace income=27500 if USHHI2==6
(581 real changes made)

. replace income=32500 if USHHI2==7
(605 real changes made)

. replace income=37500 if USHHI2==8
(550 real changes made)

. replace income=42500 if USHHI2==9
(468 real changes made)

. replace income=47500 if USHHI2==10
(529 real changes made)

. replace income=52500 if USHHI2==11
(614 real changes made)

. replace income=57500 if USHHI2==12
(661 real changes made)

. replace income=62500 if USHHI2==13
(411 real changes made)

. replace income=67500 if USHHI2==14
(364 real changes made)

. replace income=72500 if USHHI2==15
(422 real changes made)

. replace income=77500 if USHHI2==16
(463 real changes made)

. replace income=85000 if USHHI2==17
(526 real changes made)

. replace income=95000 if USHHI2==18
(630 real changes made)

. replace income=112500 if USHHI2==19
(978 real changes made)

. replace income=137500 if USHHI2==20
(571 real changes made)

. replace income=162500 if USHHI2==21
(515 real changes made)

. replace income=225000 if USHHI2==22
(182 real changes made)

. replace income=250000 if USHHI2==23
(149 real changes made)

. replace income=. if USHHI2==24
(0 real changes made)

. 
. *Generating living alone
. gen alone=0

. replace alone=1 if HHCMP10==1
(2,447 real changes made)

. label variable alone "Living alone" 

. 
. *Generating highincome (above median in sample - should be US)
. sum income [weight=Weightvar], detail
(analytic weights assumed)

                           income
-------------------------------------------------------------
      Percentiles      Smallest
 1%         5000           5000
 5%         7500           5000
10%        17500           5000       Obs              11,419
25%        32500           5000       Sum of Wgt.      11,419

50%        67500                      Mean           77845.63
                        Largest       Std. Dev.      55149.57
75%       112500         250000
90%       162500         250000       Variance       3.04e+09
95%       162500         250000       Skewness       1.012058
99%       250000         250000       Kurtosis       3.840813

. return list

scalars:
                  r(N) =  11419
              r(sum_w) =  11419.00000000001
               r(mean) =  77845.63363264549
                r(Var) =  3041474681.649092
                 r(sd) =  55149.56646836938
           r(skewness) =  1.0120577881746
           r(kurtosis) =  3.840812658451618
                r(sum) =  888919290.4511795
                r(min) =  5000
                r(max) =  250000
                 r(p1) =  5000
                 r(p5) =  7500
                r(p10) =  17500
                r(p25) =  32500
                r(p50) =  67500
                r(p75) =  112500
                r(p90) =  162500
                r(p95) =  162500
                r(p99) =  250000

. 
. gen highinc=1 if income>67500
(6,983 missing values generated)

. replace highinc=0 if income<67501
(6,983 real changes made)

. replace highinc=. if income==.
(0 real changes made)

. label variable highinc "High inc." 

. 
. *Generating highage (above median in US)
. gen highage=1 if age>46
(5,383 missing values generated)

. replace highage=0 if age<47
(5,383 real changes made)

. replace highage=. if age==.
(0 real changes made)

. label variable highage "High age" 

. 
. *Generating retired-dummy
. gen retirement_age=1 if age>65
(9,331 missing values generated)

. replace retirement_age=0 if age<66
(9,331 real changes made)

. replace retirement_age=. if age==.
(0 real changes made)

. label variable retirement_age "Retirement age" 

. 
. label variable age "Age"

. 
. *Generating conservative (republican) vs. non-republican dummy (includes 'pref
> er not to answer'):
. gen conservative=1 if GDW6==1
(7,224 missing values generated)

. replace conservative=0 if GDW6!=1
(7,224 real changes made)

. 
. *Generating republican vs. non-republican dummy:
. gen republican=1 if GDW6==1
(7,224 missing values generated)

. replace republican=0 if GDW6==2
(4,810 real changes made)

. replace republican=0 if GDW6==3
(1,146 real changes made)

. label variable republican "Republican"

. 
. *Generating urban (incl semiurban) vs. rural dummy:
. gen urban=1 if LIV==3
(8,668 missing values generated)

. replace urban=1 if LIV==2
(5,887 real changes made)

. replace urban=0 if LIV==1
(2,781 real changes made)

. label variable urban "Urban"

. 
. *Generating female vs. male dummy:
. gen female=1 if resp_gender==2
(5,245 missing values generated)

. replace female=0 if resp_gender!=2
(5,245 real changes made)

. label variable female "Female"

. 
. *Generating education dummy
. gen higheduc=1 if usedu3_der==6 | usedu3_der==7
(6,687 missing values generated)

. replace higheduc=0 if usedu3_der<6
(6,687 real changes made)

. label variable higheduc "High educ."

. 
. *Generating child-dummy (having at least one child under 18 in your household)
. gen child=0

. replace child=1 if KIDS02>0
(2,767 real changes made)

. label variable child "Child"

. 
. *Generating region dummies
. gen northeast=0

. replace northeast=1 if HCAL_STDREGION_4CODES_US==1
(2,282 real changes made)

. label variable northeast "Northeast"

. 
. gen midwest=0

. replace midwest=1 if HCAL_STDREGION_4CODES_US==2
(2,650 real changes made)

. label variable midwest "Midwest"

. 
. gen south=0

. replace south=1 if HCAL_STDREGION_4CODES_US==3
(3,994 real changes made)

. label variable south "South"

. 
. gen west=0

. replace west=1 if HCAL_STDREGION_4CODES_US==4
(2,493 real changes made)

. label variable west "West"

. 
. 
. save ../processed/ipsos_mmnyt_processed_release, replace
file ../processed/ipsos_mmnyt_processed_release.dta saved

. 
end of do-file

